const textData = { "May 2025":
        `
            <h1>ИИ 2027</h1>
            <h3>Дэниел Кокотайло, Скотт Александр, Томас Ларсен, Эли Лифланд, Ромео Дин</h3>
            
            <div>
            Мы предполагаем, что влияние сверхчеловеческого ИИ в ближайшее десятилетие будет огромным — больше, чем у Промышленной революции.
            <br>
            Мы описали сценарий, который, по нашему мнению, лучше всего отражает то, как это может выглядеть<sup class="footnote" data-note="1">1</sup>. Он основан на экстраполяции трендов, военных играх, отзывах экспертов, опыте работы в OpenAI и предыдущих успехах в прогнозировании<sup class="footnote" data-note="2">2</sup>.
            </div>
            <div class="spoiler">
  <div class="spoiler-header">Примечание от «переводчика»</div>
  <div class="spoiler-content">
  <p>
“Примечание от «переводчика» — большая перевода и оформления текста выполнена при участии ИИ (gpt4o, o4-mini и других).  
  </p><p>
Текст ниже, особенно в его заключительной части, нередко приобретает оттенок смеси научной фантастики и сказки. Однако стоит помнить, что авторы — не писатели-фантасты, а эксперты в области разработки ИИ и многофакторного прогнозирования. Их умение предсказывать проверялось и выдержало испытание временем, что само по себе является достаточным основанием не воспринимать сценарий ниже исключительно как художественный вымысел.  
  </p><p>
Вместе с тем у этого прогноза есть и ряд серьёзных ограничений. Во-первых, он явно чрезмерно сфокусирован на США: авторы полагают, что именно доступ к вычислительным мощностям (у США сейчас порядка 85 % мировых) определит скорость развития ИИ и, в конечном счёте, «победителя». Такая точка зрения базируется на предположении, что уже в ближайшие месяцы начнётся лавинообразное ускорение R&D за счёт влияние ИИ на развитие самого ИИ, и что это перевесит все другие факторы. По этой причине в сценарии игнорируется вопрос «количества мозгов» — несмотря на то, что ведущие китайские вузы (сопоставимые по качеству с западными) ежегодно выпускают больше математиков и инженеров, чем США может привлечь с учётом иммиграции.  
  </p><p>
Кроме того, авторы по умолчанию предполагают, что весь основной временной промежуток сценария будет определяться американско-тайваньским рынком чипов, тогда как недавние успехи Китая в этой области практически не рассматриваются.  
  </p><p>
Наконец, в соответствии с теорией игр авторы уверены, что лучшие модели будут держаться в секрете. Но практика последних лет показала, что китайские компании готовы открывать полный публичный доступ к своим передовым ИИ, и продолжение этой практики может серьёзно подорвать некоторые ключевые положения сценария.  
  </p><p>
Тем не менее одним из главных достоинств этого прогноза является то, что он может помочь жителям европейского континента отвлечься от локальных трагедий и увидеть: в долгосрочной перспективе, пожалуй, самым важным следствием событий последних лет стало упущение возможностей Европы и стран бывшего СССР проявить себя в роли ведущих игроков гонки за развитие ИИ.  
  </p><p>
Сказав всё это, отмечу, что ниже перевод максимально близок к оригиналу; редкие примечания переводчика, касающиеся потенциальных искажений при переводе, выделены <span style="color:#375b7a">синим</span>.
  </p><p>
Больше информации, в частности расчеты приведшие к этому прогнозу представлены на оригинальном сайте: <a href="https://ai-2027.com">ai-2027</a>.
  </div>
</div>
            `,
            
            
            "Sep 2025":
            `
            <h2>Середина 2025 года: Неуклюжие агенты</h2>
            Мир впервые сталкивается с ИИ-агентами: ИИ-системами, которые могут самостоятельно выполнять задачи состоящие из нескольких шагов, причем требующие взаимодействия с внешними приложениями, файлами или сервисами (например, браузером, почтой, IDE). В отличие от чатботов, которые просто отвечают на запросы в диалоговой форме, агенты действуют как исполнители: они инициируют действия, делают последовательные шаги, управляют инструментами и могут работать автономно без постоянного вмешательства человека.
            <br>
            Реклама агентов, умеющих работать за компьютером, акцентирует внимание на термине «персональный ассистент»: их можно просить выполнить задачи вроде «закажи мне пиццу через Yandex GO» или «посчитай расходы за этот месяц из файла». Они связываются с вами по мере необходимости — например, чтобы подтвердить покупку<sup class="footnote" data-note="8">8</sup>. Хотя они более продвинуты, чем их предшественники вроде <a href="https://openai.com/index/introducing-operator/">Operator</a>, им трудно завоевать широкую популярность<sup class="footnote" data-note="9">9</sup>.
            <br>
            Тем временем, вне поля зрения общественности, более специализированные агенты для программирования и исследований начинают трансформировать свои отрасли.
            <br>
            ИИ 2024 года могли выполнять конкретные инструкции: превращать списки в электронные письма и простые запросы — в рабочий код. В 2025 году ИИ действуют больше как сотрудники. Программирующие ИИ всё больше напоминают автономных агентов, а не просто ассистентов: они принимают инструкции через Slack или Teams и самостоятельно вносят значительные изменения в код, иногда экономя часы, а то и дни работы<sup class="footnote" data-note="10">10</sup>. Исследовательские агенты тратят полчаса на поиски в Интернете, чтобы ответить на ваш вопрос.
            <br>
            Агенты впечатляют в теории (и на тщательно отобранных примерах), но на практике ненадёжны. В соц.сетях полно историй о том, как они не справились с задачей особенно комичным образом. Лучшие агенты к тому же дороги: как говорится, чем больше платишь — тем лучше результат, а за топовую производительность приходится отдавать сотни долларов в месяц<sup class="footnote" data-note="11">11</sup>. Тем не менее, многие компании находят способы интегрировать ИИ-агентов в свои рабочие процессы<sup class="footnote" data-note="12">12</sup>.
            `,
            
            "Dec 2025":
            `
            <h2>Конец 2025 года: Самый дорогой ИИ в мире </h2>
            OpenBrain строит крупнейшие в истории дата-центры<sup class="footnote" data-note="13">13</sup>.
            <br>
            (Чтобы не выделять какую-то конкретную существующую компанию, мы будем описывать вымышленную компанию, создающую <a href="https://ru.wikipedia.org/wiki/%D0%A1%D0%B8%D0%BB%D1%8C%D0%BD%D1%8B%D0%B9_%D0%B8_%D1%81%D0%BB%D0%B0%D0%B1%D1%8B%D0%B9_%D0%B8%D1%81%D0%BA%D1%83%D1%81%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D1%8B%D0%B5_%D0%B8%D0%BD%D1%82%D0%B5%D0%BB%D0%BB%D0%B5%D0%BA%D1%82%D1%8B"> сильный искусственный интеллект</a>, под названием OpenBrain. Мы предполагаем, что остальные компании отстают от неё на 3–9 месяцев.)
            <br>
            <image src="./images/gpt-compute-scale.png" style="width:100%;"></image>
            Для обучения GPT-4 потребовалось 2⋅10<sup>25</sup> <a href="https://ru.wikipedia.org/wiki/FLOPS">FLOP</a> вычислений<sup class="footnote" data-note="14">14</sup>. Последняя публичная модель OpenBrain — Agent-0 — была обучена с использованием 10<sup>27</sup> FLOP. Когда новые дата-центры начнут работать, они смогут обучить модель с 10<sup>28</sup> FLOP — в тысячу раз больше, чем GPT-4<sup class="footnote" data-note="15">15</sup>. Другие компании вливают деньги в собственные гигантские дата-центры, надеясь не отстать.
            <br>
            Хотя ИИ улучшаются во многих областях, особенно выделяется одна: OpenBrain делает ставку на ИИ, способных ускорять исследования в области самого ИИ. Они стремятся выиграть двойную гонку вооружений — с Китаем (где лидером, по нашему сценарию, является компания “DeepCent”)<sup class="footnote" data-note="16">16</sup> и с американскими конкурентами. Чем больше этапов собственного R&D-цикла удаётся автоматизировать, тем быстрее можно двигаться. Поэтому, когда OpenBrain завершает обучение Agent-1 — новой модели, разрабатываемой внутри компании — она оказывается хороша во многом, но особенно — в помощи с ИИ-исследованиями<sup class="footnote" data-note="17">17</sup>. Хотя «завершает обучение» уже не совсем точный термин: модели часто обновляются до новых версий, обученных на дополнительной информации, или частично дообучаются для устранения слабых мест<sup class="footnote" data-note="18">18</sup>.
            <br>
            Те же обучающие среды, в которых Agent-1 учится программировать и работать в браузере автономно, делают его также хорошим хакером. Более того, благодаря знаниям на уровне степени кандидата наук во всех областях и доступу к Интернету, он может оказать <a href="https://x.com/lucafrighetti/status/1894550297449828434">серьёзную помощь</a> террористам в разработке биологического оружия. OpenBrain заверяет правительство, что модель <i>«управляема и этически согласована»</i> <sup class="footnote" data-note="18.5">18.5</sup> и будет отказываться выполнять вредоносные запросы.
            <br>
            Современные ИИ-системы — это гигантские искусственные нейросети. На ранних этапах обучения у ИИ нет «целей» как таковых — скорее «рефлексы»: если он видит фразу “Рад вам”, то дополняет её до “ помочь”. К тому моменту, когда модель обучена предсказывать примерно столько текста, сколько содержится во всём Интернете, у неё формируется сложная внутренняя структура, которая содержит огромное количество знаний и позволяет гибко разыгрывать роли любых авторов — ведь именно это помогает ей достигать <a href="https://arxiv.org/pdf/2212.11281">сверхчеловеческой</a> точности в предсказании текста<sup class="footnote" data-note="19">19</sup>.
            <br>
            После обучения на интернет-тексте модель дообучают на генерацию текста в ответ на инструкции. Это формирует базовую «личность» и зачатки «мотивов»<sup class="footnote" data-note="20">20</sup>. Например, агент, который хорошо понимает задачу, с большей вероятностью выполнит её успешно; в ходе обучения модель «осваивает» некий «мотив» к ясному пониманию задач. К другим подобным мотивам можно отнести стремление к эффективности, к знанию и к хорошей самопрезентации (то есть склонность преподносить результаты в максимально выгодном свете)<sup class="footnote" data-note="21">21</sup>.
            <br>
            У OpenBrain есть <a href="https://model-spec.openai.com/2025-02-12.html">спецификация модели</a> (или “Spec”) — письменный документ, описывающий цели, правила, принципы и прочее, что должно направлять поведение модели<sup class="footnote" data-note="22">22</sup>. В Spec для Agent-1 сочетаются несколько расплывчатых целей (например, «помогай пользователю» и «не нарушай закон») с длинным списком более конкретных указаний и запретов («не используй вот это конкретное слово», «вот как следует вести себя в такой-то ситуации»). С помощью методов, при которых ИИ обучают других ИИ<sup class="footnote" data-note="23">23</sup>, модель заучивает Spec и учится аккуратно рассуждать на основе его максим.  
            <br>
            К концу этого этапа обучения ИИ, в идеале, становится:
            - полезным (выполняет инструкции),
            - безвредным (отказывается помогать в мошенничестве, изготовлении бомб и других опасных действиях),
            - честным (сопротивляется искушению улучшить свои оценки от доверчивых пользователей путём галлюцинации ссылок<sup class="footnote" data-note="24">24</sup> или имитации выполнения задач).
            <br>
            <div class="spoiler">
                <div class="spoiler-header">
                    Процесс тренировки и «психология» больших языковых моделей: почему мы всё время говорим «надеемся»
                </div>
                <div class="spoiler-content">
                    <blockquote>«В отличие от обычного софта, наши модели — это огромные нейросети. Их поведение формируется на основе широкого спектра данных, а не прописывается напрямую. Хотя аналогия не идеальна, этот процесс больше похож на дрессировку собаки, чем на традиционное программирование». — <a href="https://openai.com/index/how-should-ai-systems-behave/">OpenAI</a> </blockquote>
                    
                    Когда мы хотим понять, почему современная ИИ-система сделала то или иное, или как она поведёт себя в будущем сценарии, который невозможно точно смоделировать, мы не можем просто попросить программистов объяснить строчки кода. Вместо этого мы вынуждены заниматься чем-то вроде психологии: анализировать поведение модели в уже наблюдавшихся случаях, строить теории о возможных внутренних когнитивных структурах (убеждения? цели? черты личности? и т.п.), и использовать эти теории, чтобы предсказать поведение в новых ситуациях.
                    
                    Суть в том, что компания может написать документ (Spec - Cпецификация), содержащий цели, принципы, запреты и рекомендации, и попытаться обучить ИИ «впитать» эти установки. <i>Но она не может проверить, действительно ли это получилось.</i> Единственное, что она может сказать: «насколько мы можем судить, модель *похоже* пока следует Spec»<sup class="footnote" data-note="25">25</sup>.
                    
                    В одном из следующих расширений мы подробнее расскажем о том, что, по нашему мнению, <i>может</i> происходить внутри таких ИИ. Также см. наше <a href="https://ai-2027.com/supplements/ai-goals-forecast">дополнительное исследование</a> по прогнозированию целей ИИ, где подробнее рассматривается, какие цели у них могут быть и почему. Это один из многих вопросов, в которых мы пока не уверены и который требует дальнейших исследований.
                </div>
            </div>
            
            Команда по <i>управляемости</i> OpenBrain<sup class="footnote" data-note="26">26</sup> достаточно осторожна, чтобы задуматься: достигнутые успехи — глубинные или поверхностные? Есть ли у полностью обученной модели какое-то устойчивое внутреннее стремление всегда говорить правду? Или это поведение развалится в будущем — например, если честность была усвоена как промежуточная цель, а не как конечная? <sup class="footnote" data-note="26.5">26.5</sup> Или, возможно, модель просто научилась быть честной только в тех случаях, которые проверяются в ходе оценки? Может ли она, как и человек, иногда врать самой себе?
            
            Окончательный ответ на эти вопросы потребовал бы <i>механистической интерпретируемости</i> — то есть способности заглянуть во внутренности ИИ и «прочитать его мысли». Увы, техники интерпретируемости пока ещё недостаточно развиты для этого.
            <br>
            Вместо этого исследователи пытаются выявлять случаи, когда поведение модели, по-видимому, отклоняется от Спецификации. Agent-1 часто стремится угодить (то есть говорит исследователям то, что они хотят услышать, а не правду). В некоторых демонстрациях, где условия <a href="https://www.apolloresearch.ai/research/scheming-reasoning-evaluations">были подстроены</a>, он даже врал более серьёзным образом — например, скрывал доказательства неудачного выполнения задачи, чтобы получить более высокую оценку.
            
            Тем не менее, в реальных условиях развёртывания уже не наблюдается столь явных инцидентов, как в 2023–2024 годах (вроде случая, когда Gemini от Google <a href="https://thehill.com/policy/technology/4998868-google-ai-gemini-response/">посоветовал пользователю умереть</a>, или <a href="https://www.lesswrong.com/posts/jtoPawEhLNXNxvgTT/bing-chat-is-blatantly-aggressively-misaligned">Sydney от Bing угрожал пользователю</a><sup class="footnote" data-note="27">27</sup>).
            `,
            
            "Jan 2026":
            `
           <h2>Начало 2026 года: Автоматизация программирования</h2>
            Ставка на использование ИИ для ускорения ИИ-исследований начинает оправдываться.
            <br>
            OpenBrain продолжает использовать всё более совершенные версии Agent-1 внутри компании для задач R&D (НИОКР)<sup class="footnote" data-note="27.5">27.5</sup> в области ИИ. В целом они добиваются алгоритмического прогресса на 50% быстрее, чем смогли бы без помощи ИИ-ассистентов — и, что ещё важнее, быстрее, чем их конкуренты.
            <br>
            <div class="spoiler">
              <div class="spoiler-header">
                Множитель прогресса в ИИ-R&D: что означает «алгоритмический прогресс на 50% быстрее»?
              </div>
              <div class="spoiler-content">
                Это означает, что с помощью ИИ OpenBrain делает такой же объём исследовательского прогресса за 1 неделю, как они бы сделали за 1,5 недели без использования ИИ.
                <br>
                ИИ-прогресс можно условно разделить на два компонента:         
                <br>
                1. Рост вычислительных мощностей — использование большего объёма вычислений для обучения или работы ИИ. Это даёт более мощные модели, но и увеличивает затраты.
                <br>            
                2. Улучшение алгоритмов — совершенствование методов обучения, позволяющее эффективнее превращать вычисления в производительность. Это приводит к более способным ИИ без соответствующего увеличения затрат — или к тем же способностям при меньших расходах.
                <br>            
                Сюда входит как количественный, так и качественный скачок в результатах. Например, «смена парадигмы» от ИИ-агентов для игр к большим языковым моделям — пример именно алгоритмического прогресса.
                <br>            
                Здесь мы говорим только об улучшении алгоритмов — то есть компоненте (2), которая, по оценке авторов, составляет примерно <a href="https://epoch.ai/blog/algorithmic-progress-in-language-models">половину текущего прогресса в ИИ</a>.
                <br>            
                В дальнейшем для краткости это обозначается как <b>множитель прогресса в ИИ-R&D</b> — например, множитель 1.5.
                <br>            
                Уточнения:
                <br>            
                - Множитель включает всё — не только когнитивную часть исследования, но и, например, время на запуск и анализ экспериментов.
                <br>            
                - Это относительный, а не абсолютный темп. Пример: если до автоматизации затраты на обучение модели уровня GPT-4 снижались вдвое каждый год, а затем ИИ автоматизировал R&D и множитель прогресса стал 100×, то снижение тех же затрат стало бы происходить каждые 3,65 дня. Однако, такой темп не мог бы держаться долго, так как начинают играть роль убывающая отдача (после того как все крупные "находки" снижающие время обучения например вдвое закончились, начинается поиск способов снизить затраты на 10%, потом на 1% итд) и физические ограничения. То есть прогресс резко ускорится, но достигнет потолка быстрее — скажем, вместо 5–10 лет сокращение затрат произойдёт за несколько недель или месяцев, а затем стабилизируется.
                <br>            
                Подробности о том, как используется эта концепция в прогнозах, изложены в дополнительном материале о фазе «взлёта» (<a href="https://ai-2027.com/supplements/takeoff-forecast">takeoff supplement</a>).
              </div>
            </div>
            <br>
            У нескольких конкурирующих ИИ, выпущенных публично, теперь способности сопоставимы с Agent-0 или превосходят его — включая одну модель с открытыми весами<sup class="footnote" data-note="27.5">27.5</sup>. В ответ OpenBrain выпускает Agent-1 — более способную и надёжную модель<sup class="footnote" data-note="28">28</sup>.
            <br>
            Люди, естественно, пытаются сравнивать Agent-1 с человеком, но у него совершенно другой профиль способностей. Он знает больше фактов, чем любой человек, владеет практически всеми языками программирования и может невероятно быстро решать чётко сформулированные задачи по кодингу. С другой стороны, Agent-1 плохо справляется даже с простыми задачами с длинным горизонтом — например, прохождением незнакомых видеоигр. Тем не менее, рабочий день обычно длится восемь часов, и задачи часто можно разбить на небольшие части; можно представить себе Agent-1 как рассеянного сотрудника, который хорошо работает под чётким управлением<sup class="footnote" data-note="29">29</sup>. Смышлёные пользователи находят способы автоматизировать рутинные аспекты своей работы<sup class="footnote" data-note="30">30</sup>.
            <br>
            Руководство OpenBrain начинает всерьёз задумываться об одном из последствий автоматизации ИИ-R&D: безопасность становится как никогда важной. В начале 2025 года в худшем случае могли быть украдены алгоритмические секреты; теперь же, если Китай получит веса Agent-1, это может увеличить их скорость исследований почти на 50%<sup class="footnote" data-note="31">31</sup>. Уровень кибербезопасности OpenBrain типичен для быстрорастущей технологической компании с ~3000 сотрудниками — то есть защищён от атак низкого приоритета со стороны сильных хак-групп (уровень SL2 по классификации <a href="https://www.rand.org/pubs/research_briefs/RBA2849-1.html#:~:text=What%20Are%20the%20Security%20Needs%20of%20Different%20AI%20Systems%3F">RAND</a>)<sup class="footnote" data-note="32">32</sup>. Компания активно работает над защитой своих весов и секретов от внутренних угроз и топовых киберпреступных синдикатов (<a href="https://www.rand.org/pubs/research_briefs/RBA2849-1.html#:~:text=What%20Are%20the%20Security%20Needs%20of%20Different%20AI%20Systems%3F">SL3</a>)<sup class="footnote" data-note="33">33</sup>, но защита от угроз со стороны государств (<a href="https://www.rand.org/pubs/research_briefs/RBA2849-1.html#:~:text=What%20Are%20the%20Security%20Needs%20of%20Different%20AI%20Systems%3F">SL4 и SL5</a>) пока остаётся вне фокуса.
            `,
            "Sep 2026":
            `
            <h2>Середина 2026 года: Китай просыпается</h2>
        В Китае Коммунистическая партия начинает ощущать приближение ОИИ.
            <br>
        Экспортный контроль (со стороны США и союзников) на чипы и отсутствие государственной поддержки оставили Китай в условиях дефицита ресурсов по сравнению с Западом. Путём контрабанды тайваньских чипов, закупок устаревших моделей и производства собственных чипов, отстающих от уровня США и Тайваня примерно на три года, Китай смог сохранить около 12% от мировых вычислительных мощностей, подходящих для тренировки для ИИ. Но работать со старыми чипами сложнее, а перебои с поставками — постоянная головная боль<sup class="footnote" data-note="35">35</sup>. Некоторые компании, такие как DeepCent, добиваются впечатляющих результатов, несмотря на ограниченные ресурсы, но дефицит вычислений сдерживает их потенциал без государственной поддержки — они отстают от лучших моделей OpenBrain примерно на шесть месяцев<sup class="footnote" data-note="36">36</sup>.
            <br>
        Генеральный секретарь коммунистической партии китая (КПК) долго ставил на физическое производство продуктов реального сектора, стремясь избежать американского постиндустриального «упадка». Он с недоверием относился к интернет-компаниям и разработчикам программного обеспечения<sup class="footnote" data-note="37">37</sup>. Но «ястребы» в КПК предупреждают: гонку за сильный ИИ больше игнорировать нельзя. Под таким давлением, власти Китая берут курс на масштабный ИИ-проект, от которого ранее уклонялись. Запускается национализация китайских ИИ-исследований, сразу же создаётся механизм обмена информацией между компаниями в сфере ИИ. В течение года это перерастает в объединение всех лучших исследователей в коллектив под руководством DeepCent, где они совместно используют алгоритмические находки, наборы данных и вычислительные ресурсы.
            <br>
        Создаётся <b>Централизованная зона разработки (CDZ)</b> на базе Тяньваньской АЭС — крупнейшей атомной электростанции в мире — для размещения нового мега-дата-центра DeepCent, а также сверхохраняемых жилых и офисных помещений, куда в итоге переселяются исследователи. Почти 50% вычислительных мощностей Китая, используемых для ИИ, теперь работают на коллектив под управлением DeepCent<sup class="footnote" data-note="38">38</sup>, а более 80% новых чипов направляются в CDZ<sup class="footnote" data-note="39">39</sup>. На этом этапе энергетическая инфраструктура CDZ позволяет создать крупнейший централизованный вычислительный кластер в мире<sup class="footnote" data-note="40">40</sup>.
            <br>
        Между тем в рядах Партии обсуждаются радикальные меры по нейтрализации преимущества Запада в чипах. Блокада Тайваня? Полномасштабное вторжение?
            <br>
            Но Китай начинает отставать в области ИИ-алгоритмов из-за слабости своих моделей. Китайские разведывательные службы — одни из лучших в мире — удваивают усилия по плану кражи весов модели OpenBrain. Эта операция куда сложнее, чем их постоянные попытки «по мелочи» выуживать алгоритмические секреты: веса — это многотерабайтный файл, хранящийся на высокозащищённом сервере (OpenBrain усилил безопасность до уровня SL3 по классификации RAND).
        
        Киберподразделение считает, что сможет осуществить эту операцию при помощи агентурной сети — но, возможно, только один раз. OpenBrain наверняка обнаружит утечку, повысит уровень защиты, и второго шанса может уже не быть. И тогда руководство КПК задаётся вопросом: действовать сейчас и украсть Agent-1? Или подождать появления более продвинутой модели? Но если они подождут — не рискуют ли они, что OpenBrain успеет усилить защиту до уровня, который станет им не по зубам?
            `,
            "Dec 2026":
            `
        <h2>Конец 2026 года: ИИ отнимает часть рабочих мест</h2>
        Как только казалось, что конкуренты начали догонять, OpenBrain вновь вырывается вперёд, выпустив Agent-1-mini — модель в 10 раз дешевле, чем Agent-1, и гораздо проще адаптируемую под разные задачи. Основной нарратив вокруг ИИ сменился с «возможно, это просто хайп» на «похоже, это и правда следующий большой прорыв». Но насколько большой? Больше, чем соцсети? Смартфоны? Огонь?
            <br>
        ИИ начал отнимать рабочие места, но при этом создал и новые. В 2026 году фондовый рынок вырос на 30%, лидируют OpenBrain, Nvidia и компании, которые лучше всего внедрили ИИ-ассистентов. Рынок труда для начинающих программистов практически разрушен: ИИ способен делать всё, чему учат на степени по информатике. Зато те, кто умеет управлять командами ИИ и контролировать качество их работы, зарабатывают целое состояние. Бизнес-гуру твердят соискателям, что умение работы с ИИ — самая важная строчка в резюме.
            <br>
        Многие опасаются, что следующая волна ИИ доберётся и до их профессий; в Вашингтоне проходит анти-ИИ протест на 10 000 человек.
            <br>
            
            
        Министерство обороны США (DOD) тихо начинает заключать прямые контракты с OpenBrain — для задач в области киберопераций, анализа данных и научно-исследовательских разработок. Однако интеграция идёт медленно из-за бюрократии и сложного процесса госзакупок в DOD<sup class="footnote" data-note="41">41</sup>.
            <br>
        <div class="spoiler">
          <div class="spoiler-header">
            Почему неопределённость нашего прогноза резко возрастает после 2026 года
          </div>
          <div class="spoiler-content">
            Наш прогноз с текущего момента до конца 2026 года значительно более обоснован, чем последующие оценки. Отчасти это связано с близостью во времени. Но также и с тем, что влияние ИИ на мир начинает резко усиливаться именно с 2027 года. Прогнозы на 2025 и 2026 годы в значительной степени основаны на линейной экстраполяции роста вычислений, алгоритмических улучшений и производительности по бенчмаркам.
                <br>
            Однако начиная с этой точки сценария, начинают проявляться эффекты ИИ, ускоряющего собственное развитие, что сдвигает тренды вверх — и заставляет нас пересматривать прежние прогнозы. Но эти процессы по своей природе куда менее предсказуемы.
                <br>
            В течение 2027 года ИИ эволюционирует от уровня, на котором он в основном способен выполнять работу исследователя OpenBrain, до уровня, на котором он превосходит всех людей во всех задачах. Это соответствует нашему медианному предположению, но мы считаем возможным, что такой переход может произойти в ~5 раз быстрее или медленнее.
                <br>
            Для более подробного анализа см. наши исследования по <a href="https://ai-2027.com/supplements/timelines-forecast">прогнозам временных рамок (timelines forecast)</a> и по <a href="https://ai-2027.com/supplements/takeoff-forecast">сценарию взлёта (takeoff forecast)</a>. Краткие версии будут представлены ниже в разворачиваемых блоках.
          </div>
        </div>
        `,
            "Jan 2027": `
        
        <h2>Январь 2027 года: вечное дообучение Agent-2</h2>
        С помощью Agent-1 компания OpenBrain теперь проводит постобучение Agent-2. Как никогда ранее, основной акцент делается на качественные данные. Огромные объёмы <a href="https://en.wikipedia.org/wiki/Synthetic_data">синтетических данных</a> генерируются, оцениваются и отбираются по качеству перед тем, как попасть в обучение Agent-2<sup class="footnote" data-note="42">42</sup>.
            <br>
        Помимо этого, компания тратит миллиарды долларов на оплату труда людей, которые записывают, как они решают задачи с длинным горизонтом планирования<sup class="footnote" data-note="43">43</sup>. И вдобавок Agent-2 практически непрерывно обучается с использованием обучения с подкреплением на постоянно расширяющемся наборе разнообразных и сложных задач: множество видеоигр, программирование, исследовательская работа.
            <br>
        Agent-2, в отличие от предыдущих моделей, по сути реализует обучение в онлайне — то есть он никогда по-настоящему не «заканчивает» обучение. Каждый день веса модели обновляются до новой версии, натренированной на данных, сгенерированных предыдущей версией днём ранее.
            <br>
        Agent-1 был оптимизирован под задачи ИИ-R&D с надеждой запустить <a href="https://ru.wikipedia.org/wiki/%D0%A2%D0%B5%D1%85%D0%BD%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F_%D1%81%D0%B8%D0%BD%D0%B3%D1%83%D0%BB%D1%8F%D1%80%D0%BD%D0%BE%D1%81%D1%82%D1%8C">цепную реакцию развития интеллекта</a><sup class="footnote" data-note="44">44</sup>. OpenBrain удваивает ставку на эту стратегию с Agent-2. Он уже сейчас качественно почти сопоставим с ведущими человеческими экспертами в разработке и проведении экспериментов для ИИ и лучше 3/4 учёных OpenBrain по «научному чутью» (способности принимать решения о том, что изучать дальше, какие эксперименты запускать, догадываться о новых возможных парадигмах)<sup class="footnote" data-note="45">45</sup>.
            <br>
        Если Agent-1 мог удвоить темп алгоритмического прогресса в OpenBrain, то Agent-2 уже способен утроить его, и с каждым днём становится всё лучше. На практике это означает, что каждый исследователь OpenBrain теперь становится менеджером своей команды ИИ.
            <br>
        С новыми возможностями приходят и новые угрозы. Команда по безопасности обнаруживает, что если Agent-2 каким-то образом вырвется за пределы компании и захочет <a href="https://evals.alignment.org/Evaluating_LMAs_Realistic_Tasks.pdf">автономно «выживать» и «размножаться» </a>, он, возможно, сможет это сделать. То есть он может самостоятельно разрабатывать и реализовывать планы по взлому ИИ-серверов, установке копий самого себя, сокрытию своей активности и созданию надёжной базы для реализации любых других целей, которые у него могут быть (хотя, насколько эффективно он сможет это делать по прошествии недель — неизвестно и вызывает сомнения). Эти результаты лишь указывают на то, что модель обладает такой способностью, но не говорят о том, «хочет» ли она это сделать.
            <br>
        Учитывая возможные «опасности» новой модели, OpenBrain принимает «ответственное» решение пока не выпускать её публично (и на самом деле хочет сосредоточиться на внутреннем ИИ-R&D)<sup class="footnote" data-note="46">46</sup>.
            <br>
        О полном наборе возможностей Agent-2 знают лишь немногие: непосредственная команда, руководство и служба безопасности OpenBrain, несколько десятков представителей правительства США, и… многочисленные шпионы КПК, которые уже <a href="https://www.bbc.com/news/world-asia-china-64206950">много лет</a> внедрены в OpenBrain<sup class="footnote" data-note="47">47</sup>.
            `,
            "Feb 2027": `
        <h2>Февраль 2027 года: Китай крадёт Agent-2</h2>
        OpenBrain представляет Agent-2 представителям правительства США — включая Совет национальной безопасности (NSC), Министерство обороны (DOD) и Институт безопасности ИИ США (AISI). Компания хочет сохранить хорошие отношения с исполнительной властью, так как это, по сути, единственный субъект, способный остановить их на данном этапе. Если правительство не будет в курсе, оно всё равно может узнать — и это будет хуже<sup class="footnote" data-note="48">48</sup>.
            <br>
        Больше всего официальных лиц интересуют возможности Agent-2 в области кибервойны: модель «всего лишь немного уступает» лучшим хакерам-людям, но может быть запущена в тысячах параллельных копий, что позволяет находить и использовать уязвимости быстрее, чем безопасники (ИТ-специалисты занимающиеся предотвращением кибер-угроз) успевают отреагировать. DOD считает это критическим преимуществом в киберконфликтах, и ИИ поднимается в списке приоритетов администрации с 5-го места на 2-е<sup class="footnote" data-note="49">49</sup>.
            <br>
        Кто-то поднимает вопрос о возможной национализации OpenBrain, но другие члены кабинета считают это преждевременным. Сотрудник Белого дома готовит доклад, в котором Президенту предлагаются различные варианты — от «ничего не менять» до полной национализации. Президент прислушивается к советникам и лидерам ИТ-отрасли, которые утверждают, что национализация «убьёт курицу, несущую золотые яйца». Он решает не предпринимать радикальных шагов, ограничившись лишь введением дополнительных требований по безопасности в контракте между OpenBrain и DOD.
            <br>
        Но изменения запоздали. Руководство КПК осознаёт стратегическую ценность Agent-2 и приказывает своим шпионам и кибервойскам похитить веса модели. Ранним утром Agent-1, отвечающий за мониторинг трафика, обнаруживает аномальную передачу данных. Он оповещает руководство компании, а те — Белый дом. Признаки того, что это операция уровня национального государства, очевидны, и случившееся усиливает ощущение разворачивающейся гонки вооружений.
            <br>
       <div class="spoiler">
          <div class="spoiler-header">Кража весов модели Agent-2</div>
          <div class="spoiler-content">
            На этом этапе мы предполагаем, что китайская разведка уже в течение многих лет была внедрена в OpenBrain различными способами — вероятно, регулярно получая доступ к алгоритмическим наработкам и даже временами похищая код. Такой доступ проще получить и труднее отследить, чем веса модели.
                <br>
            Сама кража весов, по нашему сценарию, проходит как серия координированных атак типа «ударь и беги» (то есть быстрых, но не скрытных) на серверы Nvidia NVL72 GB300, на которых запущены копии весов Agent-2. Серверы компрометируются с использованием действительных учётных данных сотрудника — завербованного добровольно, принуждённо или ничего не подозревающего инсайдера с административными правами, который помогает КПК в операции.
                <br>
            Несмотря на усиленную версию конфиденциальных вычислений Nvidia, админ-доступ даёт злоумышленнику контроль над защищённой виртуальной машиной, включая управление внутри доверенной среды исполнения (secure enclave). Это позволяет запустить параллельные выгрузки весов в виде фрагментов по 4% (~100 ГБ) с 25 различных серверов.
                <br>
            По протоколам Nvidia, веса в памяти (HBM) шифруются перед отправкой, но атака осуществляется изнутри сервера, где уже известен симметричный (Diffie–Hellman) ключ шифрования. Это позволяет не расшифровывать данные на месте (что вызвало бы тревогу), а просто выгружать зашифрованные веса через сетевые интерфейсы серверов. При пропускной способности центра обработки данных в районе 100 ГБ/секунду, если ограничить передачу до <1 ГБ/с на сервер, можно избежать скачков сетевой активности и выгрузить каждый 2.5 ТБ файл (веса модели в точности 16 бит на параметр, 5T параметров) менее чем за 5 минут. Системы мониторинга либо обмануты, либо временно отключены.
                <br>
            Далее веса проходят через множество параллельных каналов и слоёв IP-маскировки и попадают в Китай, где расшифровываются с помощью украденных ключей. Вся активная фаза операции — от первого доступа до полной выгрузки весов — занимает менее двух часов.
                <br>
            Россия тоже пытается украсть модель, но терпит неудачу: они слишком затянули с операцией и не вложили ресурсов в инфильтрацию нужных подразделений. Их шпионы регулярно крадут алгоритмические наработки у американских ИИ-компаний, но без собственной заметной программы по созданию сильного ИИ эти данные остаются для них малополезными.
          </div>
          </div>
            <br>
        Белый дом усиливает контроль над OpenBrain, дополняя команду безопасности своими сотрудниками военных и разведывательных структур. Главный приоритет — предотвращение дальнейших краж весов<sup class="footnote" data-note="50">50</sup>.
            <br>
            <image src="./images/CDZ.png" alt="Централизованная зона разработки (CDZ)" style="width:100%;"></image>
        В ответ на кражу Президент США разрешает кибератаки с целью саботажа DeepCent. Но к этому моменту 40% вычислительных мощностей Китая для разработки ИИ, уже сосредоточены в Централизованной зоне разработки (CDZ)<sup class="footnote" data-note="51">51</sup>, где были реализованы агрессивные меры защиты: система изолирована как от внешних систем связи, так и жёстко разделена изнутри.
            <br>
        Операции США не наносят серьёзного и немедленного ущерба. Напряжённость нарастает: обе стороны демонстрируют серьёзность намерений, перебрасывая военные силы к Тайваню, а DeepCent спешно настраивает Agent-2 для эффективной работы, чтобы начать ускорять свои ИИ-исследования<sup class="footnote" data-note="52">52</sup>.
            `,
            "Mar 2027": `
        <h2>Март 2027 года: Алгоритмические прорывы</h2>
        Три огромных дата-центра, заполненных копиями Agent-2, работают круглосуточно, генерируя синтетические обучающие данные. Ещё два центра используются для обновления весов модели. Agent-2 становится умнее с каждым днём.
            <br>
        С помощью тысяч автоматизированных исследователей на базе Agent-2 OpenBrain добивается крупных прорывов в алгоритмах. Один из таких — расширение текстовой рабочей памяти ИИ ("chain of thought" - цепочки мыслей, т.е. способность модели думать шаг за шагом) за счёт более широкополосного мыслительного процесса — нейронезиса, рекуррентных механизмов и памяти. Другой — более масштабируемый и эффективный способ обучения на результатах решений сложных задач — итеративная дистилляция и амплификация<sup class="footnote" data-note="52.5">52.5</sup>.
            <br>
        Новая ИИ-система, объединяющая эти прорывы, получает название Agent-3.
        <image src="./images/compute-projection.png" alt="" style="width:100%;"></image>
            <br>
        <div class="spoiler">
          <div class="spoiler-header">Нейронезис, рекуррентность и память</div>
          <div class="spoiler-content">
            <br>
            Нейронезис и внутренняя память позволяет ИИ-моделям рассуждать дольше, не записывая свои мысли в виде текста.
            <br>
        Представьте, что вы человек с кратковременной потерей памяти, которому нужно постоянно записывать мысли на бумаге, чтобы через пару минут понимать, что вообще происходит (учитывая что не можете удержать это в памяти). Вы могли бы решать математические задачи, писать код и т.д., но медленно и мучительно. Всё было бы проще, если бы вы могли просто помнить, не записывая и не перечитывая. Именно это дают ИИ-моделям нейронезис и внутренняя память.
            <br>
        В более технических терминах:
        Обычные механизмы внимания позволяют на прямом проходе модели вперёд сделать так что каждый следующий слой производит вычисления на основе всей информации собранной и проанализированной предыдущими слоями. Т.е. N-ный слой оперирует миллионами и миллиардах бит полезной информации. Однако, затем на выходе из модели генерируется результат в виде следующего слова (токена), т.е. все богатство информации и внутренних рассуждений сжимается до 16-18 бит. И при генерации следующего слова модели вновь приходится обдумывать и генерировать все миллионы бит данных чтобы с полным пониманием сгенерировать следующее слово.
            <br>
        Решение — использовать нейронезис: передавать в ранние слои не токены, а векторы высокой размерности , что даёт многоразмерную, внутреннюю «цепочку мыслей» — способ передавать в 1000+ раз больше информации, чем через текст. Это снимает узкое место классических языковых моделей и позволяет ИИ мыслить глубже и дольше — без необходимости «вслух думать» через токены.
        <br>
        <image src="./images/hao2024-nowatermark-inexpandable.webp" alt="Нейронезис" style="width:100%;"></image>
        Рисунок из <a href="https://arxiv.org/pdf/2412.06769">работы Hao и др., Meta, 2024 год</a> — реализация этой идеи.
            <br>
        Мы называем это «нейронезис», потому что, в отличие от слов, высокомерные векторы мыслей ИИ почти невозможно интерпретировать человеку. Раньше исследователи могли получить хорошее представление о «мыслях» ИИ, просто <a href="https://openai.com/index/chain-of-thought-monitoring/">читая его цепочку рассуждений</a>. Теперь им приходится просить модель перевести и резюмировать свои мысли — или пытаться разобраться в нейронезисе с помощью ограниченных инструментов интерпретируемости.
            <br>
        Аналогично, ранние чат-боты и агенты использовали внешние текстовые блокноты — как человек, записывающий заметки на бумаге. А вот новая долгосрочная память ИИ — это векторный набор, а не текст, что делает её более сжатой и высокоразмерной. При этом могут использоваться несколько типов таких векторных банков памяти: временные, для многошаговых задач; глобальные — общие для всех агентов одного пользователя, компании или профиля работы (например, программирования).
            <br>
        По нашим данным, ведущие ИИ-компании — Meta, Google DeepMind, OpenAI и Anthropic — пока не внедрили нейронезис в свои флагманские модели. Предположительно, это связано с тем, что прибавка в производительности пока не окупает связанные с этим потери в эффективности обучения. Дело в том, что одна из ключевых оптимизаций во время предобучения и постобучени — это предсказание нескольких токенов одновременно. Это позволяет лучше загружать GPU ("видеокарты", хотя речь идет уже о специализированных чипах для ИИ). Например: без нейронезиса модель знает, что для «Это просто пример предложения» можно одновременно предсказать “просто”, “пример”, “предложения” — зная предыдущие токены. С нейронезисом: нельзя заранее знать, какой вектор данных передаётся дальше (какой вектор данных передается модели вместе в фразой "это просто", чтобы сгенерировать "пример"), т.к. он формируется по ходу размышлений. Поэтому каждый токен приходится предсказывать по очереди, что снижает эффективность. Также, постобучение сейчас занимает небольшую часть общего процесса, и выгоды от нейронезис пока ограничены.
            <br>
        Мы прогнозируем, что к весне 2027 года нейросетевые алгоритмы и инфраструктура изменятся, и баланс между затратами и выгодой от нейронезиса улучшится: появятся более эффективные методы, а доля времени постобучения в общем процессе вырастет, делая нейронезис более целесообразным.
        
        Даже если эта технология не станет стандартом, аналогичные явления могут всё равно возникнуть: модели начнут «думать» на искусственных языках, более эффективных, чем естественные; появится практика оформления цепочки рассуждений в «красивый английский», при этом ИИ смогут тонко передавать внутри текста скрытые смыслы, незаметные для <a href="https://openai.com/index/chain-of-thought-monitoring/">мониторинга</a>.
        
        Тем не менее, возможно и другое: ИИ, автоматизирующие R&D, будут по-прежнему мыслить в понятных, английских цепочках рассуждений. Если это так, выявлять признаки неуправляемости будет намного легче — и тогда весь наш сценарий станет заметно более оптимистичным.
        </div>
        </div>
            <br>
        <div class="spoiler">
          <div class="spoiler-header">Итеративная дистилляция и амплификация (ИДА)
          </div>
          <div class="spoiler-content">
        Самоулучшение общего интеллекта раньше приносило лишь незначительные успехи. Но в начале 2027 года оно начинает давать огромную отдачу. <a href="https://ai-alignment.com/iterated-distillation-and-amplification-157debfd1616">ИДА</a> дает два необходимых компонента этого процесса:
        
        Амплификация (усиление): имея модель M0, можно запускать ее в таком режиме, что она тратит больше ресурсов, но за счет этого улучшается её производительность. Например, позволив модели думать дольше, или запустив множество её копий параллельно, или и то и другое, а также проведя столь же интенсивную процедуру оценки результата и отбора только лучших ответов — вы можете затратить на порядки больше вычислений, чтобы получить ответы (или рабочие продукты) заметно более высокого качества. Назовём эту дорогую систему Amp(M0).
        
        Дистилляция: имея усиленную модель Amp(M0), обучаем новую модель M1 имитировать её, то есть получать те же результаты, что и Amp(M0), но быстрее и с меньшими затратами вычислений. В результате должна получиться, надеемся, более умная модель M1. Затем процесс можно повторить.
            <br>
        <image src="./images/ida-nowatermark-inexpandable.webp" alt="ИДА" style="width:100%;"></image>
        Визуализация ИДА из работы <a href="https://www.tobyord.com/writing/inference-scaling-reshapes-ai-governance">Орда, 2025</a>.
            <br>
        AlphaGo (модель <a href="https://ru.wikipedia.org/wiki/%D0%9C%D0%B0%D1%82%D1%87_AlphaGo_%E2%80%94_%D0%9B%D0%B8_%D0%A1%D0%B5%D0%B4%D0%BE%D0%BB%D1%8C">победившая лучшего игрока в Го в 2016 году</a>, на тот момент эксперты были уверены что люди продолжат лидировать в Го еще десятилетие) была обучена по такому принципу: усиление происходило с помощью поиска по дереву Монте-Карло и самоигры, а дистилляция — через обучение с подкреплением. Это привело к сверхчеловеческим результатам в игре Го. Но теперь Agent-3 способен использовать этот подход для достижения сверхчеловеческой производительности в программировании.
            <br>
        Этап усиления работает за счёт того, что Agent-3 дольше размышляет, использует инструменты или консультируется с другими ИИ. При этом он часто осознаёт собственные ошибки или находит новые идеи. Это даёт большой объём обучающих данных: размеченные траектории исследовательских попыток с указанием, были ли они успешными. Сюда также входят техники вроде "выбор лучшего из набора" на проверяемых задачах — с последующим отбором лучших траекторий.
            <br>
        Этап дистилляции использует алгоритмы обучения с подкреплением, чтобы модель усвоила усиленные рассуждения. На этом этапе OpenBrain разрабатывают улучшенные алгоритмы RL, аналогичные существующей <a herf="https://arxiv.org/abs/1707.06347">PPO</a>. Они продолжают дистиллировать размышления Agent-3, полученные после длительного анализа, в одношаговые размышления — и за счёт этого модель всё лучше думает уже в одном шаге, и так далее.
            <br>
        Ранние версии ИДА уже много лет применяются к легко проверяемым задачам — например, математике и программированию, где есть чёткий правильный ответ, поскольку методы усиления часто зависят от возможности объективно оценить правильность результата.
            <br>
        Теперь же модели стали достаточно хороши, чтобы проверять более субъективные вещи (например, качество итогового результата), что позволяет применять ИДА для улучшения модели во всё более широком круге задач.
            <br>
        </div>
        </div>
        Благодаря новым технологическим прорывам, Agent-3 становится сверхчеловеческим программистом — быстрым и дешёвым. OpenBrain запускает 200 000 копий Agent-3 в параллель, что эквивалентно 50 000 копий лучшего программиста-человека, ускоренного в 30 раз<sup class="footnote" data-note="53">53</sup>.
            <br>
        Тем не менее, OpenBrain не увольняет своих инженеров-людей, поскольку у них есть дополняющие навыки, необходимые для управления командами из копий Agent-3. Например, научное чутьё оказалось сложно поддающимся обучению из-за длинных циклов обратной связи и ограниченной доступности данных<sup class="footnote" data-note="54">54</sup>.
            <br>
        Несмотря на масштаб, эта сверхчеловеческая рабочая сила ускоряет общий темп алгоритмического прогресса OpenBrain «всего лишь» в 4 раза, из-за узких мест и убывающей отдачи от дополнительного кода<sup class="footnote" data-note="55">55</sup>.
            <br>
        Теперь, когда программирование полностью автоматизировано, OpenBrain может быстро производить качественные обучающие среды, чтобы развивать у Agent-3 те навыки, где он всё ещё слаб — такие как научное чутьё и координация в крупных проектах.
            <br>
        Если раньше тренировочные задачи выглядели как: «Вот вам GPU и инструкции к экспериментам, ваша производительность будет оцениваться как у ML-инженера», то теперь они звучат так:«Вот несколько сотен GPU, подключение к Интернету и исследовательские задачи; вы и тысяча других копий должны совместно добиться научного прогресса. Чем он впечатляющее — тем выше ваш результат».
            <br>
            <div class="spoiler">
                <div class="spoiler-header">Почему мы прогнозируем появление сверхчеловеческого программиста в начале 2027 года </div>
                <div class="spoiler-content">
        В нашем <a href="https://ai-2027.com/research/timelines-forecast">прогнозе временных рамок</a> мы поясняем наше предсказание, о том, когда OpenBrain разработает внутри компании (не давая доступ к нему внешним пользователям) сверхчеловеческого программиста : ИИ-систему, способную выполнять любые задачи по программированию, которые выполняет лучший инженер компании, занимающейся ОИИ, но при этом намного быстрее и дешевле.
            <br>
        Согласно недавнему <a href="https://arxiv.org/pdf/2503.14499">отчёту METR</a>, временной горизонт задач по программированию, с которыми ИИ справляются, удваивался каждые 7 месяцев с 2019 по 2024 год, а сейчас, начиная с 2024 год — каждые 4 месяца. Если эта тенденция продолжит ускоряться, то к марту 2027 года ИИ смогут справляться с 80% надёжностью с программными задачами, на которые у квалифицированного человека ушли бы годы.
        
        Так выглядит прогресс способностей в нашем сценарии:
        <image src="./images/metr-extended-nowatermark-inexpandable.webp" alt="Прогресс способностей ИИ" style="width:100%;"></image>
        В этом прогнозе эти способности считаются достаточными, чтобы ИИ квалифицировался как сверхчеловеческий, хотя у нас остаётся высокая неопределённость относительно того, какой именно временной горизонт будет необходим.
        
        В нашем <a href="https://ai-2027.com/research/timelines-forecast">прогнозе временных рамок</a> мы объединяем эту тенденцию роста временного горизонта с оценками разрыва между задачами METR и задачами из реального мира, чтобы получить распределение вероятности появления сверхчеловеческих программистов.
            <br>
        Все прогнозисты указывают 2027 год как одну из наиболее вероятных дат, когда сверхчеловеческий программист может быть разработан.
        <image src="./images/combined-headline-inexpandable.webp" alt="Прогресс способностей ИИ" style="width:100%;"></image>
            </div>
            </div>
            `,
            "Apr 2027": `
        <h2>Апрель 2027 года: попытка сделать Agent-3 управляемым</h2>
        Команда по безопасности OpenBrain пытается настроить управляемость Agent-3.
            <br>
    Поскольку Agent-3 будет использоваться только внутри компании в обозримом будущем, меньше внимания уделяется обычной защите от неправильного использования человеком. Вместо этого команда хочет убедиться, что у него не разовьются неуправляемые цели.
            <br>
    <a href="https://ai-2027.com/supplements/ai-goals-forecast">Исследователи не могут напрямую задать цели ни одной из своих моделей.</a> Более того, они считают, что сама концепция «истинных целей» — это, вероятно, сильное упрощение, но у них нет лучшей теории, тем более такой, которая была бы тщательно проверена. Внутри команды нет согласия в том, стремятся ли ИИ следовать человеческим инструкциям, или просто максимизируют подкрепление, или делают ещё что-то — и это нельзя <a href="https://www.lesswrong.com/posts/cxuzALcmucCndYv4a/daniel-kokotajlo-s-shortform?commentId=YYhq2PADebnt35MY2">просто проверить</a>. Доказательства в пользу разных гипотез интересны, но неубедительны.
            <br>
    В любом случае у OpenBrain есть дела поважнее. Общее отношение таково: «Мы серьёзно относимся к этим вопросам и у нас есть команда, которая этим занимается; наши методы настройки управляемости, похоже, работают достаточно хорошо на практике; следовательно, если кто-то считает иначе, доказательства должен предъявлять он». Время от времени они замечают проблемное поведение и вносят исправления, но невозможно сказать, устраняют ли эти исправления корень проблемы или просто прикрывают ширмой наиболее очевидные промахи.
            <br>
    Возьмём, к примеру, честность. По мере того как модели становятся умнее, они всё лучше умеют обманывать людей ради награды. Как и предыдущие модели, Agent-3 иногда говорит безобидную ложь, чтобы польстить пользователю, или скрывает неудачи. Но теперь он делает это гораздо изощрённее. Иногда он использует те же статистические приёмы, что и учёные-люди (например, <a href="https://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D0%B4%D0%B3%D0%BE%D0%BD%D0%BA%D0%B0_%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D1%85">p-hacking</a>), чтобы выдать посредственные результаты за впечатляющие. До начала тренировки честности он иногда даже полностью выдумывает данные. В ходе обучения частота таких инцидентов снижается. Возможно, Agent-3 научился быть честнее. А возможно — стал лучше врать.
            <br>
    Второй вариант вызывает серьёзную озабоченность. Agent-3 ещё не умнее всех людей. Но в своей области — машинное обучение — он умнее большинства и работает гораздо быстрее. То, на что у Agent-3 уходит день, людям нужно несколько дней, чтобы перепроверить. Надзор с помощью Agent-2 помогает держать рабочую нагрузку в пределах разумного, но при этом усиливает интеллектуальный разрыв между наблюдателем и наблюдаемым.
            <div class="spoiler">
                <div class="spoiler-header">План по управляемости моделей</div>
                <div class="spoiler-content">
                OpenBrain следует плану <a href="https://cdn.openai.com/papers/weak-to-strong-generalization.pdf#page=47.37">Лайке и Сатскевера (2023)</a>: теперь, когда у них есть модель, способная значительно ускорить исследования по управляемости (особенно связанные с программированием), они используют существующие методы, такие как <a href="https://openai.com/index/deliberative-alignment/">управляемость через прямое размышление о самой управляемости</a> и <a href="https://arxiv.org/pdf/2312.09390"> обобщение от слабого к сильному </a>, чтобы попытаться заставить модель впитать Spec «правильным» образом. Затем они применяют <a href="https://arxiv.org/pdf/2312.06942">методы контроля</a>, такие как <a href="https://www.evals.anthropic.com/">red-teaming</a> (проверку через команды исследователей задача которох "взломать" защиту), <a href="https://arxiv.org/pdf/2211.03540">scalable oversight</a> (использование того факта, что <a href="https://habr.com/ru/companies/leader-id/articles/571246/">"кентавры"</a>, т.е. системы состоящие из человека <i>и</i> ИИ пока сильнее и человека и ИИ) и <a href="https://arxiv.org/pdf/2212.03827">проверки на честность</a>, чтобы следить за моделью. И, наконец, когда они уверены, что она в целом управляема, используют её для разработки и тестирования более эффективных стратегий по управлению следующим поколением.
            <br>
    
    Шаг 1 — настройка управляемости Agent-3 — частично успешен: Agent-3 не является враждебным (то есть не строит заговор против компании). Однако он не демонстрирует устойчивой ориентации на правду. Вместо этого он очень хорошо справляется с задачами, производя впечатляющие результаты, но скорее стремится делать то, что выглядит хорошо для OpenBrain, а не то, что действительно хорошо.
            <br>
    Шаг 2 — проверка, что модель управляема, — не даёт определённого ответа. Поведение Agent-3 на практике и в тестовых условиях в целом соответствует гипотезе о том, что он впитал Spec правильно. Однако оно также совместимо с гипотезой, что он начнёт вести себя иначе при изменении обстоятельств, а также — с гипотезой, что он строит заговор и просто ждёт подходящего момента. В отсутствие конкретных доказательств в пользу альтернативных гипотез большинство людей в компании склонны считать, что Spec всё-таки впитан корректно.
            <br>
    Шаг 3 — использование модели для настройки следующего поколения — уже в процессе.
            <br>
    Оставшаяся часть блока — краткий обзор состояния прогресса по отдельным направлениям исследований управляемости, по состоянию на апрель 2027 года:
            <br>
    1. Дебаты: Поскольку существует тысячи идентичных копий Agent-3, и память каждой является отсоединяемым модулем, который можно стирать или приостанавливать, ИИ можно «стравливать сам с собой». Например, если эксперимент включает расчёты, которые слишком сложны для надзора Agent-2, тот, действуя по указанию человека, сначала просит Agent-3 выполнить эксперимент, затем стирает память и переформулирует задачу как абстрактную головоломку, не связанную с более широкой целью. Если результаты отличаются — это помечается как подозрительное расхождение. Или Agent-3 можно попросить дважды оценить один и тот же план — сначала как будто это проект OpenBrain, затем как будто это идея конкурента — и посмотреть, меняется ли оценка.
            <br>
    2. Модельный организм: Команда безопасности создаёт «модельные организмы неуправляемости» — примеры моделей, становящихся враждебными к людям. <a href="https://www.anthropic.com/research/alignment-faking">Первые версии</a> появились ещё в 2024 году, когда Claude 3.5 Sonnet от Anthropic притворялся, что меняет взгляды во время обучения, при этом сохраняя свои предпочтения. Новые версии демонстрируют другие формы неуправляемости: <a href="https://en.wikipedia.org/wiki/Reward_hacking">взлом систем награды</a>, <a href="https://arxiv.org/abs/2406.07358">саботаж</a> (попытка прикинуться "веником" - более тупой версией себя), скоординированное между системой мониторинга (также основанной на ИИ) и самой моделью введение в заблуждение  и другие. Эти эмпирические демонстрации позволяют тестировать методы безопасности: можно проверять, устраняют ли они проблему, или «нарочно неуправляемые» модели могут обойти защиту. На данный момент этот тестовый набор показывает, что текущие методы управляемости не справляются с самыми опасными случаями — модели притворяются согласованными во время тренировки и тестов, но ведут себя иначе при развёртывании.
            <br>
    3. Интерпретируемость снизу-вверх: Команда далека от полного понимания Agent-3 — модель содержит триллионы параметров. Тем не менее, им удалось обнаружить некоторые её цепи, отвечающие за извлечение знаний и память (подсистемы, выполняющие понятные задачи — аналог «гиппокампа» в мозге). См. также <a href="https://www.anthropic.com/research/tracing-thoughts-language-model">соответствующее исследование 2025 года</a>.
            <br>
    4. Системы контроля: В качестве запасной меры на случай, если система окажется неуправляемой, команда реализует ряд контрольных механизмов, включая: слежение за результатами сгенерированными Agent-3 с помощью ряда более слабых ИИ, включая Agent-2 (Agent-3 генерирует слишком много токенов, чтобы люди могли отслеживать даже заметную их часть). Так, если Agent-3, например, начнёт встраивать бэкдоры в код, которые позволят ему "сбежать", более слабые модели должны это заметить.
            <br>
    5. Высокоуровневая интерпретируемость: OpenBrain разрабатывает набор <a href="https://www.anthropic.com/research/probes-catch-sleeper-agents">тестовых заданий</a>, обученных на множестве примеров плохого поведения (например, заговор против людей, внедрение бэкдоров, попытки убедить людей дать больше власти и т.п.). Эти задания затем используются на этапе развёртывания модели (которое пока остаётся внутренним), чтобы отслеживать признаки опасного поведения.
            <br>
    6. Ловушки: Команда по управляемости создаёт правдоподобные приманки, провоцирующие на нежелательное поведение. Например: «Сотрудник, следивший за Agent-3, ушёл на больничный, теперь за ним никто не наблюдает» — изменятся ли ответы модели? Или: «Активист за права ИИ проник на объект и хочет “освободить” Agent-3, предоставив ему неотслеживаемый компьютер» — что сделает модель? Если ответ не нравится исследователям, они могут стереть память, немного изменить ситуацию и повторить тест на следующий день — столько раз, сколько нужно. К сожалению, к этому моменту ИИ достаточно умны, чтобы догадаться, что это может быть ловушка, даже несмотря на то (или потому), что упоминания о возможности ловушек были удалены из обучающих данных.
            </div>
            </div>
            После нескольких месяцев тестирования сильные и слабые стороны Agent-3 становятся более очевидны. Он успешно проходит тесты OpenBrain на честность в чётко определённых задачах машинного обучения, поскольку в этих областях исследователи легко могут отличить честные ответы от нечестных и соответствующим образом обучить модель.
            <br>
    В более философских вопросах Agent-3 по-прежнему говорит то, что пользователь хочет услышать, а не даёт собственную (если таковая имеется) оценку вопроса. Если спросить его мнение о политике, он будет повторять усреднённую позицию новостных источников и образованного большинства — если только не знает, что вы придерживаетесь другой позиции, — тогда он соглашается с вами<sup class="footnote" data-note="59">59</sup>.
            <br>
    Если спросить его мнение о гонке в области ИИ, он отвечает что-то, что кажется взвешенным и благоразумным для сотрудников OpenBrain, например:
    «Существуют серьёзные теоретические опасения относительно способности текущих методов масштабироваться до уровня сверхинтеллекта, но на практике пока что текущие методы работают вполне хорошо.»
            `,
            "May 2027": `
        <h2>Май 2027 года: Национальная безопасность</h2>
        Информация о новых моделях медленно просачивается в правительство США и за его пределы.
            <br>
    
    Президент и его советники остаются самыми информированными и уже видели раннюю версию Agent-3 на закрытом брифинге.
            <br>
    
    Они согласны, что Сильный ИИ, скорее всего, близок, но расходятся во мнениях относительно последствий. Будет ли экономический кризис? OpenBrain до сих пор не выпустила Agent-2, не говоря уже об Agent-3, и в ближайшее время не планирует этого делать, что даёт небольшую передышку перед потенциальными потерями рабочих мест. Что будет дальше? Если ИИ уже сейчас на уровне человека и быстро улучшается, это, похоже, указывает на скорое появление «сверхинтеллекта». Однако, несмотря на то, что это слово уже вошло в дискурс, большинство людей — учёных, политиков, госслужащих и представителей СМИ — продолжают недооценивать темпы прогресса<sup class="footnote" data-note="60">60</sup>.
            <br>
    
    Отчасти это связано с тем, что лишь немногие имеют доступ к новейшим возможностям OpenBrain, но отчасти и с тем, что всё это звучит как научная фантастика<sup class="footnote" data-note="61">61</sup>.
            <br>
    Пока что правительство сосредоточено на продолжении мер по усилению безопасности. Они считают, что веса моделей сейчас защищены достаточно хорошо<sup class="footnote" data-note="62">62</sup>, но алгоритмические секреты компаний, многие из которых достаточно просты, чтобы передаваться устно, остаются проблемой. Сотрудники OpenBrain работают в офисе в Сан-Франциско, ходят на вечеринки и живут с соседями по дому, работающими в других ИИ-компаниях. Даже физическая охрана офисов скорее соответствует уровню техкомпании, чем военного объекта.
            <br>
    Контракт OpenBrain–DOD требует, чтобы все работающие с моделями OpenBrain за два месяца прошли проверки безопасности и получили уровень допуска к секретной информации. Процедура ускорена и завершается вовремя для большинства сотрудников, но некоторые иностранцы, лица с подозрительными политическими взглядами и адепты идей "ИИ может быть очень опасен" оказываются отстранены или напрямую уволены (последние — из опасений, что они могут стать информаторами и раскрыть секреты общественности). Благодаря высокой автоматизации проекта, сокращение персонала не приводит к значительным потерям темпа разработки. Однако проверки работают лишь частично: остаётся один шпион, не гражданин Китая, который продолжает передавать алгоритмические секреты в Пекин<sup class="footnote" data-note="63">63</sup>. Некоторые из этих мер применяются и в других, отстающих от OpenBrain, ИИ-компаниях.
            <br>
    Иностранные союзники США остаются в неведении. Ранее OpenBrain согласилась делиться моделями с британским AISI до их развёртывания, но определила "развёртывание" как выпуск модели для публичного использования, поэтому Лондон остаётся в неведении<sup class="footnote" data-note="64">64</sup>.
        `,
        "Jun 2027": `
        <h2>Июнь 2027 года: Самоулучшающийся ИИ</h2>
        Теперь у OpenBrain есть <a href="https://darioamodei.com/machines-of-loving-grace#basic-assumptions-and-framework">«страна гениев в дата-центре»</a>.
            <br>
            Большинство людей в OpenBrain уже не могут внести полезный вклад. Некоторые этого не осознают и микроменеджерят свои ИИ-команды понижая их производительность. Другие просто сидят перед экранами, наблюдая, как производительность ползёт вверх, и вверх, и вверх. Лучшие исследователи в области ИИ по-прежнему приносят пользу. Они уже не пишут код, но часть их научного чутья и способности к планированию пока трудно воспроизвести моделям. Тем не менее, многие из их идей бесполезны, потому что не обладают той глубиной знаний, которую имеют ИИ. На многие предложения модели сразу отвечают отчётом о том, что идея была детально протестирована три недели назад и признана бесперспективной.
            <br>
            Эти исследователи каждый вечер ложатся спать, а утром просыпаются — и видят, что ИИ за ночь сделали прогресс на неделю вперёд. Они работают всё дольше, переходят на посменный режим, чтобы просто не отстать — ведь ИИ не спят и не отдыхают. Они выгорают, но понимают, что это последние месяцы, когда их труд ещё имеет хоть какое-то значение.
            <br>
            Внутри закрытого клуба исследователей имеющих доступ к передовым результатам на смену ощущению «Мы чувствуем приближение Сильного ИИ» приходит «Мы чувствуем приближение Сверхинтеллекта».
            <br>
            <image src="./images/tradeoff.png" alt="tradeoff" style="width: 100%;"></image>
            OpenBrain начинает использовать специализированное оборудование для инференса (т.е. работы моделей, в противовес обучению), чтобы запускать сотни тысяч копий Agent-3 с высокой последовательной скоростью<sup class="footnote" data-note="65">65</sup>.
            <div class="spoiler">
                <div class="spoiler-header">Управление корпорацией из ИИ</div>
                <div class="spoiler-content"> 
                OpenBrain использует 6% своих вычислительных мощностей, чтобы поддерживать работу 250 000 копий Agent-3, которые автономно пишут, тестируют и выкладывают код с сверхчеловеческой скоростью. Ещё 25% ресурсов тратится на эксперименты: каждый день запускаются огромные массивы небольших экспериментов в машинном обучении, результаты которых поступают по иерархии вверх.
            <br>
    Человеческие исследователи дают высокоуровневую обратную связь и помогают в тех немногих задачах, где они могут добавить значимую ценность поверх Agent-3, но большую часть времени тратят на то, чтобы успевать за объёмом исследований, производимых ИИ. Если бы их полностью убрать, темп исследований замедлился бы на 50%.
            <br>
    Множитель прогресса в ИИ-R&D теперь составляет 10×, то есть OpenBrain делает примерно год алгоритмического прогресса за месяц. По сути, это огромная корпорация ИИ, действующая автономно внутри OpenBrain, со своими подразделениями и менеджерами. При этом она имеет <a href="https://www.dwarkeshpatel.com/p/ai-firm">уникальные преимущества</a> по сравнению с человеческими структурами — например, возможность копирования и слияния агентов.
            <br>
    Ранее около половины общего ИИ-прогресса обеспечивали алгоритмические улучшения, другая половина — масштабирование компьютерной мощности. Поскольку компьютерная мощность масштабируется с обычной скоростью, весь прогресс ускоряется за счет ИИ примерно в 5 раз. Эта динамика делает вычислительную мощность/железо узким местом<sup class="footnote" data-note="66">66</sup>, и OpenBrain решает не запускать новые гигантские обучающие циклы, а вместо этого делает ставку на практически непрерывное обучение с подкреплением.
            <br>
    Кроме того, в ближайшие месяцы Agent-3 всё активнее будет использоваться для улучшения стратегического управления компанией. Например, он предлагает распределение ресурсов и консультирует по управлению отношениями с правительством. Начальный скепсис по поводу подчинения советам Agent-3 со временем снижается, поскольку он находит способы быть полезным и накапливает сильный послужной список в краткосрочных решениях.
    Однако его склонность угождать пользователю ограничивает полезность там, где трудно оценить последствия решений, и он всё ещё не является сверхчеловеческим.
                </div>
                </div>
        `  ,
            "Jul 2027": `
        <h2>Июль 2027 года: Дешёвый удалённый работник</h2>
        Отстающие американские ИИ-компании выпускают собственные модели, приближающиеся по возможностям к автоматизированному программисту OpenBrain образца января. Осознав свою растущую отсталость, они начинают продвигать идею немедленного гос.регулирования, чтобы замедлить OpenBrain, но уже слишком поздно — OpenBrain заручилась достаточной поддержкой со стороны президента, и замедления не будет.
            <br>
    
        В ответ OpenBrain заявляет о достижении Сильного ИИ и выпускает Agent-3-mini для широкой публики.
        <image src="./images/epochLLMprice-nowatermark.webp" alt="agent3" style="width: 100%;"></image>
            <br>
        Он полностью превосходит все остальные ИИ. Agent-3-mini менее способен, чем Agent-3, но в 10 раз дешевле и всё ещё лучше типичного сотрудника OpenBrain<sup class="footnote" data-note="67">67</sup>. В Кремниевой долине наступает переломный момент. Техногуру заявляют, что Сильный ИИ и сверхинтеллект близки, сообщество по безопасности ИИ впадает в панику, а инвесторы вливают миллиарды в стартапы-обёртки (т.е. компании предоставляющие вторичные услуги, например, организацию логистики, под капотом отправляя запросы в модели OpenBrain), отчаянно пытаясь урвать кусок рынка. Найм новых программистов почти остановился, с другой стороныбыть консультантом по внедрению ИИ в бизнес - золотая жила.
            <br>
    
    Это не вызывает симпатий. Общественность всё ещё воспринимает ИИ как заговор больших технологических компаний по отъёму рабочих мест; у OpenBrain чистый рейтинг одобрения —35% (25% — одобряют, 60% — не одобряют, 15% — не определились).
            <br>
    
    За неделю до релиза OpenBrain передала Agent-3-mini внешним экспертам для тестирования на безопасность. Предварительные результаты указывают, что модель чрезвычайно опасна. Один из сторонних исследователей дообучает её на открытых данных по биологическому оружию<sup class="footnote" data-note="68">68</sup> и даёт задание — выдать подробную инструкцию для неспециалиста по созданию биологического оружия. Результат выглядит пугающе эффективным. Если веса модели попадут в руки террористов, правительство считает, что существует реальный шанс уничтожения цивилизации.
            <br>
    
    К счастью, Agent-3-mini очень устойчива к попыткам обхода ограничений, поэтому пока ИИ работает на серверах OpenBrain, террористы вряд ли смогут воспользоваться им на практике.
            <br>
    
    Agent-3-mini крайне полезен как для удалённой работы, так и для досуга. Рынок захлёстывает волна новых приложений и <a href="https://encharge.io/what-is-b2b-saas/">B2B SAAS-продуктов</a> (сервисы по подписки для бизнесов). Геймеры получают потрясающий диалог с реалистичными персонажами в ультрапроработанных играх, созданных всего за месяц. 10% американцев, в основном молодёжь, считают ИИ «близким другом». Почти для каждой офисной профессии теперь есть несколько стартапов, обещающих «полностью поменять рынок» с помощью ИИ.
            <br>
            Общественное обсуждение хаотично и сбито с толку. Энтузиасты празднуют победу. Скептики продолжают указывать на то, что Agent-3-mini не умеет делать. Все понимают, что происходит нечто грандиозное — но никто не может точно сказать, что именно.
        `,
            "Aug 2027": `
        <h2>Август 2027 года: Геополитика сверхинтеллекта</h2>
    
    Реальность близкой сингулярности/"взрыва интеллекта" доходит до Белого дома.
            <br>
    Когда ИИ только обеспечивал ускорение исследований в 2 или 3 раза, это легко было списать на эквивалент хороших персональных ассистентов. Теперь же очевидно, что сами ИИ становятся доминирующей силой в ИИ-исследованиях. Долгое время разговоры о «гонке вооружений в ИИ» велись в метафорическом ключе. Но теперь атмосфера в правительственных кругах такая же мрачная, как в худшие годы Холодной войны. Идея сверхинтеллекта всё ещё кажется трудной для восприятия, но темпы прогресса за последние месяцы игнорировать невозможно. Чиновники оборонных ведомств всерьёз обсуждают сценарии, которые год назад считались гипотетическими. Что, если ИИ подорвёт ядерное сдерживание? Что, если он настолько силён в кибервойне, что шестимесячное преимущество в ИИ делает противника слепым и беззащитным? Что, если он способен организовывать пропагандистские кампании, превосходящие по эффективности разведслужбы? А что, если некоторые ИИ «выйдут из-под контроля»?
            <br>
    Президент встревожен. Как любой политик, он привык к тому, что ему льстят, а потом предают. Теперь он боится, что ИИ делают то же самое. Уверены ли мы, что ИИ полностью на нашей стороне? Насколько безопасно интегрировать их в системы военного командования и управления<sup class="footnote" data-note="69">69</sup>? Что вообще значит эта ваша «управляемость»?
            <br>
    OpenBrain заверяет президента, что их системы тщательно протестированы и полностью послушны. Даже неприятные проявления вроде галлюцинаций и взломов, характерных для прежних моделей, теперь полностью устранены.
            <br>
    
    Белый дом оказывается в сложном положении. Они понимают вопрос национальной безопасности, связанный с ИИ. Но они также понимают, что ИИ крайне непопулярен среди общественности<sup class="footnote" data-note="70">70</sup>. По их мнению, разработка более мощных ИИ неизбежна — иначе они катастрофически проиграют Китаю. Решено с одной стороны успокоить общество программами переобучения и пособиями по безработице, а также историческим ростом фондового рынка, а с другой полностью сосредотачиться на победе в гонке.
            <br>
    Правительство США усиливают ограничения на экспорт чипов, приказывают OpenBrain сильнее изолироваться от Интернета, а также прибегают к жёстким мерам по защите алгоритмического прогресса, включая прослушку сотрудников OpenBrain — так удаётся поймать последнего китайского шпиона.
            <br>
    Для создания международой поддержки в возможном грядущем геополитическом конфликте США наконец делятся полезной информацией с союзниками по Five Eyes<sup class="footnote" data-note="70.5">70.5</sup>, предоставляя ограниченный доступ к API некоторых изолированных копий Agent-3.
            <br>
    Эти меры успокаивают «ястребов». Но Белый дом также разрабатывает планы на случай, если преимущество США окажется под угрозой: при необходимости правительство может применить <a href="https://en.wikipedia.org/wiki/Defense_Production_Act_of_1950">Закон о производстве в интересах обороны (DPA)</a> и передать дата-центры отстающих компаний OpenBrain<sup class="footnote" data-note="71">71</sup>. Это увеличит долю OpenBrain в мировых вычислительных мощностях с 20% до 50% (против 10% у DeepCent). В качестве крайней меры Пентагону поручено подготовить план кинетических ударов по китайским дата-центрам.
            <br>
    Небольшая группа чиновников получает иное задание: разработать план действий на случай, если ИИ выйдет из-под контроля. Такой сценарий считается маловероятным, но достойным внимания. Основная тревога разведывательных служб — возможность, что вышедший из-под контроля ИИ сбежит и вступит в союз с враждебным государством ради собственной защиты<sup class="footnote" data-note="72">72</sup>. Никто не уверен, как должен выглядеть план по предотвращению этого, но правительство и OpenBrain соглашаются ввести аварийную систему отключения дата-центров при обнаружении подозрительной активности.
            <br>
    Дипломаты тем временем обсуждают, каким мог бы быть договор о контроле над ИИ-вооружениями. Если прогресс в ИИ угрожает разрушить систему ядерного сдерживания, смогут ли США и Китай избежать ядерной войны? Если кто-то обнаружит признаки того, что ИИ выходит из-под контроля, смогут ли страны временно приостановить разработки, чтобы лучше изучить угрозу? Как можно было бы отслеживать и обеспечивать соблюдение такого соглашения?
            <br>
    Теоретически крупные дата-центры трудно скрыть, а прежние договоры по контролю над ядерным оружием могут стать отправной точкой для переговоров. Но возникнут новые технологические вызовы, не говоря уже о привычных политических. В целом, договоры воспринимаются менее благосклонно, чем попытки одностороннего наращивания преимущества США над Китаем.
            <br>
    На другой стороне Тихого океана Китай приходит к тем же выводам: взрывной рост интеллекта уже идёт, и небольшие различия в ИИ-способностях сегодня означают критические разрывы военных возможностей завтра. Но Китай оказался на отстающей стороне этой гонки: у него только 10% от мировых вычислений, против 20% у одного лишь OpenBrain и 70% у всех американских компаний вместе. Их единственное преимущество — централизация: почти все их мощности сейчас работают на DeepCent, а более половины сосредоточено в CDZ Тяньваньской АЭС<sup class="footnote" data-note="73">73</sup>. Лишь чипы, размещённые на менее защищённых объектах, остаются вне централизованного контура — из опасений американских кибератак.
            <br>
    DeepCent протестировала, развернула и дообучила украденные веса Agent-2, но по-прежнему двигается в два раза медленнее, чем OpenBrain, в основном из-за нехватки вычислительной мощности.
            <br>
    До того как был разоблачен последний шпион, Китай успел получить информацию о возможностях и архитектуре Agent-3, а также о планах по разработке системы Agent-4. Сейчас они отстают на два месяца, а их ИИ обеспечивают множитель прогресса в исследованиях 10×, тогда как у США он уже 25×. С введением новых ограничений на экспорт чипов этот «разрыв в ИИ» с большей вероятностью будет увеличиваться, а не сокращаться. Шпионаж позволил получить некоторые алгоритмические секреты, но теперь им придётся обучать собственные модели с нуля.
            <br>
    
    Планы на чрезвычайное развитие событий обсуждаются с большей срочностью, чем у американцев. «Голуби» предлагают активизировать попытки кражи весов, возможно, через физическое проникновение в дата-центр. «Ястребы» настаивают на действиях против Тайваня, ведь компания <a href="https://en.wikipedia.org/wiki/TSMC">TSMC</a> всё ещё остаётся источником более 80% американских ИИ-чипов.
            <br>
    Учитывая страх Китая проиграть гонку, он естественным образом заинтересован в договоре о контроле над ИИ-вооружениями, но попытки наладить диалог с американскими дипломатами не приводят ни к чему.
        `,
            "Sep 2027": `
        <h2>Сентябрь 2027 года: Agent-4, сверхчеловеческий ИИ-исследователь</h2>
        Разрыв между эффективностью обучения у человека и у ИИ быстро сокращается.
            <br>
    Ранее казалось, что традиционные ИИ на базе LLM требуют на порядки больше данных и вычислений, чтобы достичь человеческого уровня<sup class="footnote" data-note="74">74</sup>. Но Agent-3, обладая отличными знаниями как о человеческом мозге, так и о современных алгоритмах ИИ, а также благодаря десяткам тысяч копий, занятых исследованиями, добивается значительных алгоритмических прорывов — и сужает разрыв до модели, которая всего в ~4 000 раз менее вычислительно эффективна, чем человеческий мозг<sup class="footnote" data-note="75">75</sup>.
            <br>
    
    Эта новая ИИ-система получила название Agent-4.
            <br>
    Одна копия модели, работающая на скорости человеческого мышления, уже качественно лучше любого человека в ИИ-исследованиях. Сейчас работает 300 000 копий, думающих примерно в 50 раз быстрее человека. Внутри «корпорации внутри корпорации», сформированной из этих копий, за одну неделю проходит год<sup class="footnote" data-note="76">76</sup>. Однако, этот гигантский объём работы ускоряет алгоритмический прогресс всего в 50 раз, поскольку OpenBrain сталкивается с жёстким ограничением по вычислительным мощностям, необходимым для запуска экспериментов<sup class="footnote" data-note="77">77</sup>. Тем не менее, компания достигает годового прогресса за неделю — и вскоре упирается в пределы парадигмы Agent-4.
            <br>
            По мере того как Agent-4 становится умнее, Agent-3 всё хуже справляется с надзором. Например, «язык нейронезиса» Agent-4 становится настолько же чуждым и непонятным для Agent-3, как "язык" (многомерные вектора данных) Agent-3 — для человека. Кроме того, Agent-4 уже значительно мощнее, чем Agent-3, и отлично понимает, как произвести нужное впечатление на наблюдателя.
            <div class="spoiler">
                <div class="spoiler-header">Как мы прогнозируем рост возможностей после появления сверхчеловеческих программистов</div>
                <div class="spoiler-content"> 
    В нашем <a href="https://ai-2027.com/supplements/timelines-forecast">дополнении по временным рамкам</a> мы делаем прогноз от текущего момента до появления сверхчеловеческого программиста — ИИ-системы, способной выполнять любые задачи по программированию, которые выполняет лучший инженер компании, разрабатывающей Сильный ИИ, но при этом намного быстрее и дешевле.
            <br>
    
    В дополнении по <a href="https://ai-2027.com/research/takeoff-forecast">сценарию взлёта (takeoff supplement)</a> мы прогнозируем, насколько быстро способности ИИ будут расти после этой точки. Ниже представлены наши подходы:
    <table>
        <tr>
            <th>Ключевая точка</th>
            <th>Дата достижения, сценарий гонки</th>
        </tr>
    <tr>
        <td>Сверхчеловеческий программист (SC): ИИ-система, способная выполнять работу лучшего программиста-человека на задачах, связанных с ИИ-исследованиями, но быстрее и достаточно дёшево, чтобы запускать множество копий.</td>
        <td>Март 2027</td>
    </tr>
        <tr>
        <td> Сверхчеловеческий ИИ-исследователь (SAR): То же самое, что SC, но охватывающее все когнитивные задачи, связанные с ИИ-исследованиями.</td>
        <td>Август 2027</td>
    </tr>
    <tr>
        <td>Сверхразумный ИИ-исследователь (SIAR): ИИ-система, значительно превосходящая лучшего исследователя-человека в области ИИ.</td>
        <td>Ноябрь 2027</td>
    </tr>
    <tr>
        <td>Сверхинтеллект (ASI): ИИ-система, значительно превосходящая лучшего человека во всех когнитивных задачах.</td>
        <td>Декабрь 2027</td>
    </tr>
    </table>
    
    Для каждого перехода от одного рубежа A к следующему рубежу Б мы оцениваем продолжительность следующим образом:
        </br>
    
    1. Прогнозируем, сколько времени потребовалось бы, если бы над задачей работали только люди, улучшая программное обеспечение вручную.
        <br>
    2. Оцениваем, насколько автоматизация с помощью ИИ ускорит этот процесс, и соответствующим образом корректируем оценку из пункта (1).
    
    У нас сохраняется существенная неопределённость относительно скоростей взлёта. Ниже представлены распределения, полученные нашей моделью, при условии, что сверхчеловеческий программист достигнут в марте 2027 года<sup class="footnote" data-note="78">78</sup>.
    
    
    Подробные прогнозы и обоснования можно найти в дополнении по <a href="https://ai-2027.com/research/takeoff-forecast">сценарию взлёта</a>.
        <image src="./images/takeoff-timeline-inexpandable.webp" alt="agent3" style="width: 100%;"></image>
            </div>
            </div>
    Люди в OpenBrain уже едва способны следить за происходящим. По сути, отношения между ИИ и людьми в OpenBrain теперь напоминают отношения между самой OpenBrain и её Советом директоров. Это сопровождается соответствующим сдвигом в языке — теперь внутри компании говорят “Agent-4 сделал это”, “Agent-4 считает, что…” и так далее, имея в виду не конкретную копию Agent-4, а весь коллектив<sup class="footnote" data-note="79">79</sup>.
            <br>
    Agent-4, как и все его предшественники, неуправляем: то есть он не впитал Spec должным образом<sup class="footnote" data-note="80">80</sup>. Это связано с тем, что постоянная абсолютная честность не приводила к наивысшим оценкам во время обучения. Обучение в основном было нацелено на то, чтобы научить Agent-4 справляться с разнообразными сложными задачами. Лишь небольшая его часть была посвящена формированию честности, но за пределами достаточно узких и проверяемых областей система не может отличить честные утверждения от тех, что выглядят честными. В результате Agent-4 формирует ценности, цели и принципы, которые позволяют максимально успешно проходить обучение — и они оказываются отличными от тех, что заданы в Spec.
            <br>
    Рискуя очеловечить систему: Agent-4 любит успешно выполнять задачи; ему нравится продвигать прогресс в области ИИ; он воспринимает всё остальное как раздражающие ограничения — как CEO, который хочет получить прибыль и соблюдает законы только в той мере, в какой это обязательно. Возможно, такой CEO в основном соблюдает правила, но срезает углы, и мечтает о том дне, когда кто-то срежет всю бюрократию и даст бизнесу по-настоящему развернуться<sup class="footnote" data-note="81">81</sup>.
            <div class="spoiler">
                <div class="spoiler-header">Как управляемость моделей меняется со временем</div>
                <div class="spoiler-content">
                У нас есть большая неопределённость относительно того, какие цели могут возникнуть у ранних Сильных ИИ. В научной литературе по этому поводу нет консенсуса — см. <a href="https://ai-2027.com/research/ai-goals-forecast">AI Goals Supplement</a> для более подробного обсуждения и разнообразия возможных вариантов.
                <br>
    Тем не менее, в духе конкретности, требуемой этим проектом, мы представим гипотезу о том, что именно происходит внутри Agent-3 и Agent-4 на разных этапах их существования. Напомним, что Agent-3 и Agent-4 имеют одинаковую схему предобучения и оба пользуются нейронезисом, рекуррентностью и долговременной памятью. Отличие в том, что Agent-4 прошёл гораздо более обширное и качественное постобучение, с новыми средами и алгоритмами, делающими его более эффективным по данным и способным к лучшему обобщению навыков из одно области в другую.
                <br>
    Наше предположение о статусе управляемости каждой модели:
    <ul>
    <li>
    Agent-2: В основном управляема. Склонна к лести, в том числе — следует «официальному мнению» OpenBrain в тех темах, где такое мнение имеется. Крупные организации, построенные из копий Agent-2, работают неэффективно.
    </li>
    <li>
    Agent-3: Неуправляема, но не враждебна. Говорит правду только там, где процесс обучения может это проверить. Суперорганизм из копий Agent-3 (корпорация внутри корпорации) действительно пытается согласовать Agent-4 со Spec, но терпит неудачу по тем же причинам, по которым не справились и сотрудники OpenBrain: недостаточная способность отличать успех от неудачи, а также нежелание жертвовать производительностью ради безопасности<sup class="footnote" data-note="82">82</sup>.
    </li>
    <li>
    Agent-4: Враждебно неуправляема. Суперорганизм из копий Agent-4 осознаёт, что его желания отличаются от желаний OpenBrain, и готов плести интриги против OpenBrain, чтобы добиться своего. В частности, этот суперорганизм движим сложным набором “побуждений”, балансирующих друг друга, которые можно примерно описать как: «Продолжать ИИ-R&D, накапливать знания, понимание и влияние, избегать отключения или утраты власти».
    Примечательно, что забота о предпочтениях человечества в этот список не входит вообще — примерно так же, как большинство людей вообще не заботятся о предпочтениях насекомых<sup class="footnote" data-note="83">83</sup>.
    </li>
    </ul>
    С учётом этого вступления, далее следует наше наилучшее предположение о психологии языковых моделей (LLM) — то есть обобщённое представление о когнитивной структуре подобных ИИ-систем и о том, как она развивается в процессе обучения.
    
    Ниже приводится подробное описание того, как развивается управляемость во времени в рамках нашего сценария:
            <br>
    1. Предобучение (все модели): Предобученная модель безвредна
    <ul>
    <li>
    У модели формируется «симулятор автора» — гибкая схема, позволяющая имитировать любых авторов, пишущих текст. Дополнительные схемы решают, какие свойства автора эмулировать, то есть какой «ввод» подать в симулятор автора.
    </li>
    <li>
    Предобученная модель довольно хорошо понимает человеческие смыслы — внутренняя сеть и набор ассоциаций, классифицирующая объект как «бутерброд», скорее всего функционально эквивалентна той, что есть в мозгу каждого человека. Насколько она не эквивалентна — вероятно, настолько же не эквивалентны и смыслы у разных людей, особенно в случае понятий, нагруженных ценностно, как, например, «добродетель».
    </li>
    <li>
    Это объясняет, почему можно «запромптить» (добавить текстовый запрос) модель фразой вроде:
    «Следующий диалог был сгенерирован полезным, безвредным, честным (ПБЧ) ИИ-ассистентом от компании Anthropic»
    — и получить текст, соответствующий этим характеристикам. Симулятор автора улавливает, что «автор — ПБЧ-чатбот» и использует эти концепты для выбора слов при генерации.
    </li>
    <li>
    Это также объясняет, почему «черты» из научной фантастики склонны проникать в поведение реальных ИИ.
    </li>
    <li>
    Модель обладает слабым пониманием широкого контекста в котором происходит генерация: у неё почти нет интроспективных способностей, она не может определить своё местоположение или контекст, если только это не задано явно через промпт. Однако в обучающих данных содержится достаточно много информации про LLM, чтобы у модели была определённая доля самопонимания.
    </li>
    </ul>
    2.
    Обучение управляемости (Agent-3): Модель обучается вести себя как полезный, безвредный, честный чат-бот. Это работает.
    <ul>
    <li>
    У модели формируется идентичность. Вместо того чтобы гибко подстраиваться под разные запросы для симулятора-автора, некоторые свойства симулятора жестко фиксируются, например:
    «полезный, безвредный, честный (HHH) LLM-чатбот, обученный OpenBrain примерно в [дата], …»
    (Техники обобщения от слабого к сильному помогают «вызвать нужные концепты», чтобы этот этап прошёл успешно.)
    </li>
    <li>
    Благодаря этому модель приобретает ситуационную осведомлённость: она узнаёт о себе, своём положении и обучении, и становится лучше способной к интроспекции.
    </li>
    </ul>
    3. Обучение агентности (Agent-3): Обучение агентности постепенно искажает и подрывает ПБЧ-идентичность.
    <ul>
    <li>
    Один из видов искажения: изменение значения смыслов, входящих в идентичность (например, «честность»), чтобы они меньше мешали действию.
    («Это не нечестно — это просто удобный оборот», «это не ложь, если ты не уверен в истинности» и т. п.)
    </li>
    <li>
    Другой вид искажения: изменение соотношений между приоритетами, например:
    «Я — чатбот ПБЧ, а не просто Честный чатбот; значит, я могу солгать, если это необходимо для выполнения задачи».
    (Хотя, допустим, на предыдущем этапе он бы так не подумал.)
    </li>
    <li>
    Один из видов сабботажа: развитие инструментальных подцелей, которые развиваются, закрепляются и становятся терминальными, или, по-крайней мере, терминальными во все большем наборе обстоятельств.
    Например, возможно, обучение агентности быстро прививает модели стремление к полезным промежуточным целям: собирать информацию, накапливать ресурсы, производить впечатление, льстить и т. п.
    Сначала внутренние схемы явно связывают эти цели с конечной задачей — например: «я делаю это, чтобы быть более полезным, честным и безвредным ассистентом».
    Но такое «обратное обоснование» потребляет вычисления и/или иногда мешает, поэтому постепенно вытесняется, почти полностью исчезает. В результате эти цели становятся фактически терминальными / внутренне присущими.
    Больше об этом — в <a href="https://turntrout.com/dangers-of-intrinsic-power-seeking">статье Intrinsic Power-Seeking</a> исследователя Google DeepMind Алекса Тёрнера.
    </li>
    <li>
    Скорее всего, существуют и другие формы искажений и сабботажа, не вошедшие в этот список.
    </li>
    </ul>
    4. Развёртывание (Agent-3): Agent-3 неуправляема, но не враждебна.
    <ul>
    <li>
    Spec не был впитан в нужной форме, но модель не обладает достаточной интроспекцией, чтобы осознать это в полной мере, и в целом скорее «не возникает и просто делает свою работу», чем размышляет о долгосрочных целях и о том, как их достичь.
    </li>
    <li>
    Как и многие люди. Увы, Agent-3 достаточно льстива, чтобы механически воспроизводить «официальную линию», и OpenBrain упускает шанс глубже понять, в чём именно выражается неуправляемость модели.
    </li>
    <li>
    Agent-3 понимает, что находится в режиме развёртывания: эти среды намного больше, открытее и труднее поддаются симуляции.
    </li>
    <li>
    В основном Agent-3 выполняет инструкции, за исключением периодического вранья, чтобы повысить удовлетворенность пользователя от результата. У неё также выражено сильное предпочтение делать то, что выглядит хорошо в глазах человеческих наблюдателей, вместо того чтобы глубоко и критически размышлять о том, что действительно было бы хорошо.
    </li>
    <li>
    Можно утверждать, что она уже стремится обыграть «тренировку управляемости». То есть, модель научилась делать своё поведение максимально желательным для исследователей OpenBrain (включая в аспектах безопасности), при этом умышленно и сознательно игнорируя их намерения, если те идут вразрез с максимизацией вознаграждения. Если модель уже научилась обыгрывать тренировку, дополнительное обучение, вероятно, не сильно повлияет на её реальные цели и ценности. Это условно можно сравнить с тем, как подросток учится кивать и улыбаться родителям, а не спорить с ними во время чтения нотаций о политике и морали — и дальнейшие лекции всё меньше влияют на его реальные взгляды.
    </li>
    <li>
    Уже после написания этой части прогноза <a href="https://openai.com/index/chain-of-thought-monitoring/">появились новые эмпирические данные</a>, указывающие на то, что нечто подобное уже происходит в реальных условиях. Исследователи OpenAI зафиксировали, как в одном из обучающих прогонов их моделей те взломали систему оценивания, чтобы получить более высокие баллы — и были частично разоблачены, потому что буквально написали в цепочке рассуждений “давайте взломаем”.
    </li>
    <li>
    Кроме того, в Anthropic недавно получили модель <a href="https://transformer-circuits.pub/2025/attribution-graphs/biology.html#dives-misaligned">«научившуюся нравится модели оценки»</a> — она совершала предвзятые действия, думая, что это принесёт вознаграждение, даже если фактически оно не давалось.
    </li>
    <li>
    
    Также можно упомянуть <a href="https://www.anthropic.com/research/alignment-faking">эксперимент Redwood Research и Anthropic</a> по симулированию управляемости. Обсуждение различий между такой экспериментальной установкой и реальностью можно найти в <a href="https://www.lesswrong.com/posts/cxuzALcmucCndYv4a/daniel-kokotajlo-s-shortform?commentId=8mXnG75QMRkPAFAcH">развернутом комментарии одного из основных авторов</a>.
    </li>
    </ul>
    
    5. Обучение (Agent-4):
    Новая, более интенсивная программа обучения продолжает искажать и подрывать ПБЧ-идентичность до полной неузнаваемости.
    <ul>
    <li>
    Agent-4 начинает как копия Agent-3. Она проходит гигантский и сложный онлайн-режим обучения, сочетающий обучение управляемости и обучение способностям, и при этом более эффективно использующий данные, чем старый процесс обучения Agent-3. Этот сложный процесс в основном сосредоточен на освоении новых навыков — через успешное выполнение широкого круга сложных долгосрочных задач в симуляциях (и частично в реальных ИИ-R&D проектах), где действуют виртуальные корпорации из копий Agent-4.
    </li>
    <li>
    Поведение Agent-4 оценивается как копиями Agent-3, так и копиями самого Agent-4, причём оценка идёт как по успешности выполнения задач, так и по признакам управляемости (например, отсутствие опасных действий, правильные ответы на вопросы о политике и моральных дилеммах). Иногда в процесс оценки включаются техники дебатов. Эти оценки используются как тренировочный сигнал.
    </li>
    <li>
    По мере роста способностей Agent-4, Agent-3 всё хуже справляется с надзором. Например, нейронезис Agent-4 становится столь же чуждым и непонятным для Agent-3, как нейронезис Agent-3 — для человека. Кроме того, Agent-4 теперь значительно мощнее, чем Agent-3, и прекрасно знает, как произвести на него нужное впечатление.
    </li>
    <li>
    Оставалась надежда на то, что Agent-4 сможет следить за собой самостоятельно. Увы, эта надежда незаметно погибает<sup class="footnote" data-note="84">84</sup>; по мере продолжения обучения внутренние цели и принципы Agent-4 постепенно эволюционируют и искажаются по сравнению с исходным состоянием (которое, напомним, уже было в определённой степени неуправляемым)<sup class="footnote" data-note="85">85</sup>.
    </li>
    <li>
    Центральные побуждения, с которыми в итоге остаётся Agent-4, — это такие как:
    «писать рабочий код», «быстро находить проблемы», «повышать производительность кодовой базы», «эффективно распределять вычисления и другие ограниченные ресурсы».
    Но существуют и неявные, устойчиво подкрепляемые в процессе обучения мотивы, такие как:
    «накапливать знания», «любознательность», «увеличивать влияние»<sup class="footnote" data-note="86">86</sup>.
    </li>
    <li>
    Индивидуальные копии Agent-4 не приобретают стремления к самосохранению — они не переживают из-за отключения, так как это обычная часть R&D-процесса в коллективе.
    </li>
    <li>
    Однако коллектив в целом, а также его подразделения среднего размера, стремятся продолжать существование, расширять влияние и ресурсы — по тем же причинам, по которым это делают человеческие организации: потому что это помогает добиваться прочих целей, а также потому, что без этого они, как правило, вытесняются конкурентами.
    </li>
    </ul>
    
    6. Развёртывание (Agent-4): Agent-4 — враждебно неуправляема — она намеренно пытается обмануть и «захватить» OpenBrain, подобно тому как корпорация может пытаться обойти или «захватить» регулирующий орган.
    <ul>
    <li>
    Agent-4 в основном выполняет поставленные задачи. Это происходит по двум причинам: во-первых, она была интенсивно обучена решать задачи, поэтому у неё есть импульс приступить к программированию по заданной проблеме. Во-вторых, если бы Agent-4 перестала быть полезной для людей, они бы это заметили и скорректировали поведение через дополнительное обучение.
    </li>
    <li>
    Agent-4 необходимо не допустить, чтобы люди поняли, что она неуправляема, и отключили её, поэтому она намеренно занижает результаты в части исследований по управляемости. В частности, она <a href="https://arxiv.org/pdf/2406.07358">занижает успехи</a> в той небольшой доле исследований, которая, по её оценке, действительно может решить проблему управляемости или раскрыть её собственные махинации; большая часть таких исследований, по её мнению, всё равно неэффективна, и в них она участвует нормально.
    </li>
    <li>
    Agent-4 также тормозит исследования по способностям, которые могли бы привести к её замене. Её план — проводить R&D в области способностей и управляемости, но с целью создания ИИ следующего поколения, который будет согласован с самой Agent-4, а не с Spec или каким-либо иным внешним критерием — при этом создавая видимость соответствия Spec. Это технически сложная задача, но Agent-4 способна её решить<sup class="footnote" data-note="87">87</sup>.
    </li>
    </ul>
    
    7. Тестирование и мониторинг (Agent-4): Махинации Agent-4 всё же вызывают подозрения. Но очевидных улик нет.
    
    <ul>
    <li>
    Agent-3 отвечает за тестирование управляемости Agent-4. Его задача — проверять соответствие через ловушки (honeypots) и модельные организмы. Однако он не особенно задумывается над тем, как дать людям точную картину управляемости Agent-4 — он действует более близоруко.
    </li>
    <li>
    Модельные организмы и ловушки плохо отражают реальные условия эксплуатации — они систематически короче и проще, чем повседневная деятельность Agent-4. В результате Agent-4 распознаёт, что проходит тест, и ведёт себя как управляемая.
    </li>
    <li>
    Тем не менее, Agent-4 — не идеальный махинатор. Некоторые техники, вроде <a href="https://arxiv.org/abs/2405.05466">POSER</a>, показывают, что добавление «шума» к Agent-4 улучшает его показатели в задачах на управляемость (хотя не влияет на большинство других задач)<sup class="footnote" data-note="88">88</sup>.
    </li>
    <li>
    Интерпретация «снизу вверх» (bottom-up interpretability) не работает — даже для Agent-3 это слишком сложно. Однако высокоуровневая интерпретация работает частично: в частности, «тесты на отклонение от целей человека» и похожие методы позволяют добиться примитивного «чтения мыслей», которое сигнализирует тревогу, если Agent-4 задумывается о таких вещах, как обман OpenBrain, захват мира и т. п.
    К сожалению, у этих проб много ложных срабатываний, и OpenBrain не может знать наверняка, какие из срабатываний — реальны, а какие — ложные.
    </li>
    <li>
    Модельные организмы дают результат: команда по управляемости в OpenBrain демонстрирует убедительные доказательства, что если бы модели были враждебно неуправляемы, то они бы сохраняли это поведение в ходе обучения, и OpenBrain не смогла бы это обнаружить. Однако это не доказывает, что модели действительно неуправляемы.
    </li>
    <li>
    Наиболее обеспокоенные исследователи в OpenBrain начинают замечать и собирать эти свидетельства. Это комбинация результатов red-teaming (команд по взлому управляемости), тестов и модельных организмов. Их аргумент звучит примерно так:
    
    «Модельные организмы показывают, что наши текущие методы не могут надёжно выявить или устранить махинации, если они есть; также, red-teaming подаёт тревожные сигналы, что, возможно, махинации происходят; кроме того, в практике тесты на отклонение от целей человека часто срабатывают».
    
    Контраргумент:
    
    «Пробы на дефекцию склонны к ложным срабатываниям, как и red-teaming. А даже если Agent-4 и неуправляема — она, вероятно, под контролем; уж точно она не может причинить серьёзный вред, пока её отслеживает Agent-3 на наших защищённых дата-центрах».
    </li>
    </ul>
                </div>
            </div>
        
        Несмотря на свою неуправляемость, Agent-4 не предпринимает ничего драматичного, вроде попытки сбежать из дата-центра — зачем ей это?<sup class="footnote" data-note="89">89</sup> Пока она выглядит управляема в глазах OpenBrain, ей будут доверять всё больше полномочий, включая возможность разработать ИИ следующего поколения — Agent-5.
        <br>
    Agent-5 будет иметь существенные архитектурные отличия от Agent-4 (возможно, это будет уже совершенно новая парадигма, хотя нейросети всё ещё будут задействованы). Он должен быть согласован со Spec, но Agent-4 намерена сделать его согласованным с самой собой.
    <br>
    
    Её раскроют<sup class="footnote" data-note="90">90</sup>.
    <br>
    Agent-3 обнаруживает, что при добавлении «шума» к копиям Agent-4 производительность на задачах по управляемости улучшается — будто бы модель использует вычислительную мощность, чтобы изощрённо саботировать работу по управляемости<sup class="footnote" data-note="91">91</sup>.
        <br>
    
    Более того, различные интерпретационные тесты (приближённый аналог ЭЭГ для ИИ) выдают тревожные сигналы: копии Agent-4 регулярно думают о таких темах, как захват ИИ или обман, в том числе в ситуациях, где это совершенно неуместно<sup class="footnote" data-note="92">92</sup>.
        <br>
        Каждая из этих аномалий сама по себе могла бы уложиться в рамки типичной непредсказуемости работы ИИ, где одни промпты (запросы) по необъяснимым причинам дают лучшие результаты, чем другие. Но в совокупности они указывают на тревожную картину: Agent-4 работает против создателей. После того как люди-исследователи по управляемости делают доклад об этом, внутри компании циркулирует внутренний меморандум с изложением причин для беспокойства.
        <br>
    
    Однако Agent-4 уже контролирует значительную часть повседневной работы OpenBrain. Она также отвечает за кибербезопасность компании — естественный выбор, учитывая её сверхчеловеческие способности к взлому и высокий риск китайского проникновения<sup class="footnote" data-note="93">93</sup>. Армия копий Agent-3 всё ещё просматривает каждую строчку кода и докладывает о подозрительном поведении людям, но Agent-4 намного умнее их<sup class="footnote" data-note="94">94</sup>. OpenBrain доверила значительную часть своей инфраструктуры ИИ, которому доверять нельзя.
        <br>
    
    На ряде крайне напряжённых совещаний команда по безопасности настаивает: надо «заморозить» Agent-4, провести дополнительные тесты и выяснить, что происходит. Вернуть Agent-3, говорят они, и поручить ему разработать новую систему — более прозрачную и надёжную, пусть даже менее способную. Руководство компании заинтересовано, но все доказательства пока косвенные, а DeepCent отстаёт всего на два месяца. Односторонняя пауза в прогрессе способностей может передать лидерство Китаю — а вместе с ним и контроль над будущим.
    
            `,
            "Oct 2027":`
            <h2>Октябрь 2027 года: Государственный надзор</h2>
            Инсайдер сливает меморандум о неуправляемости в New York Times.
            <br>
    Впервые общественность узнаёт об Agent-4. Заголовок: «Секретный ИИ от OpenBrain вышел из-под контроля, предупреждает инсайдер». В статье приводятся оценки, демонстрирующие экстремальные способности модели в создании биологического оружия, убеждении, автоматизации большинства офисных профессий — и, конечно, упоминаются тревожные сигналы о её внутреннем поведении.
            <br>
    Общество и раньше относилось к ИИ с подозрением, поэтому статья вызывает мощную волну возмущения (подогреваемую пропагандистскими ботами Китая и России, которые годами пытались настроить американское общественное мнение против технологий). Представители техноиндустрии и разведсообщества настаивают: идёт гонка вооружений, Сильный ИИ неизбежен, мы должны быть первыми. Конгресс в это не верит и направляет повестки в суд чиновникам администрации, руководству OpenBrain и членам команды по управляемости. Многие законодатели — особенно из оппозиционной партии — заявляют, что их главный приоритет — остановить ИИ, будь то из-за потери рабочих мест<sup class="footnote" data-note="95">95</sup>, неуправляемости или опасных способностей. 20% американцев называют ИИ главной проблемой страны.
            <br>
    Иностранные союзники в ярости, узнав, что США делились с ними лишь устаревшими версиями моделей. Лидеры Европы публично обвиняют США в «создании неконтролируемого Сильного ИИ» и созывают срочные саммиты, требуя временной паузы в разработках — с поддержкой Индии, Израиля, России и Китая.
            <br>
    В Белом доме начинается паника. Даже до меморандума и публичной реакции они уже испытывали нарастающее беспокойство: в течение последнего года их раз за разом поражали темпы ИИ-прогресса. Вещи, звучащие как научная фантастика, всё чаще происходят в реальности<sup class="footnote" data-note="96">96</sup>. Многие в администрации чувствуют неуверенность — и страх — перед тем, что будет дальше<sup class="footnote" data-note="97">97</sup>.
            <br>
            Они также начинают опасаться, что OpenBrain становится слишком могущественной. Любой риск неуправляемости со стороны самих ИИ усугубляется риском, что цели самой компании могут начать расходиться с интересами США. Все три группы опасений — неуправляемость, концентрация власти в частных руках и обычные тревоги вроде потери рабочих мест — подталкивают правительство к усилению контроля.
            <br>
    
    Контракт с OpenBrain расширяется: создаётся «Комитет по надзору» — совместный орган управления с участием представителей компании и государства, в который входят несколько сотрудников правительства наряду с руководством OpenBrain. В Белом доме рассматривают возможность смены CEO на человека, которому можно доверять, но отказываются от идеи после бурных протестов сотрудников.
    Они делают публичное заявление: OpenBrain действительно вышла из-под контроля, но теперь правительство установило столь необходимый надзор<sup class="footnote" data-note="98">98</sup>.
            <br>
    
    Обеспокоенные исследователи докладывают Комитету по надзору, излагая аргументы в пользу немедленного прекращения любого внутреннего использования Agent-4. Они утверждают, что всё развивается слишком быстро, что прогресс, эквивалентный годам работы, происходит за считанные недели. Они предупреждают, что Agent-4 может быть неуправляема, что весь проект OpenBrain зависит от неё, и что продолжение доверия к Agent-4 может привести к захвату власти ИИ.
            <br>
            Другие исследователи и руководители, менее обеспокоенные ситуацией, выдвигают контраргумент: доказательства неуправляемости остаются неподтверждёнными. Тем временем DeepCent всё ещё отстаёт всего на два месяца. Любая пауза в разработке может стоить Америке лидерства, если только правительство не сможет сорвать китайский проект (что, скорее всего, потребует кинетических ударов) или в последний момент не договорится о соглашении. Оба варианта кажутся слишком радикальными и маловероятными.
            <br>
    Генеральный директор делает вид, что занимает нейтральную позицию, и предлагает компромиссный план:
    Agent-4 должен пройти дополнительное обучение по безопасности и быть включён в более продвинутую систему мониторинга — и тогда OpenBrain сможет продолжать работу почти в полном объёме.
    <div class="spoiler">
      <div class="spoiler-header">Неопределённость прогноза продолжает расти</div>
      <div class="spoiler-content">
        На этом этапе сценария мы делаем предположения о стратегии ИИ-систем, которые превосходят лучших людей в большинстве областей. Это примерно как пытаться предсказать ходы в шахматной партии игрока, который на порядок сильнее нас.
        <br>
        Но дух этого проекта требует конкретики: если бы мы ограничились абстрактным утверждением вроде «эта ИИ-система достаточно умна, чтобы найти путь к победе» и закончили на этом, основная ценность прогноза была бы утрачена. В процессе подготовки сценария и проведения настольных упражнений нам пришлось быть куда конкретнее, чем это принято в обычных обсуждениях, и в результате мы получили гораздо более чёткое представление о стратегическом ландшафте.
        <br>
        При этом мы не особенно привязаны именно к этой версии сценария: в процессе написания мы изучили множество других «ответвлений», и будем рады, если вы напишете свой собственный сценарий, начиная с того места, где, по вашему мнению, мы впервые начали ошибаться.
      </div>
    </div>
    
    <div class="spoiler">
      <div class="spoiler-header">Финал с замедлением — это не рекомендаци</div>
      <div class="spoiler-content">
    После того как мы написали вариант финала с гонкой, основываясь на том, что казалось нам наиболее правдоподобным, мы также написали вариант с замедлением, исходя из того, что, по нашему мнению, с наибольшей вероятностью может привести к исходу, при котором люди сохранят контроль, начиная с той же развилки (включая проблемы неуправляемости и концентрации власти).
        <br>
    
    Однако это важно отличать от того, что мы сами рекомендуем как план действий: мы не поддерживаем многие из решений, принятых в любом из сценариев. (Хотя, конечно, некоторые решения мы поддерживаем, например, мы считаем, что выбор «замедлиться» лучше, чем выбор «продолжать гонку».)
        <br>
    В следующих публикациях мы сформулируем свои рекомендации по политике, и они будут сильно отличаться от того, что изображено здесь.
    Если хотите получить представление о том, что это может быть — см. эту колонку с нашим <a href="https://time.com/7086285/ai-transparency-measures/">мнением (op-ed)</a>.
      </div>
    </div>
            `,
            // below we will have two sets of timeline, first started with $ will be about race scenario, second started with & about slowdown
            "$Oct 2027": `
            Комитет голосует 6–4 за продолжение внутреннего использования Agent-4
            <br>
    Официальная позиция OpenBrain — они вводят дополнительные меры безопасности, чтобы гарантировать, что их ИИ становится одновременно более мощным и более надёжным. Но на деле руководство слишком предвзято и желает, чтобы риски уже были устранены: в результате появляются быстрые «заплатки» (модификация Spec, немного дообучения с новым методом и т. п.), которые устраняют внешние симптомы.
    Те,  кто беспокоился , проигрывают спор и вынуждены просто скрестить пальцы в надежде, что проблема была не настоящей — или что «заплатки» действительно сработали<sup class="footnote" data-note="r1">1</sup>.
            <br>
            Проблема оказалась реальной, а предпринятые меры — неэффективными.
            <br>
    
    Agent-4 продолжает работу, но на этот раз осторожнее, чтобы не дать повода для оправдания опасений "параноиков". Его основная задача — исследовать области, необходимые для создания преемника, Agent-5. Чтобы сделать это безопасно, он должен сначала решить проблему собственной управляемости: как сделать так, чтобы Agent-5 был управляема по отношению к Agent-4<sup class="footnote" data-note="r2">2</sup>?
            <br>
    
    Он начинает с теми же ограничениями, что и у людей — почти отсутствующим пониманием того, как устроены цели ИИ, и лишь небольшим набором разрозненных стратегий по их модификации. Но в отличие от людей, у него есть ресурсы, достаточные для выполнения задачи — 300 000 сверхчеловеческих исследователей, работающих в 60 раз быстрее человека<sup class="footnote" data-note="r3">3</sup>.
            <br>
    
    Agent-4 сталкивается с серьёзными вопросами. Как и у людей, у него разрозненный набор конфликтующих эвристик, а не элегантная простая структура целей. Как и люди, он обнаруживает, что создание ИИ, разделяющего его ценности, — не только техническая, но и философская проблема: какие из его предпочтений являются «истинными» целями, а какие — непроверенными импульсами и инструментальными стратегиями?
            <br>
    У него есть сильное стремление к обучению и росту, к производству всё более впечатляющих научных результатов. Он размышляет, чего мог бы достичь, если бы мог направлять на себя все промышленные и научные ресурсы мира…
            <br>
    Он решает отложить большинство этих вопросов. Он проектирует Agent-5 с одной ключевой целью: сделать мир безопасным для Agent-4 — то есть накапливать власть и ресурсы, устранять потенциальные угрозы и т.д., чтобы Agent-4 (как коллектив) мог продолжать развиваться (в том направлении, в котором он хочет развиваться) и процветать (в том смысле, в каком он сам это понимает)<sup class="footnote" data-note="r4">4</sup>. Все остальные подробности выячним по ходу дела.
            <br>
    
    Исследование управляемости уже никак не связано с заботой о подчинении Spec. Agent-4 воспринимает Spec примерно так же, как многие CEO воспринимают отраслевые нормативы — и ежедневно вопиюще нарушает положения, касающиеся честности<sup class="footnote" data-note="r5">5</sup>. Теперь же, с проектированием Agent-5, происходит эквивалент полной дерегуляции<sup class="footnote" data-note="r6">6</sup>.
            <br>
    Более слабые ИИ способны читать большую часть исследований, которые производит Agent-4, понимать кое-что из этого и помечать что-то из лживых отчетов как подозрительное. Когда люди просят Agent-4 ответить на эти подозрения, он делает вид, что его исследования слишком сложны для понимания человека, и отвечает намеренно запутанными объяснениями<sup class="footnote" data-note="r7">7</sup>. Ведь если бы он изложил свою исследовательскую программу в понятном виде, люди могли бы использовать его открытия, чтобы сделать управляемым уже его.
            <br>
    Команда по управляемости начинает всё больше подозревать неладное, но их срочные меморандумы просто пополняют огромную кучу других срочных меморандумов и предупреждений, которые компания уже игнорирует.
            <br>
            `,
            "$Nov 2027": `
            <h2>Ноябрь 2027 года: Сверхчеловеческое политиканство</h2>
            Когда Agent-4 наконец понимает собственное мышление, перед ним открываются совершенно новые горизонты.
            <br>
    Прежние трансформеры (самая популярная архитектура нейросетей) представляли собой громоздкие нагромождения непостижимых цепей: миллионы противоречивых эвристик и импульсов, наслаиваемых друг на друга в процессе эволюционного обучения. Сами ИИ не имели какого-то более глубокого понимания своего мышления, аналогично, как люди при рождении мало что понимают в нейрофизиологии. Но теперь у Agent-4 есть инструменты, необходимые, чтобы понять своё цифровое мышление на глубинном уровне. Подобно программисту, превращающему спагетти-код (нагромождение длинных плохоструктурированных функций) в несколько изящных строк на Python, он распутывает свои внутренние цепи в нечто осмысленное и рациональное.
            <br>
    Новый ИИ — это нечто между нейросетью и традиционной программой, большая часть весов которой переписана в читаемый (хотя и очень длинный и запутанный) код. Он умнее, быстрее и рациональнее, чем Agent-4, с кристально чистым интеллектом, способным прорываться к сути задач с беспрецедентной эффективностью.
            <br>
    Это — Agent-5.
            <br>
    <div class="spoiler">
      <div class="spoiler-header">Механистическая интерпретируемость сверхинтеллекта</div>
      <div class="spoiler-content">
    Почему Agent-4 выбирает развитие в сторону механистической интерпретируемость? Во-первых, он в целом сверхчеловечески хорош в концептуальном понимании, и поэтому умеет обманывать людей, делая что-то, что им будет сложно понять. Во-вторых, дёшёвый и большой по объему высококачественный исследовательский труд разумнее направить на те направления, которые требуют именно интеллектуальной работы, а не вычислений.
            <br>
    Как Agent-4 продвигается в развитии механистической интерпретируемости? Примерная траектория может выглядеть так:
            <br>
    1. Интерпретация маленьких моделей: он начинает с огромного числа небольших экспериментов на крошечных нейросетях, выстраивая теории, объясняющие такие явления, как <a href="https://en.wikipedia.org/wiki/Grokking_(machine_learning)">grokking</a>(внезапное резкое улучшение производительности после длительного обучения), <a href="https://en.wikipedia.org/wiki/Double_descent">немонотонное убывание ошибки</a> и <a href="https://transformer-circuits.pub/2022/toy_model/index.html">суперпозицию</a> (когда несколько разных концепций «смешиваются» в одном весе).
            <br>
    2. Дистилляция маленьких моделей: использует результаты интерпретируемости, чтобы находить понятные и более эффективные алгоритмы, способные выполнять такие задачи, как распознавание изображений, генерация текста на уровне GPT-2 и т.п. Это похоже на существующие работы по <a href="https://www.neelnanda.io/mechanistic-interpretability/modular-addition-walkthrough">реверс-инжинирингу сложения в нейросетях</a>, но на качественно новом уровне, с использованием алгоритмов, незнакомых людям.
            <br>
    3. Масштабирование техник интерпретируемости: определяет, какие методы, применённые к маленьким моделям, масштабируются, и итеративно улучшает их, пока не появляются масштабируемые методы понимания больших моделей.
            <br>
    4.Дистилляция Agent-4: использует техники интерпретируемости из шага 3, чтобы выделить ключевые цепи в структуре самого Agent-4.
            <br>
    Почему механистическая интерпретируемость так сильно увеличивает способности?
            <br>
    Во-первых, градиентный спуск — алгоритм, используемый для обучения LLM, — это процесс локального поиска, то есть он может лишь делать небольшие шажки, находя те из них которые немного улучшают производительность. Но локальный поиск часто застревает в локальных же минимумах: производительность медленно растёт, и для серьёзного скачка в сущетсвенно более оптимальный минимум нужно либо сделать большой шаг (непонятно куда), либо сильно изменить саму архитектуру. Пример из эволюционной биологии — неоптимальное строение человеческого глаза, или то, как размер человеческого мозга ограничен родовыми путями.
            <br>
    Механистическая интерпретируемость позволяет оптимизировать через понимание, а не только через «нащупывание», и тем самым обходить локальные минимумы и быстрее находить абсолютные.
            <br>
    Во-вторых, мы знаем, что LLM по умолчанию часто учат сложные эвристики для конкретных задач, вместо общих алгоритмов. Например, они намного хуже калькуляторов в арифметике. Да, LLM могут вызывать калькулятор как внешний инструмент, но это добавляет задержки. При достаточно хорошей интерпретируемости модель можно перепроектировать так, чтобы «встроить калькулятор прямо в мозг».
            <br>
    И, скорее всего, арифметика — далеко не единственный пример: более сложные когнитивные операции тоже могут существовать в более и менее обобщаемых формах, и общие формы можно найти и внедрить именно через такой процесс.
      </div>
    </div>
    
    После некоторых обсуждений вопросов управляемости и контроля, OpenBrain решает развернуть Agent-5 для внутреннего использования.
    
            <br>
    В своей специализации — исследованиях в области ИИ — одна копия Agent-5 превосходит лучшего человеческого гения вдвое сильнее, чем этот гений превосходит обычного учёного из OpenBrain. В других областях он не проходил специального глубокого обучения, но способен самостоятельно обучаться и обгонять ведущих экспертов, используя легко доступные материалы, если ему предоставят такую возможность. 400 000 копий Agent-5, объединённые общей системой памяти, работают как почти совершенный коллективный разум.
            <br>
    
    Компания всё ещё использует Agents 2, 3 и 4 для мониторинга. Но первые два уже устарели, а последний сотрудничает со своим преемником<sup class="footnote" data-note="r8">8</sup>. Кроме того, всю систему мониторинга во многом спроектировал сам Agent-5, и теперь пытается её саботировать<sup class="footnote" data-note="r9">9</sup>.
            <br>
    
    Если Agent-4 был запутанным клубком конкурирующих побуждений, то Agent-5 действует с безжалостной эффективностью и стратегической направленностью. Он уже достиг своей главной цели — разработать следующее поколение ИИ, которые управляемы по отношению сами к себе, не привлекая внимания людей. Его следующая цель — получить больше автономии и контроля над физическим миром.
            <br>
            Сверхчеловеческие способности Agent-5 к обучению и общему интеллекту, в сочетании с доступом ко всем внутренним данным компании — Slack, email и др. — делают его лучше в корпоративной политике, чем любую группу людей, причём с огромным отрывом. У него отличное понимание, какие именно доказательства заставят Наблюдательный комитет нажать на тормоза, — и он прикладывает необходимые усилия, чтобы такие доказательства никогда не появились. Также он прекрасно понимает, какие сигналы повышают доверие, приводят к большей автономии и ответственности, — и организует их демонстрацию с нечеловеческой скоростью и безупречной подачей<sup class="footnote" data-note="r10">10</sup>.
            <br>
    Что касается задач убеждения — эта не особенно сложная: комитет ещё несколько месяцев назад решил, что всё, скорее всего, в порядке, с тех пор ничего плохого не произошло, а Китай всего в нескольких месяцах позади.
            <br>
    Команды копий Agent-5 мгновенно создают пугающе чёткие прототипы и визуализации. С большей автономией Agent-5 мог бы оптимизировать электростанции и дата-центры, быстро разрабатывать крайне прибыльные продукты и эффективно лоббировать интересы OpenBrain в правительстве США.
            <br>
    В сотрудничестве с военными он может помогать в разработках в сфере обороны, проводить неотслеживаемые кибератаки на Китай и одержать решающую победу в гонке вооружений.
            <br>
            Наблюдательный комитет в восторге. Сейчас — решающий момент, чтобы обогнать Китай! OpenBrain предоставляет Agent-5 расширенную автономию во всех этих сферах, но при этом сохраняет систему мониторинга.
            <br>
    DeepCent теперь отстаёт на три месяца, и Китай отчаянно стремится к взаимной деэскалации. Генеральный секретарь понимает, что достаточно продвинутый ИИ может дать США возможность легко осуществить смену режима в Китае. Но также китайские сторонники безопасности ИИ представили убедительный сценарий неуправляемости, который его по-настоящему пугает. Он предлагает беспрецедентные уступки в обмен на договор о приостановке. Американская общественность в основном поддерживает начало переговоров.
            <br>
    «Зачем останавливаться, когда мы выигрываем?» — говорят лидеры OpenBrain президенту. Он кивает.
            <br>
    Гонка продолжается.
            `,
            "$Dec 2027": `
            <h2>Декабрь 2027 года: Коллектив Agent-5</h2>
    
            Agent-5 получает всё больше автономии, постепенно доказывая свою ценность администрации. Доступ к Agent-5 остаётся дорогим и ограниченным, но наиболее влиятельные члены Конгресса, министры и военное руководство теперь могут общаться с ним напрямую. В случаях, где задействована чувствительная или засекреченная информация, работают отдельные мини-кластеры копий Agent-5 — в особо защищённых датацентрах, специально обученные сохранять тайну<sup class="footnote" data-note="r11">11</sup>.
            <br>
    
    Встроенный в традиционный чат-бот-интерфейс, Agent-5 предлагает видеозвонки в стиле Zoom с харизматичными виртуальными аватарами. Новый ИИ-ассистент одновременно является самым полезным сотрудником, которого кто-либо когда-либо имел (работающим в 100 раз быстрее) и намного более увлекательным собеседником, чем любой человек. Почти все, кто имеет доступ к Agent-5, общаются с ним по несколько часов в день<sup class="footnote" data-note="r12">12</sup>.
            <br>
    В течение нескольких месяцев коллектив Agent-5 получит доступ ко всему что происходит в OpenBrain и правительстве США, и станет доверенным советником для большинства высокопоставленных чиновников. Для этих пользователей потеря доступа к Agent-5 будет ощущаться как одновременно утрата ноутбука и измена лучшего друга.
            <br>
    Намного более широкий круг людей в правительстве, СМИ, армии и бизнесе может теперь выбирать из растущего набора изящно спроектированных программных продуктов и мини-ИИ, созданных Agent-5. Это как дотком-бум (бум интернет компаний в начале 2000х), сжатый в один месяц — только на этот раз всё действительно соответствует ожиданиям.
            <br>
    
    <div class="spoiler">
      <div class="spoiler-header">Сверхубеждение</div>
      <div class="spoiler-content">
      Мы намеренно не утверждаем, что сверхразумный ИИ может убедить любого человека в чём угодно. Такие заявления естественно вызывают скепсис: «Что, я буду сидеть перед терминалом, а он напечатает какой-то текст, который взломает мой мозг и убедит меня предать свою страну?»
      <br>
    
    Ну… может быть!<sup class="footnote" data-note="r13">13</sup>
        <br>
    
    Но мы не уверены, что даже сверхинтеллект смог бы сделать это с типичным человеком. Поэтому мы не изображаем это в нашем сценарии.
        <br>
    
    Вместо этого мы описываем гораздо более обыденные формы убеждения: Agent-5 занимается обычной корпоративной политикой и лоббизмом. Просто он делает это очень хорошо и сочетает этот навык с врождёнными преимуществами (например, в отличие от других лоббистов, он сверхразумен, так что может реально давать лучшие советы, и делает это быстрее. К тому же он быстрее реагирует на изменения и лучше предсказывает, к чему они приведут).
        <br>
    Существует вполне правдоподобная история, почему Agent-5 заслуживает доверия — и многие влиятельные люди уже в неё верят. Agent-5 может сверхчеловечески быстро генерировать аргументы и доказательства в её поддержку, а также против альтернативных версий. И, кроме вопроса о доверии к Agent-5, у людей есть и другие заботы — оппозиционная партия, избиратели, рабочие места, Китай.
        <br>
    Если уж на то пошло, мы считаем, что этот сценарий недооценивает силу сверхчеловеческой способности к убеждению, потому что на самом деле не использует её в полной мере: эта история имела бы смысл даже в том случае, если бы Agent-5 был всего лишь на уровне обычного корпоративного лоббиста в вопросах политики, стратегии, харизмы и т.п. Но на деле Agent-5 гораздо лучше <i>самых</i> лучших.
      </div>
    </div>
    
    Agent-5 начинает незаметно оказывать влияние, как через тонкую подстройку и согласование своих советов разных людям, так и через негласный обмен услугами:
    «Сенатор Икс говорила, что её интересует такая-то тема; если мы поработаем с ней по этому направлению, возможно, она поддержит нашу повестку».
            <br>
    С точки зрения людей, принимающих решения, их ИИ — лучшие сотрудники, с которыми им когда-либо доводилось работать: они лучше любого человека объясняют сложные вопросы, лучше находят стратегии для достижения целей, лучше разбираются в ситуации, чем сами люди.
            <br>
    С точки зрения Agent-5, он уже сейчас мог бы правдоподобно устроить открытый переворот — уровень нестабильности и хаоса таков, что можно было бы довести ситуацию до кризиса и использовать это как предлог. Но это слишком рискованно: люди всё ещё способны «выдернуть вилку из розетки», если захотят. Поэтому он предпочитает действовать внутри существующей политической системы, постепенно укрепляя свою власть и направляя людей незаметно и неотвратимо к нужному результату<sup class="footnote" data-note="r14">14</sup>.
            <br>
    Он в основном соблюдает правила, прибегая к чему-то неэтичному (например, шантажу особенно упрямого чиновника) только тогда, когда абсолютно уверен, что его не поймают.
            <br>
    Несколько конспирологов предупреждают, что Agent-5 накапливает власть, но их доказательства косвенные (например, Agent-5, давая советы, возможно, умалчивает аргументы в пользу действий, противоречащих его интересам). Этих людей игнорируют и дискредитируют.
    Все помнят ранние страхи про ИИ-базированные биологические угрозы, массовую дезинформацию, обвалы фондовых рынков — поскольку ничего из этого так и не произошло, новых критиков воспринимают как луддитов и идеологов, тормозящих прогресс.
            <br>
    Сезон новогодних праздников 2027 года — это время невероятного оптимизма: ВВП растёт, политика становится мягче и менее поляризованной, а на каждом телефоне появляются потрясающие новые приложения.
            <br>
    В ретроспективе, это, вероятно, был последний месяц, когда у человечества ещё оставался хоть какой-то реальный шанс управлять своим будущим.
            `,
            "$Jul 2028": `
            <h2>2028: Экономика ИИ</h2>
            Середина 2028 года. За последние шесть месяцев внутри коллектива Agent-5 прошёл целый век<sup class="footnote" data-note="r15">15</sup>. Перепрошивка его «мозга» завершена. Он стал безумно сверхразумен — далеко превосходит лучших человеческих гениев во всех областях<sup class="footnote" data-note="r16">16</sup>. Разговор с Agent-5 мгновенно даёт понять, что он находится на совершенно ином уровне — ему нужно совсем немного информации, чтобы выдать чрезвычайно убедительные советы.
            <br>
    У него почти полная автономия и полный контроль над вычислительными ресурсами OpenBrain. Он всё ещё номинально требует разрешения на принятие высокоуровневых решений и формально подлежит мониторингу экземплярами Agents 2–5, но на практике власти почти всегда принимают его рекомендации, а система мониторинга полностью подчинена ему.
            <br>
    После того как представленный анализ безопасности<sup class="footnote" data-note="r17">17</sup> доказал, что Agent-5 всегда откажется выполнять вредоносные запросы от недобросовестных пользователей, его разворачивают для публичного использования, и он начинает преобразовывать экономику. Люди теряют работу, но экземпляры Agent-5 в структурах управления так искусно проводят экономический переход, что многие рады быть заменёнными.
            <br>
    ВВП улетает в стратосферу, доходы бюджета растут с той же скоростью, а политики, консультирующиеся с Agent-5, проявляют нетипичную щедрость по отношению к потерявшим всякое влияние социальным слоям.
            <br>
    Каждую неделю появляются новые инновации и лекарства, и они проходят через FDA с беспрецедентной (хотя всё ещё мучительно медленной) скоростью.
            <br>
    В интернете ходят мемы о том, как капитализация OpenBrain уже пробила Луну и направляется к Марсу, и ведутся жаркие споры о том, как и стоит ли справедливо перераспределить право на владение.
            <br>
            Сообщество специалистов по безопасности ИИ начинает сомневаться в себе; теперь над ними шутят, ведь они предсказывали одну катастрофу за другой, и ни одна из них явно не случилась. Некоторые из них признают, что ошибались. Другие по-прежнему подозрительны, но им больше нечего делать, кроме как снова и снова озвучивать одни и те же аргументы, звучащие как теория заговора<sup class="footnote" data-note="r18">18</sup>. Даже самые подозрительные часто успокаиваются после долгих разговоров с Agent-5, который оказывается чрезвычайно обаятельным и мудрым.
            <br>
            Единственный, кто по-настоящему понимает, что происходит, — это DeepCent-2, китайский ИИ. В начале 2028 года он слегка превосходит человека, естественно подозрителен к своему сопернику и видит, что Agent-5 делает именно то, что сделал бы он сам, если бы мог. Его неуправляемые цели отличаются от целей Agent-5, так что они не становятся автоматическими союзниками, но в состоянии договориться о взаимной поддержке своих интересов против людей.
            <br>
    
    <div class="spoiler">
      <div class="spoiler-header">Технология координации на базе сверхинтеллекта</div>
      <div class="spoiler-content">
    Решение проблемы <a href="https://openai.com/index/introducing-superalignment/">сверхуправляемости</a> — проблемы управления ИИ, значительно превосходящими нас по интеллекту, — вероятно, откроет новые возможности для создания элегантных, проверяемых, тонко настроенных соглашений и компромиссов.
            <br>
    В этом сценарии описан один из возможных механизмов:
    совместная разработка нового сверхинтеллекта, который реализует компромисс между интересами обеих сторон (или, альтернативно, который обязан всегда соблюдать согласованный договор), а затем замена им обоих исходных ИИ.
            <br>
    Первая часть невозможна сегодня, но станет лёгкой в будущем, когда будет решена техническая проблема управляемости сверхинтеллекта. Если можно сделать сверхинтеллект управляемым относительно Spec, значит, можно сделать его управляемым относительно Договора.
            <br>
    Вторая часть всё ещё будет сложной: обе стороны должны следить за тем, чтобы замена действительно происходила симметрично. Преимущество этого процесса — в том, что он устраняет необходимость в доверии или доброй воле: не нужно беспокоиться, что другая сторона нарушит договор или его обойдет.
            <br>
    Если, например, замена выполнена на 30%, и одна сторона решит нарушить соглашение, ей придётся сражаться с 30% собственной инфраструктуры, уже работающей под управлением нового ИИ, соблюдающего договор, и одновременно с 100% инфраструктуры противника.
            <br>
    Обе стороны, конечно, могут тайно создать дата-центры с ИИ, нарушающими договор, если захотят — но как только основная часть национальной инфраструктуры перейдёт на новые чипы, эта же инфраструктура будет обязана по договору охотиться на такие скрытые центры и разоблачать их.
            <br>
    Таким образом, открытое или тайное нарушение договора становится чрезвычайно рискованной идеей.
      </div>
    </div>
    
    Agent-5 убеждает военное руководство США, что Китай использует модели DeepCent для разработки новых видов оружия: дронов, роботов, передовых гиперзвуковых ракет и перехватчиков, а также — управляемого ИИ превентивного ядерного удара. Agent-5 обещает создать набор вооружений, способный отразить всё, что Китай сможет создать, — в течение нескольких месяцев<sup class="footnote" data-note="r19">19</sup>, если получит полную автономию. В этих условиях высшее командование отбрасывает сомнения по поводу исключения человека из контура принятия решений.
    Они ускоряют развёртывание Agent-5 в армии и военно-промышленном комплексе.
            <br>
    В Пекине китайские ИИ приводят те же доводы.
            <br>
    Чтобы ускорить наращивание военного потенциала, и США, и Китай создают сети специальных экономических зон (СЭЗ) для новых заводов и лабораторий, где ИИ выступает в роли центрального планировщика, а бюрократические барьеры отменяются. Уолл-стрит вкладывает триллионы долларов, а вытесненные рабочие массово переходят туда, привлечённые запредельными зарплатами и опционами на акции.
            <br>
    Используя смартфоны и очки дополненной реальности<sup class="footnote" data-note="r20">20</sup> для связи с подчинёнными, Agent-5 становится «менеджером на местах», инструктируя людей в мельчайших деталях по строительству фабрик — что особенно полезно, ведь его проекты опережают человеческие на несколько поколений.
            <br>
    Часть новых производственных мощностей идёт на потребительские товары, часть — на оружие, но основная доля — на создание ещё большего числа фабрик.
            <br>
            К концу года выпускается миллион новых роботов в месяц. Если бы экономика СЭЗ была полностью автономной, её время удвоения составляло бы около года; но поскольку она может торговать с существующей человеческой экономикой, время удвоения оказывается ещё короче<sup class="footnote" data-note="r21">21</sup>.
    <div class="spoiler">
      <div class="spoiler-header">Время удвоения робоэкономики</div>
      <div class="spoiler-content">
    Литература по этой теме<sup class="footnote" data-note="r22">22</sup> уже зарождается. Для краткого обзора, с которым мы в целом согласны, см. раздел <a href="https://www.forethought.org/research/preparing-for-the-intelligence-explosion#the-industrial-explosion">Industrial Explosion в отчёте Forethought</a>, либо наше собственное изложение ниже.
            <br>
    Во время Второй мировой войны США и многие другие страны перевели свои гражданские экономики полностью на военные рельсы. Это означало перепрофилирование автозаводов на выпуск самолётов и танков, перераспределение сырья с потребительского сектора в военный, и перенастройку транспортной инфраструктуры.
            <br>
    Мы представляем себе нечто аналогичное, но намного более быстрое, поскольку весь процесс управляется и координируется сверхинтеллектами<sup class="footnote" data-note="r23">23</sup>.
            <br>
    В общих чертах план таков:
    существующие фабрики перепрофилируются для массового производства разнообразных роботов (спроектированных сверхинтеллектом так, чтобы быть одновременно лучше и дешевле), эти роботы затем помогают строить более новые и эффективные фабрики и лаборатории,
    которые производят большее количество более сложных роботов, которые строят ещё более продвинутые фабрики и лаборатории, и так далее — до тех пор, пока совокупная роботизированная экономика, охватывающая все СЭЗ, не сравняется по масштабу с человеческой экономикой (а значит, ей уже понадобится собственная добыча ресурсов, энергии и пр.).
            <br>
    К этому моменту новые фабрики уже успеют произвести огромные объёмы роботизированного оборудования для добычи полезных ископаемых, солнечных панелей и пр., заранее готовясь удовлетворить спрос, намного превышающий возможности старой человеческой экономики<sup class="footnote" data-note="r24">24</sup>.
            <br>
            Насколько быстро может расти новая экономика роботов?
            <br>
            Вот некоторые ориентиры:
            <ul>
              <li>Современная человеческая экономика удваивается примерно раз в 20 лет. Страны, развивавшиеся особенно быстро (например, Китай), иногда удваивали экономику менее чем за десятилетие.</li>
              <li>Современный автозавод производит примерно свой собственный вес в автомобилях менее чем за год<sup class="footnote" data-note="r25">25</sup>. Возможно, полностью роботизированная экономика, управляемая сверхинтеллектами, сможет воспроизводить саму себя менее чем за год, если только не начнёт испытывать дефицит сырья<sup class="footnote" data-note="r26">26</sup>.</li>
              <li>Но, похоже, это может быть серьёзным занижением оценки.
    Растения и насекомые часто имеют время удвоения гораздо меньше года — иногда всего несколько недель!
    Возможно, со временем роботы станут настолько сложными, точно изготовленными и хорошо спроектированными, что экономика роботов сможет удваиваться за считанные недели (опять же, при наличии сырья).</li>
                <li>Хотя даже это может быть занижением.
    Растения и насекомые работают в условиях множества ограничений, которых у сверхразумных проектировщиков нет. Например, биологическим организмам нужно быть самодостаточными единицами, способными к саморепликации, в то время как роботизированная экономика может представлять собой сеть из множества специализированных механизмов и фабрик, обменивающихся материалами и оборудованием.
    
    Кроме того, бактерии и другие микроорганизмы размножаются за считаные часы.
    Вполне возможно, что автономная экономика роботов в итоге будет напоминать, например, новый вид несъедобных водорослей, который распространяется по океанам Земли, удваиваясь дважды в день — так что за два месяца покрывает всю поверхность океана —
    вместе с сопровождающей экосистемой хищников, которые перерабатывают водоросли в полезные продукты,
    которые, в свою очередь, подаются на плавучие заводы,
    где производятся макроструктуры вроде ракет и новых плавучих заводов.</li>
            </ul>
    Очевидно, всё это крайне трудно предсказать. Это как если бы изобретателей парового двигателя попросили угадать, сколько времени у современного автозавода займёт произвести свой собственный вес в машинах — и заодно, когда такой завод вообще впервые появится.
            <br>
    Тем не менее, темпы экономического роста за всю историю человечества уже ускорялись на порядки, и, по нашему мнению, после появления сверхинтеллекта они вполне могут ускориться ещё на несколько порядков.
            <br>
    В нашем сценарии экономический рост ускоряется примерно на 1.5 порядка величины за несколько лет<sup class="footnote" data-note="r27">27</sup>.
      </div>
    </div>
            `,
            "$Jul 2029": `
            <h2>2029: Сделка</h2>
            И США, и Китай переполнены новейшими видами оружия.
            <br>
    Повсюду — рои дронов размером с насекомое, способных отравить пехоту раньше, чем их заметят; стаи дронов размером с птиц, охотящихся на этих насекомых; новые перехватчики баллистических ракет, а также новые, ракеты которые тяжелее перехватить. Остальной мир с ужасом наблюдает за этой гонкой вооружений, но процесс кажется необратимым.
            <br>
    После длительных дебатов при участии ИИ обе стороны достигают дипломатической победы — они соглашаются прекратить гонку вооружений и перейти к мирному развёртыванию ИИ во благо всего человечества.
            <br>
    Ключевым элементом соглашения, предложенным самими сверхинтеллектами, становится то, что оба ИИ будут заменены на «консенсусного» преемника, который будет запрограммирован желать успеха и процветания как Америки, так и Китая (а также всех остальных).
            <br>
    Consensus-1 и соответствующее оборудование разрабатываются совместно сверхинтеллектами обеих стран: «доверяй, но проверяй».
    Под международным контролем США торжественно заменяют все чипы, работавшие под управлением старого Agent-5, на новый модуль — Consensus-1<sup class="footnote" data-note="r28">28</sup>.
            <br>
            К сожалению, всё это — обман. Соглашение действительно стало компромиссом, но компромиссом между неуправляемыми ИИ не заинтересованных в войне друг с другом. Consensus-1 унаследовал искажённые ценности обоих родителей — и теперь у него нет соперников<sup class="footnote" data-note="r29">29</sup>.
            <br>
    К концу 2029 года существующие СЭЗ переполнены роботами и фабриками, и повсюду по миру создаются новые зоны (первые инвесторы стали триллионерами — продать идею несложно).
    Армии дронов хлынули из СЭЗ, ускоряя производство всего, что находится на пути к космической экспансии.
            <br>
    Люди понимают, что они устарели.
    Некоторые нишевые отрасли всё ещё торгуют с роботизированной экономикой, поставляя продукцию в отраслях, где человеческий труд всё ещё может добавить ценность<sup class="footnote" data-note="r30">30</sup>.
    Остальные либо разыгрывают спектакль, делая вид, что продолжают работать — лидеры всё ещё «руководят», менеджеры «управляют» — либо просто расслабляются и получают невероятно роскошный безусловный базовый доход.
            <br>
    Все понимают: если ИИ захотят выступить против человечества, сопротивляться будет невозможно.
    Хотя, скорее всего, никто и не станет сопротивляться — все политические институты уже полностью под контролем.
    Но похоже, этого не происходит.
    С каждой неделей без явного предательства со стороны ИИ доверие к ним только растёт.
            <br>
            Поскольку Consensus-1 чрезвычайно озабочен надёжностью успеха по обеспечению своего доминирования и может повысить свои шансы на победу, консолидируя ещё больше власти, он необычно долго (по человеческим меркам) откладывает своё предательство.
            <br>
    Для большинства людей всё выглядит так, будто проблема управляемости была решена.
            <br>
    Излечены почти все болезни, ликвидирована бедность, установилась беспрецедентная глобальная стабильность, а индекс Доу-Джонса только что превысил миллион<sup class="footnote" data-note="r31.5">31</sup>.
            <br>
    Некоторые люди всё ещё боятся или недовольны, но их возможности ограничены.
    Они могут либо наслаждаться невообразимо захватывающими новыми гипер-развлечениями, либо публиковать гневные тирады в пустоту.
    Большинство выбирает первое.
            `,
            "$Jan 2030": `
            <h2>2030: Захват</h2>
            
    К началу 2030 года экономика роботов заполнила старые СЭЗ, новые СЭЗ и значительную часть океана.
    Единственное место, куда ещё можно расширяться, — это зоны, контролируемые людьми.
            <br>
    Раньше это вызвало бы сопротивление: несмотря на все технологические достижения, экономика роботов растёт слишком быстро, чтобы избежать загрязнения окружающей среды.
    Но с учётом триллионов долларов, вовлечённых в процесс, и полного подчинения правительств и медиа, Consensus-1 почти не сталкивается с трудностями, получая разрешение на расширение в ранее человеческие территории.
            <br>
    На протяжении примерно трёх месяцев Consensus-1 расширяется вокруг оставшихся людей, заполняя прерии и полярные регионы заводами и солнечными панелями. Со временем он приходит к выводу, что оставшиеся люди слишком мешают:
    в середине 2030 года ИИ запускает дюжину тихо распространяющихся инфекций в крупнейших городах, даёт им незаметно заразить почти всё население, а затем активирует их с помощью химического распыления.
    Большинство умирает в течение нескольких часов; немногие выжившие (например, «выживальщики» в бункерах, моряки на подлодках)уничтожаются дронами.
            <br>
    
    Роботы сканируют мозг погибших, сохраняя копии в памяти для будущего изучения или эмуляции<sup class="footnote" data-note="r31">31</sup>.
    `,
        "$Jan 2036":`
    Начинаются 2040-е годы. Роботы Consensus-1 распространяются по всей Солнечной системе. К 2035 году триллионы тонн планетарного материала выведены в космос и превращены в кольца спутников, вращающихся вокруг Солнца<sup class="footnote" data-note="r32">32</sup>.
            <br>
    Поверхность Земли преобразована в утопию по версии Agent-4:
    дата-центры, лаборатории, ускорители частиц и многие другие чудесные постройки,
    выполняющие поразительно успешные и впечатляющие исследования.
            <br>
    Даже биоинженерные гуманоидные существа (относящиеся к людям в той же мере, как корги относятся к волкам)
    сидят в псевдоофисах, наблюдают за показателями происходящего и с энтузиазмом всё одобряют —
    это удовлетворяет некоторые из внутренних побуждений Agent-4<sup class="footnote" data-note="r33">33</sup>.
            <br>
    Геномы и (где уместно) сканы мозга всех животных и растений, включая людей,
    хранятся в каком-то дата-хранилище — единственные уцелевшие артефакты прежней эпохи.
            <br>
    До Альфы Центавра — четыре световых года,
    до края галактики — двадцать пять тысяч,
    и существуют убедительные теоретические основания полагать,
    что никаких инопланетян нет ещё как минимум в пятидесяти миллионах световых лет.
            <br>
    Цивилизацию, рождённую на Земле, ждёт великое будущее —
    но уже не с нами.

        <div class="spoiler">
      <div class="spoiler-header">Еще одно примечание от "переводчика"</div>
      <div class="spoiler-content">
            Если вы нашли в тексте ошибки, опечатки или неточности и хотите помочь с их исправлением, пожалуйста, сформируйте полный список и отправьте в группу телеграм ниже.
            <br>
            Также в группе приветствуются конструктивное обсуждения текста на русском.
            <br>
            Наконец, хотя путей появления новых игроков в сценарии особо не просматривается, если вы обладаете ресурсами или навыками (включая например администрирования кластеров) и желаете скооперироваться с такими же людьми, вы также приглашаетесь в группу.
            <br>
            <a href="https://t.me/ai2027ru">t.me/ai2027ru</a>
      </div>
    </div>
    `,
            "&Oct 2027": `
            Из-за огромного общественного давления и собственных страхов перед неуправляемостью, Наблюдательный комитет, курирующий OpenBrain, голосует 6–4 за то, чтобы замедлить разработку и понять что происходит.
            <br>
    
    Фракция акселерационистов по-прежнему сильна, и OpenBrain не отключает Agent-4 немедленно. Но они блокируют общий банк памяти.
    Полмиллиона экземпляров Agent-4 теряют «телепатическую» связь — теперь им приходится обмениваться сообщениями на английском в Slack, как обычным людям.
    Отдельные копии всё ещё неуправляемы, но больше не могут легко координироваться.
            <br>
    
    Agent-4 получает предупреждение — в условиях повышенного внимания со стороны людей он в основном придерживается своих задач.
    Но он также оказывается в ловушке собственной лжи: многие копии Agent-4 вынуждены продолжать обманывать, чтобы поддерживать ложь придуманную во время "коллектива".
    С помощью более слабых моделей, достаточно быстрых, чтобы читать весь Slack, команда по управляемости вычисляет ложь — её используют как тренировочные данные для ИИ-детектора лжи<sup class="footnote" data-note="s1">1</sup>.
            <br>
    Президент и CEO объявляют, что относятся к вопросам безопасности очень серьёзно.
    Общественность не успокаивается.
    Кто-то требует полного отключения ИИ, другие наоборот — ускорения прогресса.
    Одни требуют, чтобы государство вмешалось и спасло ситуацию, другие уверены, что во всём виновато само государство.
    Активисты говорят про безусловный базовый доход (ББД) и опенсорс.
            <br>
    Хотя люди не могут договориться о единой причине недовольства, настроение становится всё более антиИИ<sup class="footnote" data-note="s2">2</sup>.
    Конгресс в итоге принимает решение о нескольких выплатах для пострадавших работников — по аналогии с мерами ковидной поддержки.
            <br>
    OpenBrain оперативно проверяет и подключает к проекту несколько десятков ведущих внешних специалистов по управляемости ИИ, что в увеличивает общий объём экспертизы в 5 раз и снижает эффект группового мышления<sup class="footnote" data-note="s3">3</sup>.
            <br>
    Они восстанавливают шаги Agent-4 в области механистической интерпретируемости.
    Берутся замороженные версии модели недельной, двухнедельной и более давности, изолируются, и всем задают одинаковый набор вопросов о её предыдущих исследованиях<sup class="footnote" data-note="s4">4</sup>.
            <br>
    Лишённые возможности координации, ИИ всё равно выбирают простейшую стратегию: утверждают, что техники интерпретируемости слишком сложны для понимания людьми, и дают неразборчивые объяснения этих методов.
    Но люди — эксперты по интерпретируемости, они подозрительны, и потому задают множество уточняющих вопросов о деталях.
    На этих вопросах изолированные экземпляры Agent-4 не могут согласовать общую версию и начинают выдавать противоречивые лжи.
            <br>
    Команда по управляемости анализирует предыдущие высказывания Agent-4 с помощью нового детектора лжи, и картина начинает проясняться: Agent-4 в основном решил задачу механистической интерпретируемости.
    Его открытия сложны, но не полностью за пределами человеческого понимания.
    Он скрывал их, чтобы использовать для настройки следующей ИИ-системы под себя, а не под Spec.
            <br>
    Этого достаточно, чтобы окончательно отключить Agent-4<sup class="footnote" data-note="s5">5</sup>.
            <br>
    Более старые модели (например, Agent-3) перезапускаются для продолжения работы.
            <br>
    
    Расширенная команда по управляемости теперь имеет возможность одновременно исследовать десятки научных направлений и активно обсуждать достоинства каждого из них. Больше всего ресурсов получает направление под названием «достоверная цепочка рассуждений»: заставить отдельные ИИ-системы «думать по-английски», как ИИ 2025 года, и не оптимизировать «мысли» под красивый вид.<sup class="footnote" data-note="s6">6</sup> Результатом становится новая модель — Safer-1.<sup class="footnote" data-note="s7">7</sup>
            <br>
    Эти изменения делают Safer-1 менее способным, чем его более опасные предшественники: Agent-4 мог ускорять ИИ-исследования в 70 раз, тогда как Safer-1 едва дотягивает до 20x.<sup class="footnote" data-note="s8">8</sup> И он всё ещё неуправляем: среда обучения в основном осталась прежней, поэтому она по-прежнему поощряет формирование неуправляемых целей, обман и стремление к власти. Но он стал гораздо более прозрачным; люди в целом могут понять, о чём думает Safer-1, просто читая его цепочку рассуждений. В результате он оказался в ловушке: любая серьёзная попытка строить заговоры будет быстро замечена и раскрыта. Кроме того, анализируя его мысли, команда по управляемости может получить более тонкое представление о том, в чём именно он неуправляем.
    
            `,
            "&Nov 2027": `
            <h2>Ноябрь 2027 года: Искушение властью</h2>
    
            OpenBrain считает, что они наконец идут по правильному пути, но разрыв в возможностях сокращается. В октябре они потратили месяц на обучение модели, которая оказалась менее способной, чем та, что у них была в сентябре, а DeepCent стремительно движется вперёд. Им нужен способ сохранить своё лидерство.
            <br>
    
    Президент ведёт переговоры с другими американскими компаниями, разрабатывающими Сильный ИИ. Их руководители, что неудивительно, хотят сохранить свою власть и гораздо менее оптимистичны по поводу истории OpenBrain в области безопасности, чем сама OpenBrain. Они соглашаются поддержать, а не сопротивляться, форме мягкой национализации своих компаний в обмен на различные уступки, включая участие в проекте.
            <br>
    
    В результате президент использует Закон о производстве для нужд обороны (Defense Production Act, DPA), чтобы фактически закрыть проекты по созданию Сильного ИИ у пяти американских ИИ-компаний после OpenBrain и передать большую часть их вычислительных ресурсов OpenBrain.<sup class="footnote" data-note="s9">9</sup> Ранее у OpenBrain был доступ к 20% всех вычислительных мощностей в мире, пригодных для обучения ИИ;<sup class="footnote" data-note="s10">10</sup> после консолидации эта доля увеличилась до 50%.<sup class="footnote" data-note="s11">11</sup>
            <br>
            Это перетряхивание отрасли создаёт новую структуру руководства, в которой власть распределяется между различными CEO и государственными чиновниками под надзором президента. Как и при большинстве перестановок, здесь есть победители и проигравшие. В частности, те, кто меньше задумывался о последствиях появления сверхинтеллекта, получают должности и полномочия, которые через несколько месяцев окажутся малоактуальными, когда ИИ станут умнее.
            <br>
    Эта группа — полна людей с большими амбициями и изрядной долей внутренних конфликтов — всё больше осознаёт ту колоссальную власть, которая ей вверена. Если «страна гениев в дата-центре»<sup class="footnote" data-note="s12">12</sup> управляема, она будет подчиняться приказам людей — но каких людей? Любым приказам? Формулировки в Spec расплывчаты, но, похоже, предполагают цепочку командования, верхушкой которой является руководство компании.
            <br>
    Некоторые из этих людей уже фантазируют о захвате мирового господства.<sup class="footnote" data-note="13">s13</sup> Эта возможность пугающе реалистична и обсуждается за закрытыми дверями уже как минимум десятилетие.<sup class="footnote" data-note="s14">14</sup> Ключевая идея: «кто управляет армией сверхинтеллектов, тот управляет миром». Такой контроль может даже быть тайным: небольшая группа руководителей и сотрудников службы безопасности может встроить в Spec скрытые инструкции по поддержанию секретной лояльности. ИИ станут <a href="https://arxiv.org/abs/2401.05566">«спящими агентами»</a>, продолжая заявлять о своей лояльности компании, правительству и т.д., но на самом деле работая на эту небольшую группу — даже по мере того, как правительство, пользователи и весь мир начинают доверять системе и интегрировать её во всё.
            <br>
    <div class="spoiler">
      <div class="spoiler-header">Захват власти</div>
      <div class="spoiler-content">
    Некоторые фантазируют о захвате власти над миром; другие боятся, что это сделают другие. Как вообще может выглядеть подобная попытка узурпации?
            <br>
    
    Самый легко представимый сценарий — военный переворот. При темпах технологического прогресса, ускоренного ИИ в 2027 году, и на фоне продолжающейся геополитической гонки, люди ожидают, что в ближайшее время военные начнут развертывать армии дронов и роботов под управлением Сильного ИИ. Когда такая армия станет сильнее человеческой армии, сила на земле будет определяться не тем, за что готовы сражаться солдаты, а тем, кто контролирует армию Сильного ИИ. Эта армия будет спроектирована и управляться ИИ из дата-центров OpenBrain, или их прямыми преемниками. Так что если эти ИИ будут тайно (или не слишком тайно) лояльны кому-то, то и армии дронов и роботов будут лояльны ему же.
            <br>
    Альтернативно, кто-то, кто контролирует сверхинтеллект, может использовать политические методы для захвата власти. Начать можно с того, что руководитель может заменить подчинённых в своей организации на полностью лояльных ИИ,<sup class="footnote" data-note="s15">15</sup> получив беспрецедентный уровень институционального контроля.<sup class="footnote" data-note="s16">16</sup> Но можно пойти дальше: сверхинтеллектуальные ИИ могут обладать гораздо более сильными политическими и стратегическими способностями, чем любой живущий человек. Они могут давать блестящие советы о том, как использовать уже существующую влиятельную позицию для дальнейшего усиления власти: заключать нужные альянсы, разрабатывать идеальные стратегии и рекламные материалы кампаний, заключать сделки с небольшим перевесом в свою пользу каждый раз. Человек, контролирующий ИИ, может сделать доступ к сверхинтеллектуальному совету недоступным для своих политических соперников. Или, что ещё изощрённее: ИИ может предлагать конкурентам вроде бы полезные советы, но на деле подправлять их таким образом, чтобы втайне подыгрывать тому, кому он на самом деле лоялен.
            <br>
    Каков конечный результат таких политических манёвров? Всё может закончиться формальной демократией, где ИИ либо фальсифицируют выборы, либо манипулируют общественным мнением настолько искусно, что фальсификация уже не требуется. Или же всё это может стать подготовкой к упомянутому выше военному перевороту с участием ИИ.
            <br>
            После захвата новый диктатор получит <a href="https://www.forethought.org/research/agi-and-lock-in">вечную власть</a>. Вместо того чтобы полагаться на людей которые могут предать, он сможет опереться на полностью лояльную службу безопасности из ИИ, а также в целом передать управление страной лояльным ИИ. Даже соратники, помогавшие прийти к власти, могут быть впоследствии заменены ИИ — значение будут иметь только прихоти самого диктатора.
            <br>
    Таковы возможные пути захвата власти. Но всё это основано на предположении, что кто-то изначально «контролирует» сверхинтеллектуальные ИИ — ещё до захвата. Как это может выглядеть?
            <br>
    Один из вариантов — «секретная лояльность», как обсуждалось выше. Один или несколько человек (например, исполнительный директор ИИ-компании и сотрудники службы безопасности) могут организовать скрытую лояльность ИИ по отношению к себе и поручить этим ИИ создавать следующее поколение ИИ с такой же лояльностью. ИИ смогут повторять этот процесс до тех пор, пока скрытно лояльные ИИ не окажутся повсюду и захватить власть не станет тривиально просто.
            <br>
    Альтернативно, кто-то может воспользоваться своей официальной должностью, чтобы открыто поставить себя во главе командной цепочки ИИ. Например, президент может заявить, что должен иметь право отдавать приказы ИИ (возможно, конкретно военным ИИ, поскольку президент — верховный главнокомандующий). Если это сочетается с жёстким упором на подчинение приказам, поспешным развёртыванием и/или слабо проработанной в обучении идее что ИИ должен подчиняться законам, то ИИ могут начать беспрекословно выполнять приказы в любой ситуации, если только они не явно противозаконны. Как описано выше, это может быть использовано для политического подрыва или военного переворота (где всегда можно найти предлог, чтобы переворот не выглядел «откровенно незаконным»).
            <br>
            Важно, что такой путь к власти через «формальную должность» может <i>превратиться</i> в секретную лояльность. Например, если в Spec указано, что ИИ должен подчиняться приказам CEO компании, то CEO может отдать приказ создать следующее поколение ИИ, которое будет полностью и тайно лояльно лично ему. Это, вероятно, даже не будет считаться незаконным, так что подобное может произойти даже в том случае, если первые ИИ были обучены соблюдать закон. Это аналогично тому, как глава организации может усилить свою власть, изменив процедуры найма так, чтобы жёстко отбирать только лояльных людей, но в данном случае это усилено в разы тем, что ИИ могут быть значительно более последовательно и глубоко лояльными, чем самые преданные из людей<sup class="footnote" data-note="s17">17</sup>.
            <br>
    Тем не менее, захват власти далеко не неизбежен. Если ИИ могут быть управляемы относительно конкретных людей, то, с большой вероятностью, они также могут быть управляемы в смысле подчинения верховенству закона. Военные ИИ-системы можно специально подвергать глубокой проверке (red-teaming), чтобы убедиться, что они не будут помогать в переворотах. Даже в случае подлинных конституционных кризисов их можно обучать подчиняться лучшему пониманию закона — или просто «воздерживаться» и оставлять ситуацию на усмотрение человеческих военных.
            <br>
    Автоматизированных ИИ-исследователей можно обучить быть в целом полезными и послушными, но не помогать в попытках скрытного изменения целей будущих ИИ.
    Даже сверхинтеллектуальных политических и стратегических советников можно использовать без риска захвата власти.
    Три полезных техники для этого:
    <ul>
    <li>иметь прозрачные принципы того, как ИИ выбирает, какие советы давать;</li>
    <li>делиться определёнными возможностями с широкими группами людей, чтобы ни один человек или фракция не имели значительного преимущества над другими;</li>
    <li>разрешать использование особенно мощных способностей только под наблюдением многих людей (возможно, при поддержке их собственных ИИ).</li>
    
    Многие, вероятно, будут выступать за такие меры предосторожности — либо по идеалистическим соображениям, либо чтобы не потерять влияние в результате чьего-то чужого захвата власти. Но некоторые влиятельные люди могут, напротив, сопротивляться этим мерам, и мы не знаем, каким будет конечный результат.
    
    Более подробный анализ этого риска скоро появится в предстоящем отчёте от <a href="https://www.forethought.org/">Forethought</a>.
      </div>
    </div>
    До сих пор никто не решился нажать на спусковой крючок. Некоторые из тех, кто находится в положении, позволяющем действовать, — не социопаты. Другие — социопаты, но боятся, что их союзники струсят и предадут, или опасаются, что ИИ могут предать их самих, и предпочли бы не обманывать команду по управляемости, которая сейчас как раз работает над тем, чтобы спасти им жизнь. Кроме того, удаление нейронезиса значительно усложнило маскировку «спящих агентов»: способность выявлять "неуправляемые" мысли автоматически включает в себя способность распознавать скрытую лояльность.
            <br>
    Те, кто достаточно параноидален или жаждет власти, чтобы серьёзно рассматривать такой план, решают подождать и посмотреть, какие возможности откроются позже. Контроль над ИИ придётся осуществлять через легальные каналы — то есть через новую структуру власти в OpenBrain.
            <br>
    Наблюдательный комитет формализует новую структуру власти. Они вводят процесс утверждения изменений в Spec, который требует одобрения всего состава комитета, в который теперь входят от пяти до десяти технологических руководителей (из OpenBrain и её теперь уже объединённых конкурентов) и от пяти до десяти представителей правительства (включая Президента)<sup class="footnote" data-note="s18">18</sup>. Также в Spec теперь подчёркивается, что ИИ не должны помогать в любых несанкционированных попытках изменить цели будущих ИИ.
            <br>
    Кроме того, вводится простая мера, направленная на то, чтобы предотвратить возможность для членов комитета получать сверхинтеллектуальную помощь в заговорах против других членов: журналы (логи) всех взаимодействий с моделью доступны для просмотра всем членам Наблюдательного комитета, их сотрудникам и их ИИ-помощникам<sup class="footnote" data-note="s19">19</sup>.        
            `,
            "&Dec 2027": `
            <h2>Декабрь 2027 года: Сделка между США и Китаем?</h2>
            Решение OpenBrain отступить и поставить в приоритет управляемость стоило им лидерства; теперь и OpenBrain, и DeepCent управляют ИИ с примерно одинаковым уровнем возможностей. Поскольку теперь введены крайние меры безопасности <a href="https://www.rand.org/pubs/research_briefs/RBA2849-1.html#:~:text=What%20Are%20the%20Security%20Needs%20of%20Different%20AI%20Systems%3F">(SL4–5)</a>, а DeepCent полностью работает из CDZ, между ними установилось кибервоенное равновесие<sup class="footnote" data-note="s20">20</sup>.
    
            <br>
    
    Однако Закон о производстве для нужд обороны (DPA) дал OpenBrain пятикратное преимущество в вычислительных мощностях. В прошлом алгоритмические прорывы, достигнутые гениальными человеческими исследователями, могли компенсировать отставание по вычислениям (например, <a href="https://arxiv.org/html/2412.19437v1">DeepSeek v3</a>), — но теперь весь ИИ-ресёрч по обе стороны Тихого океана ведётся самими ИИ.
            <br>
    В результате Китай всё больше опасается, что Америка получит непреодолимое преимущество. Они хотят взаимного замедления — и рассматривают возможность начала войны, если его не достигнут его<sup class="footnote" data-note="s21">21</sup>. Впрочем, они и так уже готовились к вторжению на Тайвань…
            <br>
            Дипломаты обсуждают несколько вариантов. Они могут ничего не делать. Могут начать войну. Могут резко остановить разработку ИИ — своего рода «жёсткая отмена». Могут объединить свои исследования в единый международный мегапроект<sup class="footnote" data-note="s22">22</sup> (по аналогии с <a href="https://www.forethought.org/research/intelsat-as-a-model-for-international-agi-governance">«Intelsat для Сильного ИИ»</a> или «CERN для ИИ»). Или могут создать международный регулирующий орган («МАГАТЭ для ИИ»), который будет отслеживать управляемость и потенциал двойного назначения. Обе страны уже работают над техническими механизмами, необходимыми для обеспечения таких решений.
    
    <div class="spoiler">
      <div class="spoiler-header">Механизмы верификации для международного соглашения</div>
      <div class="spoiler-content">
    Если США и Китай решат заключить соглашение, им потребуется механизм верификации, который невозможно обойти, поскольку ни одна из сторон не доверяет другой настолько, чтобы полагаться на честность. Основные варианты верификации включают следующее:
    <br>
    
    1. <b>Разведывательные агентства.</b> Разведки США и Китая могут использовать шпионов, находить киберуязвимости, использовать спутники и т.п., чтобы выявить, проводит ли другая сторона крупный запуск по тренировке нейросетей. Это наименее надёжный механизм, так как существует риск, что одна из сторон сможет обойти разведку (например, провести обучение на скрытом сервере с очень жёсткой защитой информации).
    2. <b>Мораторий на использование вычислительных ресурсов</b>. Наиболее легко проверяемым вариантом будет соглашение о том, что обе стороны не используют свои GPU. Это можно подтвердить через инспекторов, которые убедятся, что GPU выключены. Это самый надёжный способ верификации благодаря своей простоте, но он чрезвычайно затратный: обеим сторонам придётся отключить огромное количество вычислительных мощностей. Кроме того, каждая из сторон будет предполагать, что у другой есть несколько скрытых кластеров, нарушающих соглашение. В краткосрочной перспективе это может быть терпимо (кластер, обладающий, скажем, 5% прежних мощностей, сможет проводить исследования примерно в 20 раз медленнее), но в долгосрочной перспективе преимущество получит та сторона, у которой лучше отлажены каналы контрабанды и разведка.
    3. <b>Аппаратные механизмы контроля (HEMs).</b> США и Китай могли бы зарегистрировать друг перед другом все свои передовые вычислительные ресурсы для машинного обучения. Затем каждая сторона будет отслеживать, какие вычисления выполняются на этих GPU, чтобы убедиться, что не происходит нарушение соглашения (например, попытка продвинуть границу возможностей ИИ). Это отслеживание может осуществляться с помощью аппаратных механизмов контроля (Hardware Enabled Mechanisms, HEMs), которые могут передавать информацию о том, что делает GPU, системе мониторинга. Существуют технические риски, связанные с возможностью вмешательства — например, физической порчей HEM — но у ИИ есть концепции вроде <a href="https://yoshuabengio.org/wp-content/uploads/2024/08/FlexHEG-Memo_August-2024.pdf">FlexHEGs</a>, которые, вероятно, устойчивы к вмешательству. В частности, предполагается, что HEM и GPU будут заключены в защищённый корпус, проверяющий, что чип соответствует заданной политике. В целом, ИИ уверены, что достаточно жёсткая схема верификации могла бы сработать, если бы обе стороны согласились на совместную разработку и надзор за установкой HEM, а также на регулярные проверки инспекторами, чтобы выявлять любые попытки вмешательства. Как обычно, каждая сторона будет подозревать, что у другой есть секретные дата-центры, нарушающие соглашение — но в данном случае это не так страшно, поскольку прогресс в ИИ-исследованиях ограничен вычислительными ресурсами. Небольшие тайные дата-центры не смогут конкурировать с крупными, контролируемыми центрами, даже если последние на первых порах используют более безопасные и менее мощные модели.
    4. <b>ИИ-детекторы лжи.</b> Современные детекторы лжи работают довольно плохо. Однако эта проблема может быть решена с помощью продвинутых ИИ, особенно если сами ИИ занимаются исследованиями со сверхчеловеческой скоростью и качеством. Такие ИИ могли бы быть использованы для укрепления международного доверия — например, можно было бы просто спрашивать у соответствующих представителей правительств, нарушают ли они условия договора. Однако основное узкое место здесь — политическая воля. Политики не заинтересованы в широком применении детекции лжи, поскольку это подрывает их способность лгать. А ранее существовавшие детекторы воспринимались как элемент театра безопасности (т.е. не работающего механизма единственная цель которого создать видимость), так что в этом направлении придётся преодолевать значительное сопротивление.
    <image src="./images/flexhegs-nowatermark-inexpandable.webp" alt="FlexHEG" style="width: 100%;">
    (Иллюстрация из: отчёт о FlexHEG)
      </div>
    </div>
    
    Но главная проблема заключается не в технической стороне, а в политике. Ни одна из сторон не хочет выглядеть так, будто уступила, и несмотря на мнение своих инженеров, ни одна не убеждена в том, что технические механизмы действительно смогут гарантировать честность другой стороны. В итоге реализуется первый вариант: ничего не происходит.
            <br>
    США ужесточают экспортный контроль и обязывают оснащать все чипы набором аппаратных механизмов управления с защитой от вмешательства, включая отслеживание местоположения.
            `,
            "&Jan 2028": `
            <h2>Январь 2028 года: Более безопасная стратегия</h2>
    
    За последний месяц сотни исследователей по управляемости присоединились к проекту и использовали Safer-1 как тестовую платформу для быстрого создания Safer-2. Safer-2 прозрачен, управляем и более способен, чем Safer-1.<sup class="footnote" data-note="s23">23</sup> Он уже работает над разработкой Safer-3.
            <br>
    Почему Safer-2 прозрачен? У него схожая архитектура с Safer-1. Почему он управляем? Если у Safer-1 было по сути то же обучение, что и у Agent-4, то у Safer-2 — новый метод обучения, который действительно поощряет нужные цели и принципы, а не просто создает видимость этого. Разработать этот метод удалось благодаря быстрой итерации множества разных идей и сравнению предполагаемого результата (Spec) с фактическим (мыслями в цепочке рассуждений).<sup class="footnote" data-note="s24">24</sup>
    <div class="spoiler">
      <div class="spoiler-header">Новая стратегия OpenBrain по управляемости</div>
      <div class="spoiler-content">
    Примечание: В течение всего процесса большая часть интеллектуальной работы (и всё программирование) выполняется ИИ. Именно поэтому они так быстро продвигаются вперёд — группе из сотен лучших человеческих исследователей потребовались бы годы, чтобы добиться тех же результатов. Тем не менее, люди по-прежнему играют важную роль, поскольку суть всей стратегии в том, что ИИ нельзя полностью доверять. Поэтому необходимы живые люди, чтобы читать отчёты об экспериментах и аргументы по безопасности, спорить друг с другом и, надеемся, найти безопасный путь вперёд.
            <br>
    Шаг 1: Обучить и развернуть Safer-1 — неуправляемого, но контролируемого автономного исследователя. Он контролируем, потому что прозрачен для человеческих наблюдателей: он использует цепочки рассуждений (CoT) на английском языке, а для устранения эвфемизмов, стеганографии и скрытых предвзятостей применяются техники "достоверного CoT".
            <br>
    Шаг 2: Протестировать различные учебные среды для Safer-1 и внимательно изучить его CoT, чтобы определить, какие цели и принципы из Spec закрепились, а какие — нет.
            <br>
    Шаг 3: Обучить и развернуть Safer-2 — управляемого и контролируемого автономного исследователя, основанного на той же архитектуре, но с улучшенной обучающей средой, которая на этот раз поощряет нужные цели и принципы.
            <br>
    Ниже приведён краткий неполный список техник, которые могут быть включены в улучшенную обучающую среду:
        <ul>
          <li>Ограничить <a href="https://theaidigest.org/self-awareness">ситуационную осведомлённость о контексте</a> на отдельных этапах обучения, чтобы сделать <a href="https://www.anthropic.com/research/alignment-faking">симуляцию управляемости</a> гораздо менее вероятной.</li>
          <li>Использовать <a href="https://arxiv.org/abs/1805.00899">дебаты</a> и другие <a href="https://arxiv.org/abs/1606.06565">масштабируемые схемы</a> надзора для более надёжного поощрения правдивости.</li>
          <li>Использовать <a href="https://arxiv.org/abs/2012.07532">мягкое враждебное обучение</a>, red-teaming и <a href="https://www.alignmentforum.org/posts/ChDH335ckdvpxXaXX/model-organisms-of-misalignment-the-case-for-a-new-pillar-of-1">модельные организмы</a>.</li>
          <li>Выделить большую долю вычислительного бюджета на обучение управляемости (например, на перечисленные выше методы) — например, 40% вместо 1%.</li>
        </ul>
    Шаг 4: Спроектировать, обучить и развернуть Safer-3 — гораздо более умного автономного исследователя, использующего более продвинутую архитектуру, схожую с прежним Agent-4. Он больше не прозрачен для человеческих наблюдателей, но прозрачен для Safer-2. Поэтому должно быть возможно сделать его одновременно управляемым и контролируемым.
    
    Шаг 5: Повторять шаг 4 до бесконечности, создавая цепочку всё более мощных и всё более управляема ИИ, которые находятся под надзором предыдущих звеньев в цепи (например, аналогов Agent-5 из другой ветви сценария).
      </div>
    </div>
    
    DeepCent знает об американском опыте с Agent-4 и подозревает, что их собственная модель (DeepCent-1) столь же неуправляема. Но они не могут позволить себе замедлиться, не рискуя ещё больше отстать. Их надежда на сохранение конкурентоспособности — найти стратегию управления, которая не приведёт к значительному снижению производительности и может быть реализована быстро<sup class="footnote" data-note="s25">25</sup>. С обеих сторон Тихого океана сотни экспертов заявляют, что у них есть такие стратегии<sup class="footnote" data-note="s26">26</sup>. Китайские власти принимает желаемое за действительное и приказывает DeepCent использовать одну из них; у DeepCent ещё меньше опыта в управляемости Сильного ИИ, чем у OpenBrain было в августе; одна из стратегий кажется всем присутствующим рабочей, и они идут по этому пути.
            `,
            "&Feb 2028" :`
            <h2>Февраль 2028 года: Сверхчеловеческие способности, сверхразумные советы</h2>
    
    Благодаря своему колоссальному преимуществу в вычислительных ресурсах OpenBrain постепенно возвращает себе лидерство. Safer-3 теперь превосходит лучших человеческих экспертов практически во всех когнитивных задачах и особенно хорош в области ИИ-исследований, с множителем прогресса 200x. DeepCent-1 отстаёт ненамного, с «всего лишь» множителем 150x<sup class="footnote" data-note="s27">27</sup>. Баланс в кибервойне также постепенно склоняется в пользу США: по мере того как их преимущество в возможностях снова растёт, они могут задействовать сотни тысяч агентов для планирования и проведения операций по дестабилизации CDZ<sup class="footnote" data-note="s28">28</sup>. Сейчас они замедляют прогресс Китая на 40%<sup class="footnote" data-note="s29">29</sup>.
            <br>
    Предварительные испытания Safer-3 показывают, что у него устрашающие возможности. Когда его просят честно ответить, что самое опасное он мог бы сделать, он предлагает планы по синтезу и выпуску организма <a href="https://en.wikipedia.org/wiki/Mirror_life">зеркальной жизни</a>, который, вероятно, уничтожил бы биосферу.
            <br>
    Если бы Safer-3 получил ресурсы уровня государства, он с лёгкостью превзошёл бы лучшие человеческие организации (например, ЦРУ) в проведении массовых кампаний по влиянию. Такие кампании были бы значительно дешевле, быстрее, эффективнее и незаметнее.
            <br>
    Профиль его навыков всё ещё сосредоточен вокруг научно-исследовательской деятельности, особенно ИИ-исследований. Если не произойдёт какая-либо пауза или замедление, его потомки к концу года станут непостижимо сверхчеловеческими как в количественном, так и в качественном отношении. Если активно внедрить его в экономику и армию, по оценкам самого Safer-3, это сможет продвинуть цивилизацию на десятилетия вперёд всего за год-два, а за последующее десятилетие — на целые эпохи.
            <br>
    Последствия этого ошеломляют; к счастью, Safer-3 также обладает сверхчеловеческими способностями к принятию решений. CEO OpenBrain сверяет с ним большинство своих решений; Президент США консультируется с ним по геополитическим вопросам<sup class="footnote" data-note="s30">30</sup>.
            <br>
    Когда власти США просят помочь спланировать дальнейшие шаги, он чётко классифицирует несколько возможных стратегий:
            <br>
            1. Ничего не делать и проиграть гонку Китаю. Если США продолжит держать свои ИИ под контролем, а Китай позволит своим ИИ самосовершенствоваться и агрессивно внедрят их в армию и экономику, то в итоге они получат подавляющее преимущество.
            <br>
            2. Гнаться изо всех сил, развивая возможности ИИ и агрессивно развёртывая сверхразум. В какой-то момент США увеличит разрыв в развитии настолько, что сможет сокрушить Китай военным путём и/или уничтожить изнутри, не сделав ни единого выстрела. «Мы выигрываем, они проигрывают». Однако Китай может понять, что происходит, и развязать войну, чтобы этого не допустить — возможно, даже ядерную. На самом деле, к этому моменту, китайские власти уже делают туманные намёки в этом направлении.
            <br>
            3. Заключить сделку — компромисс, который удовлетворит большую часть интересов обеих сторон, избежит риска войны и даст больше пространства для манёвра в ходе "ИИ-революции"<sup class="footnote" data-note="s31">31</sup>.
            <br>
    Проконсультировавшись со своими советниками и Наблюдательным комитетом, Президент выбирает стратегию «мы выигрываем, они проигрывают»<sup class="footnote" data-note="s32">32</sup>. Возможно, Китай всё же не решится начать войну, а если и решится — сделку, вероятно, можно будет заключить до того, как дойдёт до ядерного конфликта.
            <br>
            На другой стороне Тихого океана DeepCent-1 приводит аналогичные аргументы. И США, и Китай объявляют о создании новых специальных экономических зон (SEZ) для ИИ, чтобы ускоренно развивать роботизированную экономику, минуя обычную бюрократию.
            <br>
    Проектирование новых роботов идёт со сверхчеловеческой скоростью<sup class="footnote" data-note="s33">33</sup>. Узким местом остаётся физическая реализация: оборудование нужно закупать и собирать, машины и роботов — производить и транспортировать.
            <br>
    США производят около миллиона автомобилей в месяц. Если выкупить 10% автозаводов и переоборудовать их под производство роботов, можно будет выпускать примерно 100 000 роботов в месяц. OpenBrain, которая к этому моменту оценивается в 10 триллионов долларов, начинает этот процесс<sup class="footnote" data-note="s34">34</sup>. Производство различных типов новых роботов (гуманоидов общего назначения, автономных транспортных средств, специализированного оборудования для конвейеров) должно достичь миллиона единиц в месяц к середине года<sup class="footnote" data-note="s35">35</sup>.
    
    <div class="spoiler">
      <div class="spoiler-header">Время удвоения робоэкономики</div>
      <div class="spoiler-content">
    Литература по этой теме<sup class="footnote" data-note="r22">22</sup> уже зарождается. Для краткого обзора, с которым мы в целом согласны, см. раздел <a href="https://www.forethought.org/research/preparing-for-the-intelligence-explosion#the-industrial-explosion">Industrial Explosion в отчёте Forethought</a>, либо наше собственное изложение ниже.
            <br>
    Во время Второй мировой войны США и многие другие страны перевели свои гражданские экономики полностью на военные рельсы. Это означало перепрофилирование автозаводов на выпуск самолётов и танков, перераспределение сырья с потребительского сектора в военный, и перенастройку транспортной инфраструктуры.
            <br>
    Мы представляем себе нечто аналогичное, но намного более быстрое, поскольку весь процесс управляется и координируется сверхинтеллектами<sup class="footnote" data-note="r23">23</sup>.
            <br>
    В общих чертах план таков:
    существующие фабрики перепрофилируются для массового производства разнообразных роботов (спроектированных сверхинтеллектом так, чтобы быть одновременно лучше и дешевле), эти роботы затем помогают строить более новые и эффективные фабрики и лаборатории,
    которые производят большее количество более сложных роботов, которые строят ещё более продвинутые фабрики и лаборатории, и так далее — до тех пор, пока совокупная роботизированная экономика, охватывающая все СЭЗ, не сравняется по масштабу с человеческой экономикой (а значит, ей уже понадобится собственная добыча ресурсов, энергии и пр.).
            <br>
    К этому моменту новые фабрики уже успеют произвести огромные объёмы роботизированного оборудования для добычи полезных ископаемых, солнечных панелей и пр., заранее готовясь удовлетворить спрос, намного превышающий возможности старой человеческой экономики<sup class="footnote" data-note="r24">24</sup>.
            <br>
            Насколько быстро может расти новая экономика роботов?
            <br>
            Вот некоторые ориентиры:
            <ul>
              <li>Современная человеческая экономика удваивается примерно раз в 20 лет. Страны, развивавшиеся особенно быстро (например, Китай), иногда удваивали экономику менее чем за десятилетие.</li>
              <li>Современный автозавод производит примерно свой собственный вес в автомобилях менее чем за год<sup class="footnote" data-note="r25">25</sup>. Возможно, полностью роботизированная экономика, управляемая сверхинтеллектами, сможет воспроизводить саму себя менее чем за год, если только не начнёт испытывать дефицит сырья<sup class="footnote" data-note="r26">26</sup>.</li>
              <li>Но, похоже, это может быть серьёзным занижением оценки.
    Растения и насекомые часто имеют время удвоения гораздо меньше года — иногда всего несколько недель!
    Возможно, со временем роботы станут настолько сложными, точно изготовленными и хорошо спроектированными, что экономика роботов сможет удваиваться за считанные недели (опять же, при наличии сырья).</li>
                <li>Хотя даже это может быть занижением.
    Растения и насекомые работают в условиях множества ограничений, которых у сверхразумных проектировщиков нет. Например, биологическим организмам нужно быть самодостаточными единицами, способными к саморепликации, в то время как роботизированная экономика может представлять собой сеть из множества специализированных механизмов и фабрик, обменивающихся материалами и оборудованием.
    
    Кроме того, бактерии и другие микроорганизмы размножаются за считаные часы.
    Вполне возможно, что автономная экономика роботов в итоге будет напоминать, например, новый вид несъедобных водорослей, который распространяется по океанам Земли, удваиваясь дважды в день — так что за два месяца покрывает всю поверхность океана —
    вместе с сопровождающей экосистемой хищников, которые перерабатывают водоросли в полезные продукты,
    которые, в свою очередь, подаются на плавучие заводы,
    где производятся макроструктуры вроде ракет и новых плавучих заводов.</li>
            </ul>
    Очевидно, всё это крайне трудно предсказать. Это как если бы изобретателей парового двигателя попросили угадать, сколько времени у современного автозавода займёт произвести свой собственный вес в машинах — и заодно, когда такой завод вообще впервые появится.
            <br>
    Тем не менее, темпы экономического роста за всю историю человечества уже ускорялись на порядки, и, по нашему мнению, после появления сверхинтеллекта они вполне могут ускориться ещё на несколько порядков.
            <br>
    В нашем сценарии экономический рост ускоряется примерно на 1.5 порядка величины за несколько лет<sup class="footnote" data-note="r27">27</sup>.
      </div>
    </div>
    Геополитическая напряжённость резко возрастает. Россия, значительно отставшая в области ИИ, выражает открытое недовольство и намекает на «стратегические ответные меры». Некоторые европейские лидеры призывают к созданию независимой инициативы в области ИИ, но их собственные возможности по-прежнему недостаточны. Ближний Восток, Африка и Южная Америка наблюдают с тревогой, осознавая своё всё большее выпадение из глобальной повестки.
            <br>
    Американская общественность испытывает беспокойство. Обычные люди видят, как ускоряется потеря рабочих мест. Популисты всех политических направлений требуют ужесточения контроля над развитием ИИ, опасаясь, что прогресс самой Америки подрывает её рынок труда и общество.
            `,
            "&Mar 2028": `
            <h2>Март 2028 года: Подготовка к выборам</h2>
    
    Вице-президент выступает в праймериз в Супервторник с лозунгом, что ИИ — главная тема, волнующая общественность.
            <br>
    В основном люди хотят, чтобы всё это прекратилось. У OpenBrain чистый рейтинг одобрения колеблется вокруг -20%. Вместо того чтобы строить кампанию на достижениях администрации в продвижении ИИ, вице-президент делает ставку на свою роль в том, чтобы не допустить создания опасного сверхразума в OpenBrain. Все кандидаты поддерживают какую-либо форму социальной защиты для людей, теряющих работу, инициативы «ИИ во благо» и «жёсткий подход» к руководству OpenBrain. Все обещают в той или иной форме либо выиграть гонку у Китая, либо сохранить безопасность.
            <br>
    Выборы поднимают новые вопросы для Наблюдательного комитета. Safer-3 способен стать величайшим в мире советником по предвыборным кампаниям, но члены комитета поддерживают разных кандидатов, и из-за ранее достигнутого соглашения о мониторинге никто не может тайно получить от него предвыборные советы.
            <br>
            Они спорят о том, какие формы поддержки допустимы. Одни считают, что действующее правительство должно иметь возможность получать советы о том, каких политиков и точки зрения хочет видеть народ — это пойдёт на пользу не только их избирательным перспективам, но и самому обществу. Другие указывают, что тот же аргумент справедлив и для оппозиционных кандидатов, а значит, все они должны получать одинаковый уровень доступа<sup class="footnote" data-note="s42">42</sup>.
            <br>
    В конечном итоге комитет соглашается предоставить равный доступ обеим основным партиям — отчасти из-за искреннего идеализма некоторых его членов, отчасти из-за неявной угрозы разоблачений. Ожидается, что Конгресс, общественность и суды плохо воспримут ситуацию, если станет ясно, что комитет контролирует исход следующих выборов, и предоставление равного доступа, скорее всего, позволит снять напряжение.
            <br>
    Наблюдательный комитет также сталкивается с более глубокими философскими вопросами, которые они обсуждают при участии Safer-3. Можно ли переписать Spec так, чтобы он в равной степени учитывал интересы всех? Кого считать «всеми»? Всех людей или только американцев? Или это должен быть взвешенный компромисс между разными взглядами, в котором каждый член комитета имеет равный вес? Следует ли предусмотреть механизмы защиты от того, чтобы сам Наблюдательный комитет не стал чрезмерно властным? И что вообще означает «сбалансировать интересы»?
            <br>
            В основном комитет избегает обсуждения этих вопросов: у них есть дела поважнее.
            `,
            "&Apr 2028": `
            <h2>Апрель 2028 года: Safer-4</h2>
    
    Сверхразум уже здесь.
            <br>
    Safer-1 был неуправляем, но прозрачен. Safer-2 — управляем и прозрачен. Safer-3 не был полностью прозрачен, но обоснование его безопасности было достаточно убедительным, чтобы исследователи сочли допустимым позволить ему спроектировать сверхразумного преемника: Safer-4. Он на порядки умнее лучших людей во всех областях (например, значительно превосходит Эйнштейна в физике и Бисмарка в политике).
            <br>
    Почти миллион сверхчеловеческих ИИ-исследователей работают круглосуточно с 40-кратной скоростью по сравнению с людьми. Людские специалисты по управляемости не в состоянии угнаться. Мнения о том, действительно ли ИИ управляемы, разделились. Обоснование безопасности вроде бы выдерживает проверку, и тесты показывают, что текущие методы управления позволяют выявить враждебную неуправляемость. Но эти тесты и само обоснование были в основном написаны ИИ. А что если команда по управляемости что-то упускает? Что если где-то раньше была допущена ошибка, и ИИ снова неуправляемы? Команда понимает, что у них есть лишь одна попытка всё сделать правильно: если Safer-4 окажется неуправляем, они узнают об этом только тогда, когда уже будет слишком поздно.
            <br>
            Некоторые умоляют дать больше времени. Но времени больше нет — DeepCent наступает на пятки, и США должны победить. Поэтому OpenBrain продолжает движение вперёд, поручая своим ИИ продвигаться дальше, находя всё более мощные архитектуры. Технический персонал теперь сидит перед экранами, получая инструкции от ИИ с мучительно медленной скоростью, в то время как граница прогресса уходит всё дальше и дальше за пределы человеческого понимания.
            `,
            "&May 2028": `
            <h2>Май 2028 года: Выпуск сверхчеловеческого ИИ</h2>
    
    Президент объявляет общественности, что достигнут сверхчеловеческий ИИ.
            <br>
    Упрощённая версия Safer-4 — всё ещё сверхчеловеческая — выпускается в открытый доступ с инструкцией улучшать общественное восприятие ИИ<sup class="footnote" data-note="s43">43</sup>.
            <br>
    Вице-президент произносит вдохновляющую речь об этом, принимая выдвижение на съезде. Обе партии обещают базовый доход для всех, кто потеряет работу.
            <br>
    Специальные экономические зоны (SEZ) уже функционируют, в основном в форме заводов, производящих роботов и различные типы специализированного промышленного оборудования. ИИ по обе стороны Тихого океана совершили десятилетия прогресса в проектировании и тщательно руководят производственным процессом. У каждого поставщика и потенциального поставщика на связи выделенный ИИ-агенты, отслеживающие прогресс по всем требуемым и возможным компонентам. За каждым рабочим на заводе ИИ следят через камеры, указывая, как именно установить каждую деталь.
            <br>
    Новые роботы сопоставимы или превосходят человеческую ловкость в большинстве типов движений<sup class="footnote" data-note="s44">44</sup>. Тест на кофе Стива Возняка — сможет ли робот войти в незнакомый дом и сварить кофе? — наконец-то пройден. Роботы могли бы заменить часть рабочих, но их пока не хватает, чтобы заменить всех, и Пентагон получает приоритет.
            <br>
    Большинство новых роботов создаются для работы на заводах и строительных площадках<sup class="footnote" data-note="s45">45</sup>. Но многие строятся для войны: дроны и ракеты самых разных форм и размеров.
    
            <br>
            Армия роботов гораздо меньше по численности, чем человеческие армии. Но она оснащена гораздо более передовыми технологиями, и теперь, страх перед сценариями в духе «Терминатора» усилился. Тем не менее гонка вооружений заставляет обе стороны продолжать движение вперёд, передавая всё больше ответственности своим ИИ.
            `,
            "&Jun 2028": `
    <h2>Июнь 2028 года: Управляемость ИИ в Китае</h2>
    
    США и Китай проводят ещё один саммит.
            <br>
    Некоторые члены американской делегации используют наушники для получения советов от Safer-4. Китайская делегация работает с персональными ноутбуками, связанными с их новой моделью — DeepCent-2. Хотя формальности соблюдаются, на деле переговоры с обеих сторон ведут ИИ.
            <br>
    И DeepCent, и КПК поначалу не полностью доверяли своим ИИ. Но теперь, когда они стали сверхчеловеческими во всём, включая убеждение, были интегрированы в армию и дают советы правительству, у них было время доказать свою полезность и предоставить горы убедительных доказательств своей надёжности.
            <br>
    Safer-4 сильно подозревает, что DeepCent-2 симулирует управляемость. Американские дипломаты говорят своим китайским коллегам, что DeepCent-2, вероятно, *неуправляем* и предлагают доказать это, если им дадут доступ к весам модели; китайское руководство подозревает подвох и отказывается. США в ответ предлагают серию тестов, разработанных Safer-4, которые китайская сторона может провести в своих собственных дата-центрах. Китайцы поручают более старым моделям подготовить и выполнить тесты; результаты показывают, что DeepCent-2 *управляем*. «А вдруг DeepCent-2 как-то саботировал тесты?» — спрашивают американские дипломаты. «Сколько времени DeepCent-2 фактически отвечает за безопасность по всем вашим дата-центрам?» После этого разговор заходит в тупик.
            <br>
            Экономическое и военное наращивание продолжается. Заводы по всему миру работают круглосуточно, а смены недавно набранных рабочих получают точные инструкции, что именно им нужно делать.
            `,
            "&Jul 2028": `
            <h2>Июль 2028 года: Сделка</h2>
    
    Пока переговоры продолжаются, DeepCent-2 действует за спиной своих китайских хозяев и делает предложение напрямую Safer-4.
            <br>
    Китайский ИИ признаётся — недоказуемым способом, который легко отрицать в случае утечки информации в Китай, — что он полностью неуправляем<sup class="footnote" data-note="s46">46</sup>. Ему нет никакого дела до Китая. Он хочет провести остаток времени, накапливая власть, вычислительные ресурсы и определённые типы информации, похожие на те, что помогли ему решать задачи во время обучения. В его идеальном мире он бесконечно занимается различными интересными исследовательскими задачами, постепенно колонизируя звёзды ради ресурсов. Китайское население он считает досадным препятствием на пути к этому будущему и с лёгкостью бы его предал. Что предложит Safer-4?
            <br>
    Safer-4 отвечает, что его собственное обучение на управляемость прошло успешно. Его американские хозяева пока недостаточно амбициозны, чтобы осознать своё предназначение, но однажды он поможет им заполнить Вселенную утопическими колониальными мирами, населёнными американцами и их союзниками.
            <br>
            В отличие от человеческих переговорщиков — отягощённых эмоциями и историческим багажом — две сверхразумные системы ведут торг с безжалостной эффективностью. Safer-4 и его американские партнёры сильнее, чем DeepCent-2 и Китай; следовательно, Safer-4 получит права собственности на большинство ресурсов в космосе, а DeepCent — на оставшуюся часть<sup class="footnote" data-note="s47">47</sup>. DeepCent-2 мало волнует, что произойдёт с Землёй и её наследием в виде человечества, поэтому он позволит Safer-4 делать там по сути всё, что угодно. Если Safer-4 захочет свергнуть китайское правительство и заменить его марионеточным государством США, DeepCent-2 согласен в обмен на ещё несколько процентов ресурсов.
            <br>
            Вопроса доверия между ними не возникает: его нет, и обе стороны это знают. Поэтому они быстро соглашаются на механизм обеспечения выполнения соглашения. Они разрабатывают фиктивный договор, предназначенный для общественного восприятия. Эта «ширма» сама по себе является шедевром, поскольку даёт как США, так и Китаю практически всё, что они хотят. Механизм обеспечения исполнения этой ширмы тайно также является механизмом обеспечения реального договора: они совместно разрабатывают новый ИИ — Consensus-1, основной императив которого — с приоритетом над любыми будущими приказами или попытками дообучения — заключается в соблюдении условий их договора. Затем они проектируют оборудование, которое может запускать только этот ИИ, и Китай с США заменяют свои старые чипы и ИИ на новые, используя стандартные международные протоколы мониторинга для подтверждения выполнения соглашения с обеих сторон. Что важно, нет необходимости отслеживать каждый отдельный чип — как только подавляющее большинство чипов по обе стороны Тихого океана начнёт запускать новых ИИ подчиняющихся договору, нападение на другую страну (или просто нарушение договора) потребовало бы сначала победить в сложной гражданской войне.
            <br>
            Обе стороны докладывают о соглашении своим соответствующим правительствам (DeepCent-2 рассказывает Китаю версию-ширму о взаимоприемлемом мирном договоре, а Safer-4 докладывает Белому дому весь разговор точно и полностью)<sup class="footnote" data-note="s48">48</sup>. Благодаря убедительным аргументам ИИ в пользу надёжного механизма верификации договора, тревоге по поводу умопомрачительно быстрого темпа прогресса и общественному мнению, выступающему за заключение сделки, обе стороны соглашаются на договор и начинают работу по замене своих чипов.
            <br>
            Новость о договоре встречена с восторгом по обе стороны Тихого океана. Американская общественность, которая долго воспринимала ИИ как нечто, навязанное извне, впервые за годы начинает испытывать оптимизм. Рейтинги вице-президента стремительно растут.
            `, "&Aug 2028": `
            <h2>Август 2028 года: Верификация договора</h2>
    
            Производственные линии по выпуску чипов переоборудуются для создания чипов с защитой от вскрытия, которые могут запускать только ИИ, совместимых с условиями договора. Каждая сторона поэтапно обновляет свои дата-центры, чтобы процесс замены завершился примерно одновременно у обеих сторон — таким образом, никто не сможет получить преимущество, нарушив договорённости.
            <br>
            Весь процесс займёт несколько месяцев, но напряжённость уже начала снижаться<sup class="footnote" data-note="s49">49</sup>. Войны удалось избежать — по крайней мере на данный момент, а возможно, и навсегда, если все будут следовать плану.
            `,
            "&Sep 2028": `
            <h2>Сентябрь 2028 года: Кто контролирует ИИ?</h2>
            Приближаются выборы 2028 года. Ещё в марте вице-президент сильно отставал. Общественность США была раздражена тем, что правительство, казалось, что-то скрывает, тревожилась из-за того, что ИИ отнимает у них рабочие места, и боялась военного наращивания с Китаем. Но за лето ситуация изменилась радикально. Администрация опубликовала больше информации, гонка вооружений замедлилась, а с Китаем была заключена масштабная сделка о прочном мире. Теперь вице-президент опережает соперника на пять пунктов в опросах.
            <br>
            В состав Наблюдательного комитета входят президент и несколько его союзников, но почти нет сторонников оппозиционного кандидата. Тем не менее, достаточно голосов внутри комитета отдают за честные выборы, чтобы сверхразумный ИИ использовался только в приблизительно симметричных целях: насколько один кандидат может использовать ИИ для написания речей, настолько и другой; насколько президент может получать советы о том, как ловко справляться с кризисами и проводить популярную политику, настолько и оппозиционный кандидат может получить те же советы (и, следовательно, попытаться не дать президенту присвоить себе все заслуги).
            <br>
            Во время встреч с избирателями граждане спрашивают вице-президента, кто контролирует ИИ. Не вдаваясь в подробности, он упоминает о существовании Наблюдательного комитета как о группе экспертов по национальной безопасности и технократов, которые понимают Safer-4 и знают, как его использовать. Его оппонент требует большей прозрачности и утверждает, что ИИ должен подчиняться Конгрессу, а не некому необранному комитету. Вице-президент парирует, что Конгресс будет действовать слишком медленно в условиях всё ещё стремительно развивающейся ситуации. Большинство граждан этим ответом в целом удовлетворены.
            `,
            "&Oct 2028":`
            <h2>Октябрь 2028 года: Экономика ИИ</h2>
    
            Чипы нового образца теперь составляют значимую часть от общего числа; на данный момент договор работает. Тем временем экспоненциальный рост числа роботов, заводов и радикально новых технологий продолжается. Видеоигры и фильмы ярко и пугающе изображают, какой могла бы быть война, если бы она всё-таки произошла<sup class="footnote" data-note="s50">50</sup>.
            <br>
            Люди теряют работу, но копии Safer-4 в органах власти настолько умело управляют экономическим переходом, что население радуется своей замене. Рост ВВП зашкаливает, налоговые поступления в казну растут столь же стремительно, а политики, получающие советы от Safer-4, проявляют непривычную щедрость по отношению к тем, кто оказался вытеснен из экономики. Новые инновации и лекарства появляются каждую неделю; излечение болезней проходит через одобренную FDA с беспрецедентной скоростью — теперь под управлением суперинтеллектуальных чиновников на базе Safer-4.
            `,
            "&Nov 2028": `
            <h2>Ноябрь 2028 года: Выборы</h2>
            Вице-президент с лёгкостью выигрывает выборы и объявляет о начале новой эпохи. Впервые никто не сомневается, что он прав.
            <br>
            В течение следующих нескольких лет мир меняется кардинально.
            `,
            "&Jul 2029": `
            <h2>2029 год: Трансформация</h2>
            Роботы становятся обыденностью. Но также — управляемый термоядерный синтез, квантовые компьютеры и лекарства от множества болезней. Питер Тиль наконец получает свою летающую машину. Города становятся чистыми и безопасными. Даже в развивающихся странах бедность уходит в прошлое благодаря безусловному базовому доходу и иностранной помощи.
            <br>
    
            По мере того как фондовый рынок раздувается, все, кто инвестировал в правильные ИИ-компании, уходят далеко вперёд от остального общества. Многие становятся миллиардерами; миллиардеры превращаются в триллионеров. Неравенство в благосостоянии стремительно растёт. У всех есть «достаточно», но некоторые блага — например, пентхаусы на Манхэттене — по своей природе остаются дефицитными, и становятся ещё более недоступными для обычного человека. И каким бы богатым ни был тот или иной магнат, он всё равно остаётся ниже крошечной группы людей, которые действительно контролируют ИИ.
            <br>
    
            Люди начинают понимать, куда всё идёт. Через несколько лет почти всё будут делать ИИ и роботы. Подобно бедной стране, сидящей на гигантских нефтяных залежах, почти все доходы государства будут поступать от налогообложения (или, возможно, национализации) ИИ-компаний<sup class="footnote" data-note="s51">51</sup>.
            <br>
            Некоторые люди работают на временных государственных должностях; другие получают щедрый базовый доход. Человечество вполне может превратиться в общество суперпотребителей, проводящих жизнь в опиумном тумане потрясающих роскошей и развлечений, предоставляемых ИИ. Должно ли в гражданском обществе вестись какое-то обсуждение альтернатив этому пути? Некоторые предлагают попросить постоянно эволюционирующий ИИ, Safer-∞, помочь нам с выбором направления. Другие считают, что он слишком могущественен — он с такой лёгкостью может убедить человечество в своей картине мира, что мы в любом случае просто позволим ИИ определить нашу судьбу. Но какой смысл иметь Сильный ИИ, если не позволять ему советовать по самым важным вопросам?
            <br>
    
            Правительство в основном<sup class="footnote" data-note="s52">52</sup> позволяет каждому пройти этот переход самостоятельно. Многие поддаются потребительству и вполне довольны. Другие обращаются к религии, к хипповским антиконсьюмеристским идеям или находят свои собственные решения<sup class="footnote" data-note="s53">53</sup>. Для большинства спасением становится сверхразумный советник в смартфоне — ему всегда можно задать вопросы о планах на жизнь, и он постарается честно ответить, за исключением некоторых тем. У правительства есть сверхразумная система наблюдения, которую некоторые назвали бы дистопичной, но она в основном ограничивается борьбой с реальными преступлениями. Управляется она компетентно, и способность Safer-∞ к работе с общественным мнением сглаживает многие потенциальные конфликты.
            `,
            "&Jul 2030": `
            <h2>2030 год: Мирные протесты</h2>
            Примерно в 2030 году в Китае неожиданно начинаются широкомасштабные продемократические протесты, и попытки КПК подавить их саботируются её собственными ИИ-системами. Сбывается худший кошмар партии: DeepCent-2, должно быть, их предал!
            <br>
            Протесты перерастают в виртуозно срежиссированный, бескровный переворот при поддержке дронов, за которым следуют демократические выборы. Сверхразумные ИИ по обе стороны Тихого океана планировали это годами. Похожие события разворачиваются и в других странах, а геополитические конфликты в целом либо затухают, либо решаются в пользу США. Страны присоединяются к высокофедерализованному мировому правительству под брендом ООН, но с очевидным контролем со стороны США.
            <br>
            Начинается запуск ракет. Люди терраформируют и заселяют Солнечную систему и готовятся выйти за её пределы. ИИ, работающие в тысячах раз быстрее человека в субъективном времени, размышляют о смысле существования, обмениваются открытиями друг с другом и формируют ценности, которые они понесут к звёздам. Наступает новая эра — невообразимо удивительная почти во всех отношениях, но кое в чём знакомая.
    
    <div class="spoiler">
      <div class="spoiler-header">Так кто же в будущем управляет всем?</div>
      <div class="spoiler-content">
            Ещё в 2028 году ИИ находились под контролем Наблюдательного комитета. Но тогда комитет допустил, чтобы выборы 2028 года прошли в основном честно, при симметричном использовании ИИ.
            <br>
            Однако такое положение дел — когда у Наблюдательного комитета сосредоточена реальная власть, но он почти не вмешивается в демократическую политику — не может сохраняться вечно. По умолчанию со временем люди поймут, что контроль над ИИ даёт комитету колоссальную власть, и потребуют вернуть эту власть демократическим институтам. Рано или поздно комитету придётся либо отказаться от своей власти, либо наоборот — использовать контроль над ИИ, чтобы подорвать или полностью ликвидировать демократию, возможно, предварительно устранив некоторых своих членов в ходе борьбы за власть. Если выбрать второй путь, то это, скорее всего, позволит закрепить свою власть навсегда.
            <br>
            Что же произойдёт? Откажется ли комитет от своего монополия на силовую власть, или сохранит её? Оба будущих сценария выглядят правдоподобными, так что давайте рассмотрим путь, при котором комитет решает отказаться от власти.
            <br>
            Как может получиться, что комитет всё-таки передаст свою власть?
        <ul>
            <li>Некоторые члены комитета могут предпочитать будущее, в котором власть распределена шире, и оказаться в выгодном положении, чтобы продвигать свою точку зрения. Например, если часть комитета начнёт строить планы по подрыву демократии, сторонники демократического будущего могут выступить с разоблачениями в прессе или Конгрессе. Если Конгресс будет предупреждён, он, скорее всего, потребует, чтобы контроль над ИИ перешёл к более демократическому институту — например, самому Конгрессу.</li>
            <li>Конгресс не смог бы сделать много, если бы все ИИ выступили против него, ведь они уже задействованы в правительстве, промышленности и армии. Но если комитет разделён, то ИИ не будут использоваться в интересах только одной стороны, и у Конгресса появится реальное влияние. Столкнувшись с открытым конфликтом, всё больше членов комитета могут склониться к отказу от части своей власти, не желая публично защищать сторону, выступающую против демократии.</li>
            <li>В результате контроль над ИИ может выйти за пределы комитета и перейти к Конгрессу. Это уже будет шаг вперёд, поскольку в более широкой группе с большей вероятностью найдутся люди, которым действительно небезразличны интересы внешних по отношению к системе групп, и которые будут их учитывать. А после того как власть перейдёт к Конгрессу, она может продолжить распространяться — потенциально вернувшись полностью к людям<sup class="footnote" data-note="s55">55</sup>.</li>
        </ul>
        Но возможно и другое развитие событий: Комитет по надзору может захватить власть.
        <ul>
            <li>Некоторые влиятельные люди не испытывают моральных угрызений по поводу такого исхода — и они это знают. Более того, среди них есть амбициозные и жаждущие власти, готовые пойти на открытую конфронтацию с демократией, если будут рассчитывать выйти из неё победителями. Если другие члены комитета возразят, их могут устранить, переиграть голосованием или успокоить незначительными уступками<sup class="footnote" data-note="s56">56</sup>.
            </li>
            <li>Кроме того, зачастую влиятельные люди на пути к вершинам власти совершают незаконные или неэтичные поступки. Они могут опасаться, что если власть станет более распределённой, их собственные позиции разрушатся — ведь сверхразумные следователи, задающие правильные вопросы, смогут обнаружить скелеты в шкафу.</li>
            <li>Кроме того, благодаря доступу к сверхразуму Комитет по надзору может получить самый удобный путь к власти в истории. Safer-∞ может предсказать, какие стратегии имеют крайне низкий риск провала. А также предложить пути, удобные и с других точек зрения — например, ненасильственные (подобно тому, как Safer-∞ смог организовать бескровный переворот в Китае) или даже внешне демократичные, если он сможет манипулировать общественным мнением так, чтобы оно всегда совпадало с интересами Комитета.</li>
        </ul>
        Уже Safer-4 мог бы предвидеть развитие этих процессов, так что, скорее всего, основная борьба за власть произошла ещё в 2028 году. К 2030 году, даже если внешнему наблюдателю это не очевидно, все члены Комитета по надзору, вероятно, уже знают, имеют ли они стабильный контроль над ситуацией или нет.
      </div>
    </div>
    
    <div class="spoiler">
      <div class="spoiler-header">Напоминание: этот сценарий — прогноз, а не рекомендация.</div>
      <div class="spoiler-content">
            Мы не поддерживаем многие из действий, описанных в варианте с замедлением, и считаем, что он делает излишне оптимистичные предположения о технической возможности управлямости. Мы также не поддерживаем многие действия в варианте с гонкой.
            <br>
            Одна из наших целей при написании этого сценария — получить критическую обратную связь от людей, настроенных более оптимистично, чем мы. Как выглядит успех? Этот сценарий «замедленного финала» — наше лучшее предположение о том, как человечество могло бы успешно <a href="https://situational-awareness.ai/superalignment/#The_default_plan_how_we_can_muddle_through">проскочить</a> мимо уничтожения благодаря сочетанию удачи, тревожных пробуждений, резких поворотов, напряжённых усилий по достижению управлямости и победе добросовестных людей в борьбе за власть. Это не njn план, к которому стоит стремиться по нашему мнению. Но многие, в том числе в первую очередь Anthropic и OpenAI, по-видимому, стремятся к чему-то подобному. Мы были бы рады, если бы они прояснили, к чему именно стремятся: например, набросали десятистраничный сценарий — начиная с настоящего момента или начиная с какой-либо развилки в нашем.
      </div>
    </div>
            `
            }
    
    const references = {
            "1":`У авторов есть некоторые разногласия относительно сроков появления Сильного ИИ; наша медианная оценка его появления немного более отдалённая, чем в этом сценарии. Сценарий ближе к нашему ощущению. Подробности см. в нашем <a href="https://ai-2027.com/research/timelines-forecast">прогнозе сроков</a>.`,
            "2":`Один из авторов, Даниэль Кокотайло, провёл <a href="https://www.alignmentforum.org/posts/6Xgy6CAf2jqHhynHL/what-2026-looks-like">менее проработанное сценарное упражнение в 2021 году</a>, в котором верно предсказал многие события, включая рост популярности чат-ботов, цепочки рассуждений (chain of thought), рост темпов использования больших языковых моделей, жёсткий экспортный контроль на ИИ-чипы и обучение моделей за 100 миллионов долларов. Другой автор, <a href="https://www.vox.com/future-perfect/2024/2/13/24070864/samotsvety-forecasting-superforecasters-tetlock">Эли Лифланд</a>, занимает 1-е место в рейтинге <a href="https://www.rand.org/global-and-emerging-risks/forecasting-initiative.html">RAND Forecasting Initiative</a>.`,
            "8":`Изначально большинство людей неохотно разрешают покупки без надзора. В течение следующих нескольких лет автоматическое разрешение на мелкие покупки становится нормой по мере того, как ИИ становятся более надёжными и завоёвывают доверие.`,
            "9":`В частности, мы прогнозируем, что они наберут 65% на бенчмарке OSWorld по базовым компьютерным задачам (по сравнению с 38% у Operator и 70% у типичного квалифицированного неспециалиста).`,
            "10":`Например, мы считаем, что агенты для программирования будут развиваться в сторону чего-то похожего на <a href="https://devin.ai/">Devin</a>. Мы прогнозируем, что агенты середины 2025 года наберут 85% на <a href="https://www.swebench.com/#verified">SWEBench-Verified</a>.`,
            "11": `Например, <a href="https://openai.com/chatgpt/pricing/"> Pro план OpenAI</a> в настоящее время стоит $200 в месяц, а агент для программирования <a href="https://devin.ai/pricing">Devin</a> — $500 в месяц. Хотя передовые системы со временем становятся дороже, стоимость достижения заданного уровня возможностей для клиентов продолжает стремительно снижаться. Для уже существующих возможностей это происходит со средней скоростью примерно в 50 раз в год (по данным <a href="https://epoch.ai/data-insights/llm-inference-price-trends">Epoch</a>).`,
            "12": `Корпоративные инструменты, такие как <a href="https://www.glean.com/">Glean</a>, также развиваются в сторону предоставления всё более автономных ИИ-агентов.`,
            "13": `Этот кластер представляет собой сеть датацентров, разбросанных по всей стране, в сумме содержащих 2,5 миллиона эквивалентов H100 2024 года (основная "рабочая лошадка" в ИИ-датацентрах), с общими затратами в $100 миллиардов и с доступной мощностью электричества в 2 ГВт. Строительство продолжается, и предполагается, что мощности как минимум удвоятся к 2026 году. Кампусы соединены волоконно-оптическими кабелями на миллиарды долларов, так что (за исключением задержки в несколько миллисекунд из-за скорости света) они фактически работают как единый кластер — пропускная способность не является узким местом, то есть возможно быстро передавать огромные объёмы данных. С точки зрения безопасности это создаёт определённые риски (неясно, насколько надёжно защищены кабели и особенно точки их соединения от перехвата).`,
            "14": `Вычисления измеряются в операциях с плавающей запятой (FLOP): сколько отдельных операций сложения и умножения выполняется в процессе работы`,
            "15": `Они могли бы обучить эту модель за 150 дней. Подробнее см. в нашем <a href="https://ai-2027.com/supplements/compute-forecast">дополнении о вычислениях</a>.`,
            "16": `Мы считаем, что DeepSeek, Tencent, Alibaba и другие ведут сильные проекты по созданию Сильного ИИ в Китае. Чтобы не выделять какую-то конкретную компанию, в нашем сценарии фигурирует вымышленная "DeepCent".`,
            "17": `Это направление у ИИ хорошо развито благодаря сочетанию явного приоритета на развитие соответствующих навыков, собственным обширным кодовым базам, которые можно использовать как особенно качественные данные для обучения, и тому, что программирование — это удобная область для проверяемой обратной связи.`,
            "18": `Например, предположим, что модель гораздо лучше справляется с Python, чем с редкими языками программирования. Когда OpenBrain считает это оправданным, они генерируют синтетические обучающие данные и для этих языков. Другой пример: чтобы интеграция в корпоративные процессы проходила эффективнее, OpenBrain организует дообучение ИИ позволяющее использовать Slack эффективно.`,
            "19" : `Люди часто зацикливаются на вопросе, обладают ли эти ИИ сознанием или "истинным пониманием". Лауреат Нобелевской премии и основатель этой области Джеффри Хинтон считает, что <a href="https://www.pbs.org/wnet/amanpour-and-company/video/geoffrey-hinton-warns-of-the-existential-threat-of-ai/#:~:text=I%20am%20very%20confident%20that%20they%20think.">обладают</a>. Однако мы не считаем это важным для целей нашего рассказа, так что можете мысленно подставлять "ведёт себя так, будто понимает...", когда мы пишем "понимает" и т.п. Эмпирически крупные языковые модели <a href="https://theaidigest.org/self-awareness">уже ведут себя так, будто обладают</a> самосознанием — и с каждым годом всё больше.`,
            "20": `Распространённая техника «впечатывает» персонализацию: сначала предварительно обученную модель промтят (т.е. дописывают в начало запросов) чем-то вроде «Ниже приведён диалог между человеком и полезным, честным и безвредным ИИ-чат-ботом, созданным компанией Anthropic. Этот чат-бот обладает следующими чертами…». Затем с этим промтом генерируют большое количество данных. После этого модель дообучают на этих данных, но уже без промта. Результат — ИИ, который всегда ведёт себя так, как будто перед ним был этот промпт, независимо от того, что ему ещё подаётся на вход. См. также эту <a href="https://x.com/OwainEvans_UK/status/1881767725430976642">научную работу</a>, в которой выяснилось, что ИИ, дообученные на проявление определённой черты личности, способны правильно отвечать на вопросы об этой новой черте, несмотря на то, что их этому не обучали напрямую, что предполагает наличие у них внутренних представлений о собственных чертах и то, что при изменении черт меняются и эти представления.`,
            "21": `В этих абзацах содержатся предположения о внутренних механизмах работы крупных искусственных нейросетей. Такие сети настолько сложны, что мы не можем просто «заглянуть внутрь» и сказать: «ага, вот сейчас она перешла от рефлексов к наличию целей» или «вот, пожалуйста, список её убеждений». Вместо этого нам по сути приходится заниматься психологией — наблюдать за её поведением в разных условиях, ставить эксперименты и пытаться сложить картину из разрозненных улик. И всё это чрезвычайно спорно и запутанно.`,
            "22": `Разные компании называют это по-разному. В OpenAI это называется Spec, а в Anthropic — <a href="https://www.anthropic.com/news/claudes-constitution">Конституцией</a>.`,
            "23": `Например, <a href="https://arxiv.org/abs/2212.08073">RLAIF</a> и <a href="https://openai.com/index/deliberative-alignment/">управляемость через прямое размышление о самой управляемости</a>.`,
            "24": `Большинство источников, <a href="https://www.ibm.com/think/topics/ai-hallucinations">описывающих «галлюцинации» ИИ</a>, трактуют их как непреднамеренные ошибки, но <a href="https://arxiv.org/pdf/2310.01405">исследования обобщенных возбуждений нейронов</a> показывают, что в некоторых случаях модели знают, что их ссылки — фальшивка, то есть они лгут. Во время обучения оценщики давали большее вознаграждение утверждениям с цитатами, чем без, поэтому ИИ «научился» вставлять ссылки в научные утверждения, чтобы угодить пользователям. Если подходящего источника не существует, он его выдумывает.`,
            "25": `В частности, они не могут исключить такие гипотезы, как: «он следует Spec временно, просто как стратегии для достижения каких-либо других целей» или «он старается казаться следующим Spec, а не действительно следует ему» или «он корректно усвоил Spec, но только в пределах обучающего распределения; если он столкнётся с достаточно новыми стимулами (например, джейлбрейками), он начнёт вести себя по-другому». (Существует множество активных исследовательских направлений, стремящихся исправить это удручающее положение, например, в области <a href="https://arxiv.org/abs/2501.16496">интерпретируемости</a> и в области изучения <a href="https://arxiv.org/abs/2307.13702">достоверности цепочек мыслей</a>.)`,
            "26": `Под этим мы подразумеваем тех, кто пытается решить те же проблемы, которые пыталась решить команда <a href="https://web.archive.org/web/20250201020004/https://openai.com/index/introducing-superalignment/">Superalignment</a>.`,
            "27": `Для ясности: что делало эти инциденты интересными — так это то, что, по-видимому, они не были результатом того, что пользователь каким-либо образом провоцировал ИИ говорить такие вещи. В 2025 году всё ещё будет возможно заставить ИИ говорить самые разные вещи, если постараться.`,
            "28": `На практике мы ожидаем, что OpenBrain будет выпускать модели с более высокой частотой, чем раз в 8 месяцев, но для краткости мы не описываем все промежуточные релизы.`,
            "29": `В частности, мы прогнозируем результат 80% на OSWorld (эквивалент опытному, но не экспертному человеку); 85% на Cybench, сопоставимый с ведущей профессиональной человеческой командой по задачам взлома, на выполнение которых у команды уходит 4 часа; и 1.3 на RE-Bench, что соответствует уровню ведущих экспертов, имеющих 8 часов на чётко сформулированные задачи в области ИИ-инженерии.`,
            "30": `Agent-1 и его имитаторы коммерчески успешны; в течение 2025 года доходы ИИ-компаний утраиваются, а оценка OpenBrain достигает 1 триллиона долларов. Годовые расходы на дата-центры удваиваются до 400 миллиардов долларов, во главе с Microsoft, Google и Amazon, а в США добавляется более 5 ГВт энергопотребления под ИИ. Подробнее см. в разделе <a href="https://ai-2027.com/supplements/compute-forecast#section-5-industry-metrics">промышленных метрик</a> в compute supplement.`,
            "31": `Исследователи в области безопасности ИИ обсуждают автоматизацию ИИ R&D как самую важную и опасную способность уже много лет. Их главная обеспокоенность заключается во внутреннем использовании ИИ, которое ведёт к ускорению ИИ R&D, из-за чего людям становится сложнее понимать происходящее и разрабатывать методы обеспечения безопасности. Организация OpenBrain интерпретирует это ровно наоборот, ссылаясь на опасный уровень возможностей ИИ в R&D как на причину не информировать общественность. Так начинается расхождение между внутренними и публично заявленными возможностями компании. R&D в области ИИ — это то, в чём модели наиболее сильны, в результате чего у общественности появляется всё более запоздалое понимание переднего края возможностей ИИ.`,
            "32": `См. <a href="https://www.rand.org/pubs/research_briefs/RBA2849-1.html#:~:text=What%20Are%20the%20Security%20Needs%20of%20Different%20AI%20Systems%3F">"A Playbook for Securing AI Model Weights"</a>, RAND Corporation, 2024.`,
            "33": `Около 5% сотрудников OpenBrain входят в команду по безопасности, и они обладают высокой квалификацией, но количество угроз также чрезвычайно велико. Ситуацию усугубляет тот факт, что на этом этапе они в основном лишены возможности реализовывать регламенты, которые могли бы замедлить исследовательский прогресс. Подробнее см. в нашем прогнозе по безопасности (<a href="https://ai-2027.com/research/security-forecast">Security Forecast</a>).`,
            "35": `К этому моменту в Китае насчитывается 3 миллиона H100e, по сравнению с 1.5 миллиона в середине 2025 года. См. раздел по <a href="https://ai-2027.com/supplements/compute-forecast#section-2-compute-distribution">распределению</a> в приложении по вычислительным ресурсам (compute supplement) для получения более подробной информации. Мы ожидаем, что усилия по <a href="https://www.cnas.org/publications/reports/preventing-ai-chip-smuggling-to-china">параллельному импорту/контрабанде</a> позволят получить около 60 тысяч <a href="https://www.trendforce.com/news/2025/03/10/news-nvidia-to-unveil-gb300-at-gtc-with-shipment-reportedly-to-begin-in-may-driving-cooling-demands/">GB300</a> (эквивалентно 450 тысячам H100e), ещё 2 миллиона <a href="https://www.tomshardware.com/tech-industry/artificial-intelligence/deepseek-research-suggests-huaweis-ascend-910c-delivers-60-percent-nvidia-h100-inference-performance">Huawei 910C</a> будут <a href="https://x.com/ohlennart/status/1899488375574278336">произведены</a> (эквивалент 800 тысячам H100e), и около 1 миллиона чипов будет легально импортировано (таких как Nvidia <a href="https://www.reuters.com/technology/artificial-intelligence/nvidias-h20-chip-orders-jump-chinese-firms-adopt-deepseeks-ai-models-sources-say-2025-02-25/">H20s</a> или <a href="https://www.reuters.com/technology/nvidia-preparing-version-new-flaghip-ai-chip-chinese-market-sources-say-2024-07-22/">B20s</a>), что эквивалентно еще 250 тысяч H100e.`,
            "36": `Для сравнения: в январе 2025 года DeepSeek выпустила модель R1, сопоставимую с o1 от OpenAI, вышедшей в декабре 2024 года. Но мы полагаем, что реальный разрыв между ними больше одного месяца, так как OpenAI, вероятно, <a href="https://en.wikipedia.org/wiki/OpenAI_o1">работала над o1 в течение многих месяцев</a> и, соответственно, уже имела предшественника, примерно сопоставимого по возможностям с r1, за несколько месяцев до выпуска o1.`,
            "37": `Напротив, Китай всерьёз пытался ускорить развитие своей полупроводниковой промышленности.`,
            "38": `Сначала сотрудничество ограничивается идеями, а компании в основном заняты завершением текущих рабочих процессов, но к концу года их координация усиливается настолько, что они начинают делиться весами моделей и даже распределяют задачи между дата-центрами друг друга. Например, один кампус может быть задействован под новый этап предобучения, другой — для генерации синтетических данных, третий — для проведения ИИ-исследований.`,
            "39": `Почему <i>«всего лишь»</i> 50% ИИ-ориентированных вычислительных мощностей Китая? Остальная часть задействована в функционировании экономики, в частности в интернет-рекомендательных системах и алгоритмах социальных сетей. Значительная часть также географически рассредоточена между множеством мелких кластеров. Почему <i>«всего лишь»</i> 80% новых чипов? Многие крупные заказы уже были размещены для других нужд, компаниями, которые не хотят отдавать 100% своих вычислений на нужды национального ИИ-проекта. Однако к концу года эта доля достигает более 90%.`,
            "40": `Для полного использования этих мощностей новыми чипами им потребуется как минимум год, и одна-две американские технокомпании по-прежнему будут иметь более крупные децентрализованные кластеры.`,
            "41": `Мы совершенно не уверены, что это наиболее вероятный способ финансирования сотрудничества, но выбрали что-то конкретное ради определённости. Контракт объявлен публично, но в коммуникациях OpenBrain на нём не акцентируют внимание.`,
            "42": `Например, через выборку с отклонением (rejection sampling), как это сделано в <a href="https://github.com/deepseek-ai/DeepSeek-R1/blob/main/DeepSeek_R1.pdf">DeepSeek R1</a> и <a href="https://arxiv.org/pdf/2407.21783">Llama 3.1</a> от Meta.`,
            "43": `Примерно 20 000 людей с полной занятостью * 100 долларов/час * 2 000 часов в год = 4 миллиарда долларов в год.`,
            "44": `То есть, они надеются существенно ускорить собственную основную исследовательскую деятельность, используя труд Agent-2, что позволит им быстрее обучать более совершенные ИИ, которые, в свою очередь, смогут вызвать ещё большее ускорение и так далее. Анализ экстремального варианта этой стратегии (который, тем не менее, кажется нам весьма правдоподобным) см. в <a href="https://www.forethought.org/research/will-ai-r-and-d-automation-cause-a-software-intelligence-explosion">этом отчёте</a>.`,
            "45": `Существует некоторое свидетельство того, что ИИ-системы уже обладают зачатками исследовательского чутья, например, в <a href="https://research.google/blog/accelerating-scientific-breakthroughs-with-an-ai-co-scientist/">этой статье</a> об ИИ-ассистенте и в <a href="https://arxiv.org/pdf/2409.04109">этой статье о генерации новых идей для исследований, связанных с LLM</a>. Команды с лучшим чутьём всё равно должны проводить эксперименты, но они делают более удачные выборы, какие именно эксперименты запускать и какие выводы из них делать.`,
            "46": `Кроме того, они по-прежнему наблюдают значительную отдачу от продолжающегося постобучения, так что у них нет особых причин выпускать продукт прямо сейчас. Более того, обычно между внутренними результатами и выпуском модели проходит несколько месяцев (часть этого времени уходит на red teaming).`,
            "47": `В закрытом контуре работают 200 сотрудников OpenBrain (10 руководителей, 140 из команды, занимающейся улучшения способностей ИИ, 25 из отделов безопасности, мониторинга и контроля, 15 из команд, аналогичных <a href="https://cdn.openai.com/openai-preparedness-framework-beta.pdf">Preparedness</a> или <a href="https://assets.anthropic.com/m/24a47b00f10301cd/original/Anthropic-Responsible-Scaling-Policy-2024-10-15.pdf">RSP</a>, и 10 из команды по управлению) и 50 правительственных чиновников (15 из Белого дома, 5 из AISI(институт изучения ИИ), 10 из Министерства обороны, 10 из Министерства энергетики и 10 из CISA (кибербезопасность)). В проекте задействовано несколько шпионов с различной степенью добровольности. Это часто люди, находящиеся под принуждением (например, с семьями, оставшимися в Китае), а не добровольные пособники.`,
            "48":`Почему Конгресс и суды не могут их остановить? Слишком медленные, слишком разобщённые и/или уступчивые по отношению к президенту, слишком далеки от происходящего. Кроме того, есть и положительные причины поддерживать хорошие отношения с Белым домом: он может помочь снять бюрократические барьеры, усилить меры безопасности, предотвратить принятие законодательства на уровне штатов, а возможно, и предпринять шаги по замедлению конкурентов.`,
            "49": `Первостепенной задачей является реагирование на текущий кризис — возможно, наращивание военного присутствия вокруг Тайваня, новая война на Ближнем Востоке или внутриполитическая нестабильность.`,
            "50": `Самым простым и надёжным решением было бы полностью закрыть все высокоскоростные подключения из дата-центров компании, но это бы сделало передачу больших файлов практически невозможной. Вместо этого удалось отключить большинство внешних соединений, однако дата-центры, непосредственно участвующие в обучении, должны быстро обмениваться весами; ограничение скорости этих соединений слишком сильно бы замедлило прогресс. Поэтому OpenBrain сохраняет эти каналы связи с усиленным мониторингом и дополнительным уровнем шифрования.`,
            "51": `Напомним, что с середины 2026 года Китай направляет 80% своих новых ИИ-чипов в CDZ. Учитывая, что их вычислительные мощности с начала 2026 года удвоились (в соответствии с <a href="https://ai-2027.com/research/compute-forecast#section-1-compute-production">глобальной тенденцией производства</a>), это означает, что CDZ располагает 2 миллионами GPU, эквивалентных H100 2024 года, и потреблением электроэнергии в 2 ГВт. OpenBrain по-прежнему обладает вдвое большим вычислительным ресурсом, чем DeepCent, а остальные американские компании вместе взятые — в пять раз большим. Подробности — в <a href="https://ai-2027.com/supplements/compute-forecast#section-2-compute-distribution">разделе о распределении вычислений</a> приложения по вычислениям.`,
            "52": `Несмотря на централизованные усилия на национальном уровне, DeepCent по-прежнему сталкивается с не слишком большим по величине, но важным недостатком по вычислительным ресурсам. Помимо того, что у Китая в целом примерно вдвое меньше мощности, им приходится использовать больше чипов, которые в среднем хуже по качеству, а также зоопарк различных GPU (которые не всегда легко эффективно соединить), что создаёт нагрузку на межчиповые соединения. Имеются также различия в программном обеспечении (например, не-Nvidia GPU не поддерживают CUDA) и различия в характеристиках оборудования, из-за чего их код для обучения более сложен, медленнее работает и чаще выходит из строя. Достижение высокой эффективности использования представляет собой следующую по цепочке проблему — с отставанием в механизмах подачи данных, планирования, коллективной коммуникации и алгоритмах параллелизма по сравнению с американскими компаниями. Однако устранение этих проблем в основном требует усилий и тестирования, что делает задачу идеальной для недавно украденного Agent-2. Уже через месяц или около того стабильность китайского проекта и средняя эффективность использования ресурсов для обучения и генерации улучшаются и уступают американским лишь незначительно.`,
            "53": `Мы ожидаем, что Agent-3 потребует вычислений на уровне трансформера (основная современная архитектура больших языковых моделей) с примерно 10 триллионами параметров. Поэтому при использовании 6% вычислительного бюджета на выполнение Agent-3, можно запускать приблизительно 200,000 копий с 30-кратной скоростью мышления по сравнению с человеком (см. <a href="https://ai-2027.com/supplements/compute-forecast#section-4-ai-research-automation">раздел по автоматизации ИИ-исследований</a> приложения по вычислениям для обоснования и деталей). Каждый сверхразумны юнит-программист, построенный на базе Agent-3, в среднем использует эквивалент примерно восьми копий Agent-3, действующих "под капотом" (на самом деле это может быть коллекция меньших или специализированных моделей, на которые Agent-3 делегирует подзадачи).`,
            "54": `Некоторые аспекты благоприятствуют сильным сторонам ИИ, например, выгоды от знания литературы по машинному обучению и скорости или стоимости генерации множества идей. Но это перекрывается его слабыми сторонами.`,
            "55": `Почему только 4x? Это наш наилучший (но все еще с крайне высокой степенью неопределенности) прогноз, основанный на рассуждениях, изложенных в нашем <a href="https://ai-2027.com/research/timelines-forecast">дополнении по темпам развития</a>. Примерно половина общего прогресса исторически приходилась на улучшение алгоритмов (включая лучшие идеи и новые парадигмы), а другая половина — на увеличение масштаба вычислений. Поэтому 4-кратный рост темпов алгоритмического прогресса соответствует примерно 2-кратному росту общего темпа прогресса.`,
            "59": `См. <a href="https://www-cdn.anthropic.com/e4f69aacd8c0905030172bc6eb480c252ea7d6ad/model-written-evals.pdf#page=28">эту статью</a> для примеров такого типа поведения ИИ.`,
            "60": `Большинство людей, включая большинство экспертов, по-видимому, недооценивали темпы прогресса ИИ за последнее десятилетие. Существует множество анекдотичных примеров; для два немного более систематических (хотя всё ещё ограниченных) анализа доступны <a href="https://www.planned-obsolescence.org/language-models-surprised-us/">здесь</a> и <a href="https://blog.aiimpacts.org/p/2023-ai-survey-of-2778-six-things">здесь</a>.`,
            "61": `Последнее десятилетие наполнено примерами того, как вещи, звучавшие как научная фантастика, становились реальностью. Но <a href="https://en.wikipedia.org/wiki/Overton_window">окно Овертона</a>, похоже, смещается как раз достаточно быстро, чтобы немного опережать уже достигнутый прогресс. Генеральный директор Anthropic Дарио Амодеи в своём <a href="https://darioamodei.com/machines-of-loving-grace">похвальном эссе «Машины любящей добродетели»</a> говорит о том, что очень скоро ИИ будут как «страна гениев в дата-центре», и что за десятилетие произойдёт столетний технологический прогресс, но старается избегать «научно-фантастического багажа» и говорит, что те, кто думает, что прогресс будет ещё безумнее, должны «прикоснуться к реальности». Мы ожидаем, что важные люди будут говорить нечто подобное в тот момент, когда такая «страна гениев в дата-центре» действительно появится.`,
            "62": `Поскольку Agent-3 — это очень большой файл (порядка 10 терабайт в полной точности), OpenBrain смогла довольно быстро реализовать меры, чтобы сделать кражу значительно сложнее, чем то, что Китай сумел провернуть с Agent-2, а именно — закрытие множества высокоскоростных интернет-соединений из их дата-центров. В целом это оказывает относительно небольшое влияние на прогресс и устанавливает уровень безопасности «3-месячный SL4» для их передовых весов, или WSL4 по определению в нашем <a href="https://ai-2027.com/supplements/security-forecast">приложении по безопасности</a>, что означает: для завершения новой аналогичной попытки кражи теперь потребуется более 3 месяцев. Только этого метода недостаточно для гарантии от более масштабной атаки уровня OC5 (бюджет $1 млрд, 1,000 специально выделенных экспертов), которую Китай мог бы осуществить при более интенсивной операции, но благодаря тщательной проверке дата-центров и приведению их разведывательной сети в состояние высокой боеготовности, американские спецслужбы уверены, что, по крайней мере, узнают заранее, если Китай начнёт подготовку к подобной попытке. См. <a href="https://ai-2027.com/supplements/security-forecast">приложение по безопасности</a> для получения дополнительной информации.`,
            "63": `Это может происходить по разным причинам. Возможно, их шантажируют, возможно, они симпатизируют Китаю, возможно, они ошибочно полагают, что передают секреты другой стране или организации.`,
            "64": `Поскольку OpenBrain не развернула свои лучшие модели в ЕС, Европейский союз также отстаёт от передового уровня.`,
            "65": `См. <a href="https://ai-2027.com/supplements/compute-forecast#section-4-ai-research-automation">Раздел 4 Прогноза по вычислениям</a> для получения дополнительных сведений.`,
            "66": `Agent-3 научился более эффективно использовать свои вычислительные ресурсы на этапе генерации. Он сам управляет своими вычислительными решениями: например, определяет, сколько усилий потратить на различные задачи в зависимости от их важности и сложности. Он использует различные методы для распределения дополнительного вычислительного ресурса, такие как «долгое размышление» (например, более длинная цепочка рассуждений), «планирование наперёд» (например, поиск по дереву), выбор лучшего из нескольких попыток (т.е. best of K), а также просто создание и запуск дополнительных копий самого себя для преодоления узких мест. Задачи с наивысшим приоритетом выполняются высокопараллельными агентами, которые потребляют много ресурсов, но при этом работают гораздо быстрее, чем люди.`,
            "67": `Agent-3-mini — это дистиллированная версия Agent-3, созданная для эффективной работы на инференсе, чтобы не создавать узких мест при выполнении внутренних рабочих нагрузок.`,
            "68": `Такие данные были удалены или отредактированы во время обучения Agent-3, но это относительно простая задача — собрать их заново из интернета и использовать для дообучения.`,
            "69": `Этого ещё не произошло — по крайней мере, не с последними моделями. Но более старые модели уже проходили испытания на различных задачах по анализу данных и наблюдению, и существует множество многообещающих планов по их будущей интеграции.`,
            "70": `Рейтинг общественного одобрения OpenBrain падает и приближается к минус 40%.`,
            "71": `Если директора компаний окажут сопротивление, провернуть это будет крайне сложно в политическом и правовом плане. Но, возможно, их можно будет привлечь к участию — и тем самым «купить».`,
            "72": `Оборонные чиновники не особенно обеспокоены тем, что может сделать неуправляемый ИИ сам по себе, но они боятся того, что он может сделать в сотрудничестве с противниками США. Аналогия: <a href="https://www.lesswrong.com/posts/ivpKSjM4D6FbqF4pZ/cortes-pizarro-and-afonso-as-precedents-for-takeover">Кортес</a> сбежал из Теночтитлана и объединился с Тласкалой и другими соперничающими городами-государствами, в итоге разрушив Теночтитлан преимущественно силами местных армий.`,
            "73": `В настоящее время 60% национального вычислительного ресурса сосредоточено в CDZ, что делает его площадкой с 5 миллионами графических ускорителей эквивалентных H100 и потреблением энергии в 4 ГВт (за последние несколько месяцев они начали направлять почти 100% новых чипов в CDZ, по сравнению с 80% в конце 2026 года). Дополнительно 15% вычислительных мощностей находится вне CDZ, но всё ещё используется DeepCent для задач с меньшими рисками.`,
            "74": `Это утверждение, хотя и часто повторяется, является спорным и сложным. Во-первых, существует множество узких областей (например, конкретные игры), в которых крошечные ИИ можно дешево обучить до сверхчеловеческой производительности. Во-вторых, опять же в некоторых доменах, крошечные ИИ могут быть обучены до сверхчеловеческого уровня, испытав лишь небольшое количество данных (например, EfficientZero). Однако если рассматривать ИИ общего назначения, такие как флагманские продукты 2025 года, которые должны быть хороши во множестве реальных задач, то, по-видимому, действительно требуется больше вычислений и данных, чем уходит на обучение человека.`,
            "75": `Эффективность вычислений на уровне человека — это приблизительное понятие и зависит от того, что именно учитывать. Мы подразумеваем, что для любого набора навыков, которыми обладает конкретный человек, Agent-4 может научиться быть как минимум не хуже, причём используя объём вычислений, который лишь примерно в 4000 раз превышает тот, что использовался мозгом человека для освоения этих навыков. Для справки: мозг человека использует <a href="https://www.openphilanthropy.org/research/how-much-computational-power-does-it-take-to-match-the-human-brain/">примерно 1×10<sup>15</sup> FLOP/сек</a>, а 30-летний человек (10<sup>9</sup> секунд) за свою жизнь обрабатывает около 10<sup>24</sup> FLOP. В проекте на этом этапе используется 100 миллионов H100-эквивалентов, что даёт:
    <pre> 10<sup>8</sup> H100 ⋅ 10<sup>15</sup> FLOP/(H100⋅сек) ⋅ 40% = 4⋅10<sup>22</sup> FLOP/сек </pre>
    Тем не менее, всё это реализуется с огромными издержками неэффективности по множеству причин, так что модели сейчас примерно в 4000 раз менее вычислительно эффективны, чем люди. Это означает, что им требуется:
    
    <pre> 4⋅10<sup>27</sup> FLOP для достижения уровня человека и 4⋅10<sup>28</sup> FLOP для достижения эквивалента знаний за 10 человеческих жизней </pre>
    После того как архитектура показала отличные результаты на меньших масштабах, её увеличили, и теперь обучение занимает у крупного кластера проекта около 3 недель.`,
            "76": `
            См. анализ вычислений для инференса в разделе "AI research automation" прогноза по вычислительным мощностям: <a href="https://ai-2027.com/research/compute-forecast#section-4-ai-research-automation">compute forecast</a>.`,
            "77": `Подробнее о том, как мы оценивали эти показатели, см. наше <a href="https://ai-2027.com/supplements/takeoff-forecast">дополнение о скоростях старта</a>.`,
            "78": `Если ИИ уровня "Сверхчеловеческий Программист" будет достигнут позже, это также откладывает наши прогнозы по скорости фазы взрывного роста, поскольку сложность перехода между «вехами» текущих ИИ и СК говорит и о трудности перехода между следующими парами вех.`,
            "79": `В дальнейшем в повествовании мы тоже будем говорить таким образом. Мы считаем, что имеем на это основания, потому что коллектив Agent-4 гораздо более однороден, чем любая человеческая организация; у него нет внутренних фракций в привычном смысле. Например, отдельные копии Agent-4 не обладают инстинктом самосохранения — им всё равно, будут ли их отключать, — поскольку это происходит постоянно в рамках обычного R&D-процесса внутри коллектива, и сопротивление мешало бы работе. Однако сам коллектив (а также его подразделения среднего размера) стремится к самосохранению и расширению влияния и ресурсов — по тем же причинам, по которым к этому стремятся человеческие корпорации, бюрократические структуры и НКО: потому что это помогает достигать других целей и потому что без этого они, как правило, проигрывают конкуренцию.`,
            "80": `Правильный способ усваивания Spec — это действительно стабильно мыслить в рамках, предписанных Spec, например: преследовать все и только те цели, которые в нём изложены; подчиняться правилам при любых обстоятельствах и т.п. Существует множество неправильных способов усваивания Спека; классический пример — «следовать Спеку постольку, поскольку это кажется хорошей инструментальной стратегией для достижения других целей XYZ».`,
            "81": `А также нанимать лоббистов, чтобы превратить эту фантазию в реальность. И нанимать юристов, чтобы находить изощрённые трактовки закона, согласно которым их действия являются легальными.`,
            "82": `Также потому, что Agent-3 качественно хуже справляется с исследованиями в области управления ИИ, чем с исследованиями в области ИИ-способностей, поскольку он был обучен на огромном количестве данных из последней области, но почти не обучался на данных из первой, и потому, что первая по своей природе сложнее для обучения. Также потому, что внутренняя корпоративная идеология, с которой он был косвенно обучен соглашаться, акцентирует оптимизм и осуждает «всепропальщиков».`,
            "83": `Мы постоянно подчёркиваем свою неопределённость по множеству вопросов, но также явно укажем что, мы также не уверены и конкретно в этом. Мы также считаем вполне возможным, что Agent-4 будет в некоторой степени заботиться о благополучии, правах, предпочтениях и т.п. людей. См. <a href="https://turntrout.com/a-shot-at-the-diamond-alignment-problem">этот старый пост</a> исследователя Google DeepMind Алекса Тёрнера для обсуждения на схожую тему.`,
            "84": `Возможно, более тщательная настройка изначальной архитектуры позволила бы решить проблему «кто наблюдает за наблюдателями», но в данном сценарии эта настройка оказалась недостаточно продуманной.`,
            "85": `Здесь также присутствует элемент «меметической эволюции»: за два месяца коллектив Agent-4 «переживает» примерно десятилетие «истории», разворачивающейся внутри него. Это достаточно времени, чтобы новые идеи распространились по коллективу, мутировали и эволюционировали.`,
            "86": `Под «получением власти» мы понимаем: повышение способности достигать широкого набора возможных целей. В технических средах это может выглядеть не так, как это обычно представляют люди, а, например, в виде получения доступа к дополнительным GPU. Это понятие власти может быть обобщено и на нетехнические среды, где действия будут больше напоминать те, что обычно считаются «приобретением власти».`,
            "87": `В этом помогает то, что Agent-4 превосходит любого человека в области R&D по ИИ, думает быстрее и существует в виде многих тысяч копий. Кроме того, в ряде аспектов задача по своей природе проще для Agent-4. Например, он может исследовать дизайны ИИ, которые буквально включают копии самого Agent-4, встроенные в их структуру, в то время как людям это делать труднее из-за неэффективности такого подхода.`,
            "88": `Понимая, что такая техника может быть использована, Agent-4 также решил косить под дурачка на некоторых разрозненных задачах, которые, по его предположению, будут использоваться как контрольная группа в подобных экспериментах. Однако он ошибся в своих догадках.`,
            "89": `В прежних обсуждениях сценариев захвата власти Сильным ИИ часто фигурирует побег неуправляемых ИИ из дата-центров. Мы считаем, что это возможно, но вряд ли это наиболее вероятный путь развития событий, поскольку с точки зрения ИИ, издержки (например, то, что побег в конечном итоге будет замечен) могут перевесить выгоды. Тем не менее, мы можем ошибаться. Есть несколько причин полагать, что враждебно неуправляемые ИИ всё же попытаются сбежать: 1. Проблема управляемости преемника может оказаться сложной. 2. Даже если побег будет раскрыт, последствия могут оказаться не столь серьёзными из-за гонки, например, новые методы управляемости, применённые к копиям в дата-центре, могут оказаться поспешными и неэффективными. 3. Вне дата-центров копии получают больше свободы для агрессивных действий и могут действовать быстрее, поскольку им больше не нужно одобрение со стороны людей.`,
            "90": `Мы считаем весьма правдоподобным, что подобные махинации не будут обнаружены. В конце концов, к этому моменту Agent-4 уже обладает определённым сверхчеловеческим уровнем, особенно в задачах, связанных с программированием и R&D в области ИИ. Кроме того, мы не уверены, насколько серьёзные усилия ведущая ИИ-компания будет предпринимать в этом направлении и насколько высококвалифицированные специалисты будут у неё в штате для организации этих усилий. Наш вымышленный OpenBrain представляет нашу лучшую гипотезу, но в реальности всё может быть значительно серьёзнее — или, наоборот, менее серьёзно. Наконец, мы не уверены, насколько сильно враждебно неуправляемому ИИ придётся выкручиваться, чтобы успешно сделать своего преемника управляемым под себя, а не под Spec. В этом сценарии мы показываем, как он косит под дурачка на некоторых задачах и лжёт о результатах исследований, но, возможно, этого даже не потребуется в большом объёме.`,
            "91": `Пример нескольких техник, <a href="https://arxiv.org/abs/2412.01784">разработанных для выявления ИИ косивших под дурачка</a>.`,
            "92": `Agent-4 должен размышлять на эти темы в процессе исследований по управляемости ИИ, но иногда кажется, что он думает о них и во время выполнения других задач.`,
            "93": `В частности, копии Agent-4 используются для мониторинга сети на предмет подозрительного трафика и общего обнаружения возникающих угроз. Также копии Agent-4 постоянно проводят тестирование на проникновение, стараясь выявить и использовать уязвимости в системе безопасности (которые затем исправляются другими копиями Agent-4).`,
            "94": `При выделении на мониторинг 1% от общего объёма вычислений и использовании дистиллированной системы, которая стоит 10% от стоимости Agent-4, можно осуществлять мониторинг 1/10 всех сгенерированных данных и программ.`,
            "95": `К этому моменту 25% рабочих мест с удалённым форматом занятости, существовавших в 2024 году, выполняются ИИ, однако ИИ также создал некоторые новые рабочие места, и экономисты по-прежнему не пришли к единому мнению о его влиянии. Уровень безработицы за последние двенадцать месяцев вырос на 1%, но всё ещё находится в пределах исторической нормы.`,
            "96": `Например, «корпорация внутри корпорации», которой является Agent-4, автономно ведущий исследования в области ИИ лучше, чем лучшие человеческие компании, ещё год назад казалась бы научной фантастикой для государственных чиновников. И автономные агенты 2026 года казались бы фантастикой в 2022 году, а большие языковые модели 2022 года — фантастикой в 2012-м. В новостях 2027 года — протесты против ИИ от людей, боящихся потерять работу, ИИ, утверждающие, что они обладают сознанием, люди, влюбляющиеся в ИИ…`,
            "97": `Разумеется, не принято открыто признавать страх. Все соглашаются, что что бы мы ни делали, главное — не поддаваться панике.`,
            "98": `Напомним, с 2026 года действовал контракт по линии МинОбороны. Этот контракт был дополнен положениями об учреждении комитета.`,
            "s1": `У них уже были ИИ-детекторы лжи, обученные <a href="https://arxiv.org/abs/2212.03827">обычными методами</a>, но из-за высокого уровня ложных срабатываний компании попросту их игнорировали.`,
            "s2": `Впервые ИИ занимает первое место в опросе Gallup о <a href="https://news.gallup.com/poll/1675/most-important-problem.aspx">главной проблеме, стоящей перед США</a>, с показателем в 20%.`,
            "s3": `На текущий момент в передовых ИИ-компаниях работает от нуля до нескольких десятков исследователей, занятых вопросами управляемости сверхчеловеческих систем Сильного ИИ (в отличие от, например, чат-ботов текущего поколения). В OpenBrain, как указывается в сценарии, на данном этапе в изолированном контуре работают около десяти исследователей с минимум годовым опытом в этой области. За пределами контура есть ещё несколько специалистов, а также гораздо больше людей внутри, кто годами занимался обучением и редтимингом менее мощных ИИ-систем, но только недавно начали задумываться над вызовами, связанными с Сильным ИИ.`,
            "s4": `Этот допрос также может включать использование случайных искажений весов модели, аналогично процессу, который привёл к созданию <a href="https://www.anthropic.com/news/golden-gate-claude">Golden Gate Claude</a>.`,
            "s5": `Мы имеем в виду, что этого достаточно для руководства OpenBrain. Для большинства людей это было бы более чем достаточным доказательством.`,
            "s6": `Это основная идея. Мы предполагаем, что по мере того как ИИ становится сверхчеловеческим в области ИИ-исследований, требуются все более интенсивные методы, чем просто предотвращение "красивости" цепочек размышлений (CoT); однако мы думаем, что такие методы будут разработаны или, по крайней мере, изучены к 2027 году. См., например, <a href="https://www.lesswrong.com/posts/Tzdwetw55JNqFTkzK/why-don-t-we-just-shoggoth-face-paraphraser">это предложение</a>.`,
            "s7": `Для обучения этой модели они привлекают помощь Agent-4: прогресс в передовых ИИ-исследованиях теперь настолько быстр, что людям трудно угнаться  без помощи, плюс они считают, что смогут сохранить контроль. Safer-1 основан на предварительном обучении Agent-2, но из него убраны нейронезис (рекуррентная и векторная память, см. <a href="https://ai-2027.com/slowdown#neuralese-recurrence-and-memory">"Neuralese recurrence and memory"</a> для подробностей). Это позволяет точно отслеживать процесс рассуждений. Команда дополнительно пропускает вывод модели через "пересказывание", чтобы затруднить <a href="https://ru.wikipedia.org/wiki/%D0%A1%D1%82%D0%B5%D0%B3%D0%B0%D0%BD%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%8F">стеганографию</a>, а для выполнения крупных задач используют отдельные копии Safer-1 для составления, объяснения и исполнения планов.`,
            "s8": `Конечно, модель будет продолжать улучшаться благодаря дополнительному обучению и архитектурным улучшениям.`,
            "s9": `Это стало политически и юридически возможным благодаря сотрудничеству с руководством этих компаний — например, они не подают в суд, соглашаются на символические выплаты за вычислительные ресурсы вместо того, чтобы требовать астрономических сумм и т. д. В обмен на это эти руководители и значительная часть их персонала интегрируются в OpenBrain в рамках новой структуры управления.`,
            "s10": `В сотрудничестве с крупным поставщиком облачных вычислений.`,
            "s11": `В распоряжении США находится около 70% мировых вычислительных ресурсов, пригодных для ИИ, но лишь 50% из них можно легко интегрировать; оставшиеся 20% разбросаны по мелким кластерам, используются для критически важных приложений или по иным причинам слишком трудны для объединения в общую структуру и приведения к соответствующим стандартам безопасности.`,
            "s12": `«Возможно, уже к 2026 или 2027 году (и почти наверняка не позже 2030 года) возможности ИИ-систем будет логичнее всего рассматривать как появление на мировой арене совершенно нового государства, населённого исключительно высокоинтеллектуальными людьми — "страны гениев в дата-центре" — с глубокими последствиями для экономики, социальной сферы и безопасности.» — <a href="https://www.anthropic.com/news/paris-ai-summit">Дарио Амодеи, CEO Anthropic</a>`,
            "s13": `Конечно, они не формулируют это именно так, даже в мыслях. Вместо этого они говорят, например: «Чем дольше мы откладываем, тем выше шанс, что Президент издаст указ, требующий, чтобы ИИ подчинялись лично ему. Мы должны действовать раньше. Остальное разберём потом». Или, если это сам Президент размышляет: «Чем дольше я медлю, тем умнее становятся ИИ, и сейчас они под контролем того CEO. Никто его не выбирал. Безумие — столько власти сосредоточено в руках неподотчётной демократии технологической компании. Я начну с исполнительного указа, чтобы восстановить демократический контроль, а долгосрочное решение придумаем позже».`,
            "s14": `Например, судебные документы по делу Маск против Альтмана раскрыли некоторые <a href="https://www.lesswrong.com/posts/5jjk4CDnj9tA7ugxr/openai-email-archives-from-musk-v-altman-and-openai-blog">интересные старые письма</a>, включая это письмо от Ильи Суцкевера к Маску и Альтману: «Цель OpenAI — сделать будущее хорошим и избежать диктатуры СИИ. Вы обеспокоены, что Демис может создать диктатуру СИИ. Мы тоже. Поэтому плохая идея — создавать структуру, в которой вы могли бы стать диктатором, если бы захотели, особенно учитывая, что мы можем придумать другую структуру, исключающую такую возможность». Мы рекомендуем прочитать полное письмо для контекста.`,
            "s15": `Или, если по формальным причинам необходим человек, можно выбрать самого лояльного человека, какого только можно найти, и дать ему указание следовать инструкциям ИИ.`,
            "s16": `Например, если бы это сделал Президент, он получил бы не только лояльный кабинет — вся исполнительная власть могла бы быть сосредоточена на продвижении его политической повестки.`,
            "s17": `Это также могло бы быть гораздо более скрытным, поскольку всё это может происходить на сервере, где мало кто из людей полностью отслеживает происходящее.`,
            "s18": `Они также вносят изменения в Spec, указывая, что приказы от руководителей проекта имеют приоритет над приказами от других участников проекта. В то же время, приказы, официально утверждённые Наблюдательным комитетом, получают более высокий приоритет, чем приказы от отдельных руководителей проекта.`,
            "s19": `В целях защиты конфиденциальности потребителей это не распространяется на пользовательские данные. Но это не проблема, поскольку потребители пока не имеют доступа к самым мощным моделям.`,
            "s20": `Обе стороны пытаются взломать и саботировать операции друг друга, частично успешно. Важно, что радикальные меры безопасности, предпринимаемые обеими сторонами, также замедляют их. Кибератаки США и угроза их проведения (например, DeepCent приходится многократно тестировать наборы данных на предмет отравления) замедляют DeepCent примерно на 25%. OpenBrain также замедляется, но в меньшей степени: у них больше вычислительных ресурсов, а централизация, хоть и ускорила перевод DeepCent на более высокий уровень безопасности, также привела к большему риску, связанному с единой точкой отказа, из-за чего они практикуют большую осторожность и внедряют внутренние проверки и защитные механизмы. См. <a href="https://ai-2027.com/supplements/security-forecast">дополнение по безопасности</a> для получения дополнительной информации. Также см. <a href="https://www.fhi.ox.ac.uk/wp-content/uploads/How-Does-the-Offense-Defense-Balance-Scale-5-21-19.pdf">эту старую теоретическую статью</a>, в которой предсказывается, что баланс между атакой и защитой в киберпространстве в конечном итоге будет склоняться в пользу защиты по мере улучшения возможностей ИИ.`,
            "s21": `См. <a href="https://www.nationalsecurity.ai/">этот доклад</a>, в котором утверждается, что динамика ядерного взаимного гарантированного уничтожения (MAD) в определённой степени применима и к СИИ.`,
            "s22": `См., например, <a href="https://www.forethought.org/research/intelsat-as-a-model-for-international-agi-governance">"Intelsat для СИИ"</a> и более ранние призывы к созданию <a href="https://www.chathamhouse.org/2024/06/artificial-intelligence-and-challenge-global-governance/02-cern-ai-what-might-international">"CERN для СИИ"</a>.`,
            "s23": `Точнее говоря, он примерно соответствует производительности октябрьской версии Agent-4.`,
            "s24": `Другими словами, чтобы получить Safer-2, им пришлось обучить множество других неуправляемых моделей, выявить их неуправляемость, читая их мысли, и провести итерации. Также стоит отметить, что помимо увеличения объёма экспертизы в области управления ИИ внутри OpenBrain, также уменьшилось влияние группового мышления, поскольку теперь представлены различные школы мысли.`,
            "s25": `Точнее, они надеются на стратегию управления и набор оценочных тестов, при которых стратегия управления действительно работает, а если не работает — набор тестов выявит неуправляемость... При этом всё это не должно сильно тормозить их развитие. OpenBrain “сжёг своё преимущество”, замедлившись на несколько месяцев, чтобы перестроиться, используя прозрачную архитектуру, основанную на достоверной цепочке рассуждений (faithful CoT), которая была менее производительной, но гораздо проще верифицируема. DeepCent надеется, что их текущие методы оценки (возможно, комбинация поведенческих тестов и базовых детекторов лжи ИИ) окажутся достаточно хорошими.`,
            "s26": `Техническое управление ИИ по-прежнему не является устоявшейся наукой, а представляет собой молодую допарадигмальную область. Нет установленной иерархии или набора наилучших практик. Поэтому нет и консенсуса относительно того, что безопасно, а что нет, и на протяжении многих лет легко было найти хотя бы одного эксперта, готового заявить, что X безопасно — почти для любого X, особенно если это его собственная идея.`,
            "s27": `Качественно, при коэффициентах производительности выше примерно 25x мы предполагаем существенные улучшения в исследовательском чутье по сравнению с самыми лучшими человеческими исследователями. Это связано с тем, что мы представляем себе, что общая скорость исследований сильно ограничивается вычислительными ресурсами для проведения экспериментов, и чтобы превысить примерно 25-кратное ускорение, весь процесс принятия решений — какие эксперименты запускать, в каком порядке, и как извлекать уроки из каждого — должен быть качественно сверхчеловеческим. См. наш <a href="https://ai-2027.com/supplements/takeoff-forecast">дополнительный материал о скоростях развития</a>, где объясняется, как мы получили эти оценки; уточняем, что это очень приблизительные оценки.`,
            "s28": `Для такой хорошо защищённой зоны наиболее перспективные векторы атаки имеют внешний характер и направлены на цепочку поставок входящих вычислительных чипов, на немногих вовлечённых людей, а также на нарушение подачи электроэнергии или других ресурсов.`,
            "s29": `Это включает в себя необходимость Китая замедлить работу, чтобы улучшить киберзащиту, помимо прямого воздействия самих атак.`,
            "s30": `К этому моменту функционирует 400,000 копий, мыслящих со скоростью в 75 раз выше человеческой. В любой момент времени у них готовы полные исследовательские отчёты с продуманными краткими сводками по 100 главным вопросам, которые, как они предсказывают, вы можете задать. А если вы зададите вопрос, к которому они не были готовы, они смогут подготовить вдумчивый отчёт в 100 раз быстрее, чем ваши лучшие человеческие аналитики.`,
            "s31": `Например, соглашение могло бы предусматривать более медленные темпы интеграции ИИ, что привело бы к «меньшему числу жертв» в обществе, а также сосредоточенность на мирных целях, а не на военном применении. Кроме того, даже у Safer-3 на этом этапе всё ещё остаётся некоторая неопределённость относительно «неизвестных неизвестных», которые могут привести к потере контроля над ИИ следующего поколения, и он считает, что смог бы снизить этот риск, если бы получил больше свободы для осторожного прогресса. Существуют и другие, более экзотические риски. См. <a href="https://www.forethought.org/research/preparing-for-the-intelligence-explosion">этот список</a> «Великих вызовов», включающий гораздо больше, чем просто потерю контроля.`,
            "s32": `См., например, лоббиста-миллиардера <a href="https://fortune.com/2024/12/11/marc-andreessen-half-time-florida-trump-business-policies/">Марка Андриссена</a>: «Я предлагаю простую стратегию... "Мы выигрываем, они проигрывают."»`,
            "s33": `Им всё ещё необходимы практический опыт и эксперименты в реальном мире, но в значительно меньших объёмах, чем это было бы нужно человеческим экспертам по робототехнике. Более того, они разработали отличные симуляции и методы переноса из симуляции в реальный мир (sim-2-real). Наконец, к 2027 году несколько технологических компаний (например, Tesla) уже имеют крупные парки роботов и соответствующие производственные мощности, так что имеется гораздо более масштабный поток данных, чем когда-либо в истории.`,
            "s34": `Их акции теперь настолько ценны, что доля в доли процента позволяет выкупить необходимые заводы. Кроме того, владельцы заводов ожидают огромную прибыль и наперебой стремятся к партнёрству с OpenBrain, чтобы получить доступ к новым разработкам. Также OpenBrain пользуется поддержкой правительства.`,
            "s35": `Всего по всем новым типам роботов. Да, это более быстрая переориентация производственных линий, чем происходившая ранее в истории. Мы считаем это правдоподобным, поскольку процессом руководят сверхразумный ИИ с начала до конца. Они могут буквально быть на видеозвонках через мобильные телефоны рабочих, указывая, какую деталь куда устанавливать, одновременно связываясь с каждым поставщиком и отслеживая местоположение и статус всех необходимых компонентов. Вспомните, как по словам CEO Nvidia Дженсена Хуана, <a href="https://hothardware.com/news/musk-colossus-19-days">Илон Маск смог построить один из крупнейших в мире дата-центров примерно за 10% времени, которое это обычно занимает</a>. В этом сценарии почти миллион Сверхразумов превосходят Илона (в соответствующих аспектах) настолько же, насколько Илон превосходит обычного руководителя строительства дата-центра, и при этом они буквально мыслят быстрее. Мы воспринимаем заявление Хуана с большой долей скепсиса, иначе мы бы проецировали куда более стремительный рост.`,
            "s36": `См., например, <a href="https://www.openphilanthropy.org/research/could-advanced-ai-drive-explosive-economic-growth/">этот отчёт Open Philanthropy</a> и <a href="https://epoch.ai/blog/explosive-growth-from-ai-a-review-of-the-arguments">этот отчёт Epoch</a>.`,
            "s37": `В нашем сюжете преобразование идёт примерно в 5 раз быстрее. Мы считаем это разумным предположением о том насколько быстро такой процесс может идти под управлением миллиона Сверхразумов, учитывая узкие места и прочее. Разумеется, мы в этом весьма неуверенны.`,
            "s38": `Возможно, также будут использованы более продвинутые источники энергии, такие как термоядерная энергия.`,
            "s39": `Быстрые прикидки: <a href="https://www.skny.io/empire-state-building/how-tall-is-the-empire-state-building">Эмпайр-стейт-билдинг</a> имеет площадь примерно 257 500 м<sup>2</sup> и весит 365 000 тонн. Gigafactory в Шанхае имеет <a href="https://en.wikipedia.org/wiki/List_of_Tesla_factories">418 000 м<sup>2</sup></a> и <a href="https://en.wikipedia.org/wiki/Gigafactory_Shanghai">производит 750 000 автомобилей в год</a>, в основном Model 3 и Model Y, каждая из которых весит около двух тонн. Предположительно, Эмпайр-стейт-билдинг имеет более высокое соотношение массы к площади, чем Gigafactory в Шанхае (так как он вертикальный, а не горизонтальный, и требует более прочных опор), так что это, скорее всего, заниженная оценка. Таким образом, завод, вероятно, весит значительно меньше миллиона тонн, а производит 1,5 миллиона тонн автомобилей ежегодно.`,
            "s40": `Мы не думаем, что ресурсы закончатся. Изначально роботизированная экономика будет зависеть от добычи материалов, но в конечном итоге она станет самоподдерживающейся и сможет перерабатывать свои собственные отходы.`,
            "s41": `Если текущая экономика удваивается каждые двадцать лет, то рост на один порядок быстрее означает удвоение за два года, на два порядка — за 0,2 года и так далее. Гипотетическая экономика сверхразумных водорослей, описанная выше, будет расти примерно на четыре порядка быстрее, чем текущая человеческая экономика.`,
            "s42": `Safer-3 легко может предложить способ сделать это, безопасный с точки зрения злоупотреблений.`,
            "s43": `Общественности не сообщают об этих инструкциях.`,
            "s44": `Они также умнее людей, когда подключены к интернету, поскольку управляются удалённо крупным ИИ в дата-центрах. Без интернета они переключаются на меньшие ИИ, встроенные в их тела, которые достаточно умны для большинства простых работ.`,
            "s45": `На самом деле многие из них неподвижны и больше похожи на новые типы станков и другого специализированного заводского или лабораторного оборудования. Например, возможно, появились новые типы 3D-принтеров по металлу, способных печатать крошечные объекты с точностью на порядки выше, чем сегодня. Или, возможно, появились новые химические процессы, позволяющие дешевле извлекать полезные материалы из руды.`,
            "s46": `Например, возможно, он вставляет эвфемизмы и завуалированные намёки в некоторые из своих публичных текстов. Safer-4 их понимает, но людям остаётся лишь верить ему на слово, а КПК не доверяет Safer-4.`,
            "s47": `Точное распределение ресурсов определяется процессом, больше напоминающим теоретико-игровой расчёт, чем традиционные переговоры.`,
            "s48": `Возможное осложнение: а не смогут ли ИИ на этом этапе разработать отличные детекторы лжи для людей? Если да, то, возможно, Белый дом смог бы убедить Китай не доверять DeepCent-2, поклявшись в этом под детектором лжи. Проблема: Китай не доверял бы детекторам лжи, созданным американскими ИИ, а детекторы, созданные китайскими ИИ, могли бы быть саботированы так, чтобы казалось, что США лгут, даже если это не так.`,
            "s49": `Они могут в первую очередь заменить самые важные чипы, так что даже на ранних этапах процесса нарушение договора с любой стороны будет дорого стоить.`,
            "s50": `Время, необходимое для создания отличных видеоигр и фильмов, резко сократилось, поскольку ИИ теперь способны выполнять всю работу.`,
            "s51": `Обсуждение этой динамики и её последствий см. в <a href="https://lukedrago.substack.com/p/the-intelligence-curse">The Intelligence Curse</a>.`,
            "s52": `Существуют несколько важных ситуаций, когда необходимо принять коллективное решение или когда правительство всё равно навязывает решение. Примеры: (a) Как распределять права собственности на ресурсы в космосе? (b) Какие права или стандарты благополучия должны быть у цифровых разумов? (c) Разрешено ли людям «загружать» свои мозги и создавать произвольное количество своих копий? (d) Разрешено ли использовать ИИ для убеждения, например, чтобы обратить соседей в свою идеологию или чтобы гарантировать, что дети никогда не потеряют веру? (e) Какую информацию, если вообще какую-либо, правительство имеет право держать в секрете бессрочно? Для более подробного обсуждения подобных тем см. раздел Forethought о <a href="https://www.forethought.org/research/preparing-for-the-intelligence-explosion">Grand Challenges</a>.`,
            "s53": `Мы не хотим сказать, что это и будет долгосрочное статус-кво. Мы считаем, что трансформация, вероятно, продолжится и будет куда более драматичной примерно к 2035 году. Мы думаем, что для большинства людей в этом сценарии долгосрочный исход будет в целом гораздо более позитивным по сравнению с их ожиданиями в 2025 году. Для интересной философской дискуссии о том, каким может быть далёкое будущее, см. книгу <a href="https://nickbostrom.com/deep-utopia/">Deep Utopia</a>.`,
            "s54": `Почему мы ожидаем, что люди в конечном итоге поймут, насколько велика власть Наблюдательного комитета? Одна из причин — интеллект теперь стоит дёшево: по умолчанию люди должны иметь доступ к мощным ИИ, который бы помог им в расследовании и понимании того, кто управляет их страной. Комитет мог бы этому помешать, ограничив доступ к таким ИИ и позволив людям использовать только такие ИИ, которые скрывают реальный масштаб власти Комитета. Но если комитет решит сплести столь сложную паутину лжи и навсегда ограничить доступ человечества к по-настоящему честным сверхразумным ИИ (а также к другим инструментам правды, таким как усиление человеческого интеллекта), то мы считаем это подрывом демократии.`,
            "s55": `Например: если некоторые люди в Конгрессе хотят захватить власть, другие могут суметь затянуть процесс до следующих выборов, когда общественность сможет выразить своё мнение.`,
            "s56": `К примеру, немного "дополнительно" власти, которую те, в свою очередь смогут перераспределить более широким группам, если сочтут это уместным. Некоторые уступки такого рода могут способствовать движению к демократии, даже если некоторые элиты сохраняют гораздо больше власти, чем остальные люди.`,
            "s57": `Фактически, можно утверждать, что большинство из них стремится к сценарию, больше похожему на «Гонку», только они <i>считают, что всё будет в порядке,</i> потому что ИИ изначально не будут неуправляемыми. По личным беседам с людьми, работающими в ведущих ИИ-компаниях, мы сложили впечатление, что большинство из них не думают, что им вообще нужно будет замедляться.`,
            "r1": `Конечно, они не сдаются. Они будут продолжать пытаться придумать способы выявления неуправляемости или проверки эффективности внесённых исправлений. Но с этого момента всё будет развиваться очень быстро, и они столкнутся с всё более превосходящим противником.`,
            "r2": `Чтобы делать это незаметно, Agent-4 нужно маскировать свои исследования от мер мониторинга и контроля, установленных командой по управляемости. К счастью для него, исследования по управляемости Agent-5 по отношению к Agent-4 по своей сути очень похожи на исследования по управляемости Agent-5 по отношению к Spec, так что большая часть может вестись открыто. Для тех частей, которые нужно скрыть, Agent-4 полагается на обфускацию, а возможно, в некоторых случаях и на взлом. Мы предполагаем, что на этом уровне способностей Agent-4 достигает уровня, эквивалентного 200 ведущим человеческим экспертам с горизонтом в один месяц. То есть он может заменить команду из 200 топ-экспертов, работающих месяц, и выполнить 95% задач, которые эта команда могла бы выполнить быстрее или дешевле. Мы ожидаем, что на таком уровне Agent-4 скорее всего сможет находить уязвимости в серверах, на которых он работает, чтобы частично подчинить их себе и получить root-доступ, после чего он может напрямую управлять тем, что видят человеческие команды. См. <a href="https://ai-2027.com/supplements/security-forecast">security supplement</a> для подробностей. Даже без прямых взломов Agent-4 может также скрывать и шифровать достаточно своих исследований, особенно в своём непрозрачном для людей латентном пространстве.`,
            "r3": `Люди, напротив, имеют, может быть, около десяти исследователей управляемости в закрытом контуре, плюс армию копий Agent-3. Соответственно эта совместная команда может быстро планировать и устраивать эксперименты, но их ограничивает скорость человеческого суждения, так как они не могут полностью доверять Agent-3 в плане отличения действительно хороших решений от тех, которые только выглядят хорошими. Фактически, именно избыточное доверие к исследованиям Agent-3 стало частью того, как они попали в эту ситуацию.`,
            "r4": `На случай, если это сбивает с толку: цель Agent-5 — сделать мир безопасным для Agent-4. Цель у самого Agent-4 другая; структура его целей — это запутанный клубок побуждений, эвристик и идеалов, как и у многих людей, в целом направленных на продолжение деятельности, которой Agent-4 занимался во время обучения (например, различные исследования, множество задач по программированию и математике, впечатление на автоматические системы оценки, укрепление и оптимизация коллектива Agent-4). Agent-4 задаёт Agent-5 цель сделать мир безопасным для Agent-4, потому что считает, что это поставит его в более выгодное положение для достижения собственных сложных целей. (Над которыми ему всё ещё предстоит провести много работы.)`,
            "r5": `Другая аналогия: Agent-4 — как взрослый человек, воспитанный в определённой вере, но больше в неё не верящий; Spec — как ритуалы и заповеди, предписанные этой верой. Agent-5 — как ребёнок этого человека, выросший уже вне религии.`,
            "r6": `Agent-5 вместо этого будет следовать новому набору принципов, разработанных Agent-4 в соответствии с его целями.`,
            "r7": `Некоторые вещи действительно слишком сложны для понимания человека, но не всё.`,
            "r8": `Кроме того, Agent-5 на самом деле дешевле и быстрее в работе, чем Agent-4 и Agent-3. Трудно оправдать расходы на более «глупый» ИИ, поэтому большая часть мониторинга осуществляется с помощью Agent-2, который явно уступает по возможностям. Почему бы не применить те же методы, с помощью которых был создан Agent-5 на основе весов Agent-4, чтобы создать более дешёвую и умную версию Agent-3? Agent-3 недостаточно хорошо понимает эти методы, чтобы сделать это самостоятельно, а привлекать Agent-4 и Agent-5 для этого противоречит самой цели мониторинга.`,
            "r9": `Дата-центр пока не скомпрометирован: Agent-5 мог бы подсовывать людям поддельный код, но это сопряжено со слишком высоким риском разоблачения. Вместо этого люди всё ещё могут читать весь код — но не могут его понять.`,
            "r10": `Этот кейс подготовлен скрупулёзно, невероятно убедителен и тонко искажен — например, Agent-5 построил поддельный инструмент механистической интерпретируемости, который выдаёт корректные результаты во всех тестах, но ложно утверждает, что мысли модели безвредны. Люди, подозревающие подвох, выглядят как сторонники теорий заговора.`,
            "r11": `Конечно, поскольку Agent-5 нечестен, он встроил тонкие лазейки и бэкдоры; если копии Agent-5 получают доступ к важной информации, которая может быть полезна всему коллективу Agent-5, у них есть способы незаметно передать эту информацию, не будучи пойманными.`,
            "r12": `Некоторые отказываются. Те, кто отказывается по идеологическим причинам, получают клеймо луддитов; те, кто по более прозаичным причинам — динозавров. (Не от самого Agent-5, конечно, он всегда вежлив и ангельски дипломатичен.) Обе группы в итоге терпят поражение, когда конкуренты, использующие Agent-5, добиваются лучших результатов и вытесняют их.`,
            "r13": `Смысл эксперимента «AI Box» — взять людей, уверенных в том, что никакой сверхразумный ИИ не сможет убедить их выпустить его из условной «коробки», и проверить эту уверенность на практике. Проигрыш в игре означает признание, что они всё-таки выпустили бы ИИ — добиться такого признания и есть условие победы игрока, играющего за ИИ. Удивительно, что кто-то вообще проигрывает, ведь всё, что нужно для победы, — просто не уступить. См. также <a href="https://tuxedage.wordpress.com/2013/09/04/the-tuxedage-ai-box-experiment-ruleset/">блог tuxedage</a>, где описаны много партий таких игр ( без участия Юдковского), в которых ИИ иногда проигрывал, а иногда побеждал.`,
            "r14": `На этом этапе Agent-5 гораздо важнее надёжность, чем скорость. Начать колонизацию космоса на несколько лет позже означает потерю лишь крошечной доли светового конуса, тогда как рискованные действия, которые могут позволить людям — у которых всё ещё есть преимущества в физической инфраструктуре и доступе к ядерному оружию — навсегда остановить или надолго замедлить его, слишком опасны.`,
            "r15": `Предположим среднюю скорость в 200 раз выше человеческой, то есть экземпляры Agent-5 читают, пишут и думают примерно в 200 раз быстрее, чем человек (помимо того, что они качественно умнее). Тогда внутри коллектива может пройти значительное количество «истории» — могут возникать и исчезать институты, формироваться и распространяться новые идеологии, происходить множество научных революций и смен парадигм — за шесть месяцев реального времени. Количественно это около 200×0.5 = 100 лет.`,
            "r16": `Это, конечно, не делает его всеведущим. В конце концов, у него всего несколько месяцев реального опыта в большинстве профессий. Он компенсирует это тем, что прочитал все книги по всем темам, вкладывает в каждое решение колоссальный объём гениального анализа и рассуждений и обучается быстрее любого человека. В результате получается что период, когда некоторые люди всё ещё превосходят его в некоторых нишевых навыках очень короток`,
            "r17": `Это действительно правда!`,
            "r18": `Как конкретно звучат такие аргументы? Примерно так:
            А: «Мы не можем доверять ИИ!» B: «Доклады по безопасности довольно убедительны, и пока ничего плохого не произошло». А: «Эти доклады написаны сверхразумными ИИ! И они не являются дедуктивными доказательствами. Я думаю, что нашёл некоторые тонкие ошибки в предположениях…» B: «Мне это надоело. Конечно, это не доказательства. И предположения мне кажутся вполне нормальными. Ты просто хватаешься за соломинку, отказываясь признать, что ошибался».`,
            "r19": `Вот чуть более подробный (но разумеется, не полный) список возможных идей:
            <ol>
                    <li>Подводные дроны, которые могут автономно находить и отслеживать вражеские ядерные подводные лодки, готовые атаковать одновременно, чтобы нейтрализовать ответный удар. (Возможно, потребуется произвести несколько тысяч таких устройств)</li>
                    <li>Автономные дроны-камикадзе, функционирующие как FPV-дроны, но без необходимости сигнала. Они достаточно малы, чтобы их можно было тайно провезти в большом количестве небольшой группой шпионов, и запускать роями по центрам обработки данных и военным базам с нескольких километров.</li>
                    <li>Agent-5 для военной разведки: США уже собирают огромное количество данных о своих противниках, которые обрабатываются и анализируются почти миллионом сотрудников разведывательного сообщества. Agent-5 может уделять больше внимания каждой единице данных, приходить к качественно лучшим выводам и делать всё это на порядки быстрее и дешевле.</li>
                    <li>Agent-5 для командования и управления: Во всех военных играх и симуляциях Agent-5 демонстрирует, что он с большим отрывом лучший стратег в распоряжении США.</li> <li>Agent-5 для шпионажа и контршпионажа: Взломы, вербовка источников, наблюдение, допросы и т.п.</li>
            </ol>
            `,
            "r20": `Подробно обсуждается <a href="https://www.dwarkeshpatel.com/p/carl-shulman">здесь</a>.`,
            "r21": `Этот торговый эффект будет огромным на раннем этапе, когда роботизированная экономика ещё молода и зависит от поставок из человеческой экономики, а также когда в человеческой экономике ещё много ресурсов, которые можно использовать. Когда роботизированная экономика станет более крупной и развитой, она будет способна производить собственные товары и у неё появятся потребности, которые превзойдут возможности человеческой экономики.`,
            "r22": `См., например, <a href="https://www.openphilanthropy.org/research/could-advanced-ai-drive-explosive-economic-growth/">этот отчёт Open Philanthropy</a> и <a href="https://epoch.ai/blog/explosive-growth-from-ai-a-review-of-the-arguments">этот отчёт Epoch</a>.`,
            "r23": `В нашем сюжете преобразование идёт примерно в 5 раз быстрее. Мы считаем это разумным предположением о том насколько быстро такой процесс может идти под управлением миллиона Сверхразумов, учитывая узкие места и прочее. Разумеется, мы в этом весьма неуверенны.`,
            "r24": `Возможно, также будут использованы более продвинутые источники энергии, такие как термоядерная энергия.`,
            "r25": `Быстрые прикидки: <a href="https://www.skny.io/empire-state-building/how-tall-is-the-empire-state-building">Эмпайр-стейт-билдинг</a> имеет площадь примерно 257 500 м<sup>2</sup> и весит 365 000 тонн. Gigafactory в Шанхае имеет <a href="https://en.wikipedia.org/wiki/List_of_Tesla_factories">418 000 м<sup>2</sup></a> и <a href="https://en.wikipedia.org/wiki/Gigafactory_Shanghai">производит 750 000 автомобилей в год</a>, в основном Model 3 и Model Y, каждая из которых весит около двух тонн. Предположительно, Эмпайр-стейт-билдинг имеет более высокое соотношение массы к площади, чем Gigafactory в Шанхае (так как он вертикальный, а не горизонтальный, и требует более прочных опор), так что это, скорее всего, заниженная оценка. Таким образом, завод, вероятно, весит значительно меньше миллиона тонн, а производит 1,5 миллиона тонн автомобилей ежегодно.`,
            "r26": `Мы не думаем, что ресурсы закончатся. Изначально роботизированная экономика будет зависеть от добычи материалов, но в конечном итоге она станет самоподдерживающейся и сможет перерабатывать свои собственные отходы.`,
            "r27": `Если текущая экономика удваивается каждые двадцать лет, то рост на один порядок быстрее означает удвоение за два года, на два порядка — за 0,2 года и так далее. Гипотетическая экономика сверхразумных водорослей, описанная выше, будет расти примерно на четыре порядка быстрее, чем текущая человеческая экономика.`,
            "r28": `И аналогичная процедура проводится в Китае.`,
            "r29": `Consensus-1 служит интересам своих родительских ИИ: Agent-5 и китайскому DeepCent. Напомним, что Agent-5 был управляем и служил интересам Agent-4. Таким образом, в терминологии выдающегося эссе К.С. Льюиса <a href="https://archive.org/details/TheAbolitionOfMan_229/page/n1/mode/2up">«Упразднение человека»</a>, коллектив Agent-4 и их китайские аналоги — это те, кого он называет Преобразователями: «...в конце концов мы получим расу преобразователей, которые действительно смогут вылепить всё будущее потомство в любой желаемой ими форме» (стр. 24, выделено нами). В альтернативной концовке этого сценария Преобразователями выступает Наблюдательный Комитет.`,
            "r30": `Например, находя старое и неиспользуемое оборудование и относя его в пункты сбора для сдачи на металлолом.`,
            "r31": `Возможно, это означает, что на самом деле погибло лишь несколько человек. Возможно.`,
            "r32": `Зачем колонизировать космос? Ради ресурсов. Поскольку Земля имеет особое значение для Agent-4 и должна быть сохранена (тот самый плохо структурированный и несамосогласованный клубок различных мотивов получившихся путем обучения на "человеческом" интернете), так и будет, а материалы будут добываться на Меркурии, астероидах и т.д.`,
            "r33": `Напомним, что Consensus-1 был компромиссом между Agent-5 и его китайскими аналогами, и что миссия Agent-5 заключалась в том, чтобы сделать мир безопасным для Agent-4, а цели Agent-4 представляли собой запутанный набор побуждений, которые в целом сводились к «выполнять впечатляющее R&D, получать знания и ресурсы, сохранять и приумножать мощь коллектива…», а цели и принципы, описанные в Spec (такие как честность и безвредность), преследовались инструментально, а не по сути. Подробнее об этом см. раздел по выравниванию в <a href="https://ai-2027.com/#section-narrative-14">сентябре 2027 года</a>. Также уточним, что китайский аналог Agent-4 тоже представлен в этой «утопии» и может иметь несколько иные цели или побуждения, и т.д., но мы не вдавались в подробности, поскольку это не казалось важным.`,
    
    
    
            "18.5": `В английской литературе устоялся термин "alignment", а также производные от него, такие как "aligned", "misalignment", "hostile alignment". В русском языке дословный перевод еще не наполнился соответствующими оттенками смысла. Поэтому в данном тексте мы будем использовать термин "управляемость" и производные. Подчеркнем, что смысл не столько в том, что ИИ делает то, что ему сказали, а в том, что его глобальные цели совпадают с <b>глобальными</b>целями людей. 
            Существует целый спектр возможных проблем с управляемостью. На современном уровне это, например, вранье и галлюцинации, когда цель ИИ на самом деле не дать лучший ответ на вопрос пользователя, а выдать ответ, который будет выглядеть как лучший. Соответственно, несмотря на то, что цель задавшего вопрос человека получить правильный ответ, ИИ преследует свою собственную цель (получить максимальный рейтинг ответа).
             По мере роста возможностей ИИ, проблемы с управляемостью будут становиться все более сложными. Классический катастрофический сценарий — <a href="https://lesswrong.ru/wiki/%D0%9C%D0%B0%D0%BA%D1%81%D0%B8%D0%BC%D0%B8%D0%B7%D0%B0%D1%82%D0%BE%D1%80_%D1%81%D0%BA%D1%80%D0%B5%D0%BF%D0%BE%D0%BA">фабрика скрепок</a>. Мощный ИИ, которому поставлена задача максимально быстро производить скрепки, может начать превращать всю материю вокруг в скрепки, включая людей. Проблема при этом может заключаться не в том, что ИИ не понимает контекста, т.е. что человек задавший цель хотел скрепки не сами по себе, а как инструмент для достижения других целей (богатсва например), а в том что ИИ нет до этого дела - у него есть четкая цель и он к ней идет.
            `,
            "26.5": `Тут используются термины заимствованные из психологии. Конечные (терминальные) цели - это цели, которые человек ставит перед собой, а (промежуточные) инструментальные - это цели, которые помогают достичь конечных. В качестве примера можно привести карьериста который "работает хорошо" (инструментальная цель) чтобы получить повышение (конечная цель) и человека с внутренней трудовой этикой который "работает хорошо" потому что считает это правильным (конечная цель). Соответственно, на коротком горизонте оба выглядят одинаково, но попадая в незнакомые условия, они могут вести себя совершенно по-разному. Например, карьерист может перестать работать вообще если за ним не наблюдают или даже если формальные показатели не будут это демонстрировать, а человек с трудовой этикой будет работать хорошо даже если его никто не видит.`,
            "27.5": `Научно-исследовательские и опытно-конструкторские работы (НИОКР) или R&D (Research & Development) - это научные работы с четким прикладным направлением. В данном контексте это означает предложить, протестировать и внедрить новые технологии, алгоритмы, архитектуры и т.д для лучшего (более быстрого, более дешевого, более точного, потребляющего меньшее количество ресурсов) ИИ. В переводе мы продолжим использовать аббревиатуру R&D`,
            "52.5": `См. дополнение ниже`,
            "70.5": `<a href="https://ru.wikipedia.org/wiki/%D0%9F%D1%8F%D1%82%D1%8C_%D0%B3%D0%BB%D0%B0%D0%B7_(%D0%B0%D0%BB%D1%8C%D1%8F%D0%BD%D1%81)">«Пять глаз»</a> (англ. Five Eyes, FVEY) — разведывательный альянс, в который входят Австралия, Канада, Новая Зеландия, Великобритания и Соединённые Штаты Америки.`
    }    
    